emacs-config.org
#+title: Mitch's Emacs Configuration
#+author: Mitch Fisher
#+date: 2024-05-11
#+OPTIONS: toc:nil h:4
#+STARTUP: showeverything
#+PROPERTY: header-args:emacs-lisp :tangle ./init.el :results silent :exports code :mkdirp yes

* Welcome!

This ORG file will configure the  ~init.el~  file based upon all of the =emacs-lisp= source blocks. The =emacs-lisp= source blocks are defined in an organized order. While these blocks can generally be moved around, there are some order dependencies. So it's generally best that this order be preserved to prevent any compile-time issues.

The goal of this Emacs configuration is to make an Emacs configuration that has a good collection of popular options. So far, the following collections of options are included here:


- Landing Screen Options ::
  + Dashboard
  + IELM (Integrated Emacs Lisp Mode)
  + Default *scratch* buffer
  
- Completion Frameworks:
  + Vertico, Consult
  + Ivy, Counsel, Swiper
  + Corfu

- Undo Handlers
  + =Vundo=
  + Undo-tree
    
- Debug Adapters
  + DAPE
  + DAP

- Integrated Development Environments
  + =Elpy=
  + =Eglot=
  + Stand-alone LSP
  + LSP Bridge (experimental)
  + Anaconda-mode for Python
    
- Project Options
  + Projectile
  + project.el
    
- Custom Themes
  + Several popular themes that are easy to cycle between and also good on the eyes.
    
- Other Optional Features
  + Game Boy Development Packages
  + Neo Tree
  + Golden Ratio
  + Embark
  + Customizable Menu (MmM)


* README:

--------------------------------------------------------------------------------

- This configuration requires Emacs 29.1+

- While this configuration includes support for several languages - and I mean support for syntax highlighting and, to some extent, debugging - this configuration caters to be a Python development environment.

- The C/C++ debugger for these type of programs are done via LSP/LLDB and [[RealGUD][RealGUD]]. The chosen =debug-adapter= custom variable doesn't apply. The reason for this is that the DAP/LSP/LLDB interaction doesn't work properly on my =Apple Silicon= mac. Until GDB supports =ARM= instruction sets then this (=RealGUD=) will remain as the only best way to support a more integrated debugging experience.

- Python can use either =dap= or =dape= which is the reasoning behind the =debug-adapter= custom variable.

- If auto-tangling doesn't work because of a problem in the generated ~init.el~ file, then tangling can be done manually by either using ~(C-c C-v t)~ or by calling the =org-babel-tangle= M-x command.

- When starting this Configuration for the very first time, set the =use-package-always-ensure= variable to =t=. This will force all packages to be installed even if deferred. Make sure to set this value back to =nil= after everything is loaded otherwise Emacs startup time will be impacted. This can be found in the [[Bootstrap straight][Bootstrap straight]] section.

- Take a look a the [[Custom enable flags][Custom Variables]] and [[Customization groups][Groups]] section to see what options exist. It's important to note that these variables need to be adhered to. Another thing to note is that the various =enable*= flags are not used as =:if= option in =use-package= statement. Instead, a lisp conditional statement is used so that the package is actually never loaded or installed. This improves overall startup performance.
  
- Shout out to the many people in the Emacs community from which a lot of this configuration took inspiration from.
  
--------------------------------------------------------------------------------


* early-init.el
** Package archives

#+begin_src emacs-lisp :tangle "early-init.el" 
  ;;; --------------------------------------------------------------------------

  ;; Adjust garbage collection threshold for early startup (see use of gcmh below)
  (setq gc-cons-threshold (* 100 1024 1024))

  ;; Process performance tuning

  (setq read-process-output-max (* 4 1024 1024))
  (setq process-adaptive-read-buffering nil)

  (setq package-vc-register-as-project nil) ; Emacs 30
  (add-hook 'package-menu-mode-hook #'hl-line-mode)

  (setq package-archives
    '(( "gnu-elpa" . "https://elpa.gnu.org/packages/")
       ( "nongnu" . "https://elpa.nongnu.org/nongnu/")
       ( "gnu-dev" . "https://elpa.gnu.org/devel/")
       ( "melpa" . "https://melpa.org/packages/")
       ( "org" . "https://orgmode.org/elpa/")
       ( "melpa-stable" . "https://stable.melpa.org/packages/")))

  ;; Highest number gets priority (what is not mentioned has priority 0)
  (setq package-archive-priorities
    '(
       ( "org" . 99 )
       ( "gnu-elpa" . 50 )
       ( "melpa-stable" . 40 )
       ( "melpa" . 30 )
       ( "nongnu" . 10)
       ( "gnu-dev" . 20 )
       ))

  (setq gnutls-algorithm-priority "NORMAL:-VERS-TLS1.3") ;; w/o this Emacs freezes when refreshing ELPA

#+end_src

** Configure use-package

#+begin_src emacs-lisp :tangle "early-init.el" 

  (setq use-package-compute-statistics t
    use-package-verbose t
    use-package-always-ensure nil
    use-package-always-demand nil
    use-package-always-defer nil)
#+end_src

** Calculate startup time
#+begin_src emacs-lisp :tangle "early-init.el" 

  (add-hook 'emacs-startup-hook
    (lambda ()
      (setq startup-time-message
        (format "Emacs read in %.2f seconds with %d garbage collections."
        (float-time (time-subtract after-init-time before-init-time))
        gcs-done))
      (message startup-time-message)))

#+end_src

** Garbage Collection
#+begin_src emacs-lisp :tangle "early-init.el" 

  ;; (use-package gcmh
  ;;   :diminish gcmh-mode
  ;;   :config
  ;;   (setq gcmh-idle-delay 5
  ;;     gcmh-high-cons-threshold (* 16 1024 1024))      ; 16mb
  ;;   (gcmh-mode 1))

  (add-hook 'emacs-startup-hook
    (lambda ()
      (setq gc-cons-percentage 0.1))) ;; Default value for `gc-cons-percentage'

#+end_src

#+begin_src emacs-lisp :tangle "early-init.el" 
  ;;; early-init.el ends here.
#+end_src


* Elpaca bootstrap

This section just sets up the starting part of the ~init.el~ file. These includes Elpaca bootrapping and other types of global setup.

** Lispy Header
This is the standard format of a =lisp= header that should appear for all =lisp= scripts. It also indicates that the ~init.el~ file is generated from this ~Configure.org~ file.

#+begin_src emacs-lisp
  ;;; init.el -*- flycheck-disabled-checkers: (emacs-lisp); lexical-binding: nil -*-
  ;;;
  ;;; Commentary:

  ;; This file bootstraps the configuration which is generated from tangling an org-mode file.
  ;; So, DO NOT MODIFY this file directly as changes will be overwritten.

  ;;; Code:

  ;; Produce backtraces when errors occur: can be helpful to diagnose startup issues
  ;; (setq debug-on-error t)
  ;;

#+end_src

** Elpaca Bootstrap

Elpaca is an elisp package manager. It allows users to find, install, update, and remove third-party packages for Emacs. It is a replacement for the built-in Emacs package manager, package.el.

Elpaca:

- Installs packages asynchronously, in parallel for fast, non-blocking installations.
- Includes a flexible UI for finding and operating on packages.
- Downloads packages from their sources for convenient elisp development.
- Supports thousands of elisp packages out of the box (MELPA, NonGNU/GNU ELPA, Org/org-contrib).
- Makes it easy for users to create their own ELPAs.

#+begin_src emacs-lisp

  (defvar elpaca-installer-version 0.7)
  (defvar elpaca-directory (expand-file-name "elpaca/" user-emacs-directory))
  (defvar elpaca-builds-directory (expand-file-name "builds/" elpaca-directory))
  (defvar elpaca-repos-directory (expand-file-name "repos/" elpaca-directory))
  (defvar elpaca-order '(elpaca :repo "https://github.com/progfolio/elpaca.git"
                          :ref nil :depth 1
                          :files (:defaults "elpaca-test.el" (:exclude "extensions"))
                          :build (:not elpaca--activate-package)))
  (let* ((repo  (expand-file-name "elpaca/" elpaca-repos-directory))
          (build (expand-file-name "elpaca/" elpaca-builds-directory))
          (order (cdr elpaca-order))
          (default-directory repo))
    (add-to-list 'load-path (if (file-exists-p build) build repo))
    (unless (file-exists-p repo)
      (make-directory repo t)
      (when (< emacs-major-version 28) (require 'subr-x))
      (condition-case-unless-debug err
        (if-let ((buffer
                   (pop-to-buffer-same-window "*elpaca-bootstrap*"))
                  ((zerop (apply #'call-process
                            `("git" nil ,buffer t "clone"
                               ,@(when-let ((depth (plist-get order :depth)))
                                   (list (format "--depth=%d" depth)
                                     "--no-single-branch"))
                               ,(plist-get order :repo) ,repo))))
                  ((zerop (call-process "git" nil buffer t "checkout"
                            (or (plist-get order :ref) "--"))))
                  (emacs (concat invocation-directory invocation-name))
                  ((zerop (call-process emacs nil buffer nil "-Q" "-L" "." "--batch"
                            "--eval" "(byte-recompile-directory \".\" 0 'force)")))
                  ((require 'elpaca))
                  ((elpaca-generate-autoloads "elpaca" repo)))
          (progn (message "%s" (buffer-string)) (kill-buffer buffer))
          (error "%s" (with-current-buffer buffer (buffer-string))))
        ((error) (warn "%s" err) (delete-directory repo 'recursive))))
    (unless (require 'elpaca-autoloads nil t)
      (require 'elpaca)
      (elpaca-generate-autoloads "elpaca" repo)
      (load "./elpaca-autoloads")))
  (add-hook 'after-init-hook #'elpaca-process-queues)
  (elpaca `(,@elpaca-order))
  (elpaca elpaca-use-package
    (elpaca-use-package-mode 1)
    (setq elpaca-use-package-by-default t))
  ;; (use-package emacs :ensure nil :config (setq ring-bell-function #'ignore))

#+end_src


* Custom Groups and Variables

Set various variables to =t= to turn on a specific feature or =nil= to disable it. Changing any of these values will require a restart of ~emacs~ since these values are inspected only during startup.

*Note:* There are no thorough dependency check done if any of these values is enabled or disabled. There has been some effort, for example, to enable a keymap if ~dap~ or ~dape~ is enabled. But if something enabled requires some not obvious package to be installed, this isn't checked.

Other variables are also defined here that define other emacs behaviors and defaults.

