init.el
;;; Define my customization groups

(defgroup mrf-custom nil
  "M.R. Fisher's configuration section."
  :group 'Local)

(defgroup mrf-custom-toggles nil
  "A set of toggles that enable or disable  specific packages."
  :group 'mrf-custom)

(defgroup mrf-custom-features nil
  "Customization from a selection of specific features and handlers."
  :group 'mrf-custom)

(defgroup mrf-custom-fonts nil
  "Customization of fonts and sizes."
  :group 'mrf-custom)

(defgroup mrf-custom-theming nil
  "Custom theming values."
  :group 'mrf-custom)

;;; --------------------------------------------------------------------------

(defcustom dashboard-landing-screen t
  "If set to t, the `dashboard' package will be displayed once emacs has
finished initializing. If this value is nil, then the *scratch* buffer will be
shown instead.

The Dashboard will be in the *dashboard* buffer and can also be opened using
\"C-c d\" or \"M-RET d\" from anywhere even if this value is nil."
  :type 'boolean
  :group 'mrf-custom)

(defcustom custom-docs-dir "~/Documents/Emacs-Related"
  "A directory used to store documents and customized data."
  :type 'string
  :group 'mrf-custom)

(defcustom working-files-directory
  (expand-file-name "emacs-working-files" custom-docs-dir)
  "The directory where to store Emacs working files."
  :type 'string
  :group 'mrf-custom)

(defcustom custom-org-fill-column 120
  "The fill column width for Org mode text.
    Note that the text is also centered on the screen so that should
    be taken into consideration when providing a width."
  :type 'natnum
  :group 'mrf-custom)

;;; --------------------------------------------------------------------------
;;; Feature Toggles

(defcustom enable-gb-dev nil
  "If set to t, the z80-mode and other GameBoy related packages
    will be enabled."
  :type 'boolean
  :group 'mrf-custom-toggles)

(defcustom enable-ts nil
  "Set to t to enable TypeScript handling."
  :type 'boolean
  :group 'mrf-custom-toggles)

(defcustom enable-centaur-tabs nil
  "Set to t to enable `centaur-tabs' which uses tabs to represent open buffer."
  :type 'boolean
  :group 'mrf-custom-toggles)

(defcustom enable-neotree nil
  "Set to t to enable the `neotree' package."
  :type 'boolean
  :group 'mrf-custom-toggles)

(defcustom enable-golden-ratio nil
  "Set to t to enable `golden-ratio-mode' which resizes the active buffer
   window to the dimensions of a golden-rectangle"
  :type 'boolean
  :group 'mrf-custom-toggles)

(defcustom enable-org-fill-column-centering nil
  "Set to t to center the visual-fill column of the Org display."
  :type 'boolean
  :group 'mrf-custom-toggles)

(defcustom enable-embark nil
  "Set to t to enable the Embark package."
  :type 'boolean
  :group 'mrf-custom-toggles)

;; Keep as defvar until the frameset save/restore process works better.
(defvar enable-frameset-restore nil
  "Set to t to enable restoring the last Emacs window size and position
   upon startup.")
  ;; :type 'boolean
  ;; :group 'mrf-custom-toggles)

;;; --------------------------------------------------------------------------

(defcustom undo-handler 'undo-handler-vundo
  "Select the undo handler to use.

Vundo is a minimalistic undo handler that provides a simple, graphical undo
horizontal tree.

Undo-tree is a very mature and full featured undo handler. It also has the
capability to persist undo history across Emacs sessions.

Finally, the standard undo handler can also be chosen."
  :type '(radio
         (const :tag "Vundo (default)" undo-handler-vundo)
         (const :tag "Undo-tree" undo-handler-undo-tree)
         (const :tag "Built-in" undo-handler-built-in))
  :group 'mrf-custom-features)

(defcustom completion-handler 'comphand-vertico
  "Select the default minibuffer completion handler.

Vertico provides a performant and minimalistic vertical completion UI based on
the default completion system.

Ivy is a generic completion mechanism for Emacs. While it operates similarly to
other completion schemes such as icomplete-mode, Ivy aims to be more efficient,
smaller, simpler, and smoother to use yet highly customizable.  The Ivy package
also includes Counsel. Counsel provides completion versions of common Emacs
commands that are customised to make the best use of Ivy.  Swiper is an
alternative to isearch that uses Ivy to show an overview of all matches."
  :type '(radio
         (const :tag "Vertico completion system." comphand-vertico)
         (const :tag "Ivy, Counsel, Swiper completion systems" comphand-ivy-counsel)
         (const :tag "Cofu completion systems" comphand-corfu)
         (const :tag "Built-in Ido" comphand-built-in))
  :group 'mrf-custom-features)

(defcustom debug-adapter 'debug-adapter-dape
  "Select the debug adapter to use for debugging applications.  dap-mode is an
Emacs client/library for Debug Adapter Protocol is a wire protocol for
communication between client and Debug Server. It’s similar to the LSP but
provides integration with debug server.

dape (Debug Adapter Protocol for Emacs) is similar to dap-mode but is
implemented entirely in Emacs Lisp. There are no other external dependencies
with DAPE. DAPE supports most popular languages, however, not as many as
dap-mode."
  :type '(radio
         (const :tag "Debug Adapter Protocol (DAP)" debug-adapter-dap-mode)
         (const :tag "Debug Adapter Protocol for Emacs (DAPE)" debug-adapter-dape))
  :group 'mrf-custom-features)

(defcustom custom-ide 'custom-ide-eglot
  "Select which IDE will be used for Python development.

Elpy is an Emacs package to bring powerful Python editing to Emacs. It
combines and configures a number of other packages, both written in Emacs
Lisp as well as Python. Elpy is fully documented at
https://elpy.readthedocs.io/en/latest/index.html.

Eglot/LSP Eglot is the Emacs client for the Language Server Protocol
(LSP). Eglot provides infrastructure and a set of commands for enriching the
source code editing capabilities of Emacs via LSP. Eglot itself is
completely language-agnostic, but it can support any programming language
for which there is a language server and an Emacs major mode.

Anaconda-mode is another IDE for Python very much like Elpy. It is not as
configurable but has a host of great feaures that just work."
  :type '(radio
         (const :tag "Elpy: Emacs Lisp Python Environment" custom-ide-elpy)
         (const :tag "Emacs Polyglot (Eglot)" custom-ide-eglot)
         (const :tag "Language Server Protocol (LSP)" custom-ide-lsp)
         (const :tag "LSP Bridge (standalone)" custom-ide-lsp-bridge)
         (const :tag "Python Anaconda-mode for Emacs" custom-ide-anaconda))
  :group 'mrf-custom-features)

(defcustom custom-project-handler 'custom-project-project
  "Select which project handler to use."
  :type '(radio (const :tag "Projectile" custom-project-projectile)
           (const :tag "Built-in project" custom-project-project))
  :group 'mrf-custom-features)

;;; --------------------------------------------------------------------------
