init.el
;;; Theming related

(defcustom theme-list '("palenight-deeper-blue"
                       "ef-symbiosis"
                       "ef-maris-light"
                       "ef-maris-dark"
                       "ef-kassio"
                       "ef-bio"
                       "sanityinc-tomorrow-bright"
                       "ef-melissa-dark"
                       "darktooth-dark"
                       "material"
                       "tron-legacy")

  "My personal list of themes to cycle through indexed by `theme-selector'.
If additional themes are added, they must be previously installed."
  :group 'mrf-custom-theming
  :type '(repeat string))

(defcustom default-terminal-theme "sanityinc-tomorrow-bright"
  "The default theme used for a terminal invocation of Emacs."
  :group 'mrf-custom-theming
  :type 'string)

(defcustom theme-selector 0
  "The index into the list of custom themes."
  :group 'mrf-custom-theming
  :type 'natnum)

;;; Font related
(defcustom default-font-family "Fira Code Retina"
  "The font family used as the default font."
  :type 'string
  :group 'mrf-custom-fonts)

(defcustom mono-spaced-font-family "Fira Code Retina"
  "The font family used as the mono-spaced font."
  :type 'string
  :group 'mrf-custom-fonts)

(defcustom variable-pitch-font-family "Helvetica Neue"
  "The font family used as the default proportional font."
  :type 'string
  :group 'mrf-custom-fonts)

(defcustom small-mono-font-size 150
  "The small font size in pixels."
  :type 'natnum
  :group 'mrf-custom-fonts)

(defcustom medium-mono-font-size 170
  "The medium font size in pixels."
  :type 'natnum
  :group 'mrf-custom-fonts)

(defcustom large-mono-font-size 190
  "The large font size in pixels."
  :type 'natnum
  :group 'mrf-custom-fonts)

(defcustom x-large-mono-font-size 220
  "The extra-large font size in pixels."
  :type 'natnum
  :group 'mrf-custom-fonts)

(defcustom small-variable-font-size 170
  "The small font size in pixels."
  :type 'natnum
  :group 'mrf-custom-fonts)

(defcustom medium-variable-font-size 190
  "The small font size in pixels."
  :type 'natnum
  :group 'mrf-custom-fonts)

(defcustom large-variable-font-size 210
  "The small font size in pixels."
  :type 'natnum
  :group 'mrf-custom-fonts)

(defcustom x-large-variable-font-size 240
  "The small font size in pixels."
  :type 'natnum
  :group 'mrf-custom-fonts)

(defcustom custom-default-font-size 170
  "A place to store the most current (face-attribute 'default :height).  This
is specifically for the mono-spaced and default font. The variable type-face
font size is computed + 20 of this value."
  :type 'natnum
  :group 'mrf-custom-fonts)

(defvar custom-default-mono-font-size 170
  "Storage for the current mono-spaced font height.")

(defun mrf/validate-variable-pitch-font ()
  (let* ((variable-pitch-font
           (cond
	     ((x-list-fonts variable-pitch-font-family) variable-pitch-font-family)
	     ((x-list-fonts "SF Pro")           "SF Pro")
	     ((x-list-fonts "DejaVu Sans")      "DejaVu Sans")
	     ((x-list-fonts "Ubuntu")           "Ubuntu")
	     ((x-list-fonts "Helvetica")        "Helvetica")
             ((x-list-fonts "Source Sans Pro")  "Source Sans Pro")
             ((x-list-fonts "Lucida Grande")    "Lucida Grande")
             ((x-list-fonts "Verdana")          "Verdana")
             ((x-family-fonts "Sans Serif")     "Sans Serif")
             (nil (warn "Cannot find a Sans Serif Font.  Install Source Sans Pro.")))))
    (if variable-pitch-font
      (when (not (equal variable-pitch-font variable-pitch-font-family))
	(setq variable-pitch-font-family variable-pitch-font))
      (message "---- Can't find a variable-pitch font to use.")))

  (message (format ">>> variable-pitch font is %s" variable-pitch-font-family)))

(defun mrf/validate-monospace-font ()
  (let* ((monospace-font
           (cond
	     ((x-list-fonts mono-spaced-font-family) mono-spaced-font-family)
	     ((x-list-fonts "Fira Code Retina")  "Fira Code Retina")
	     ((x-list-fonts "Fira Code")         "Fira Code")
	     ((x-list-fonts "Source Code Pro")   "Source Code Pro")
	     ((x-list-fonts "Ubuntu Monospaced") "Ubuntu Monospaced")
             ((x-family-fonts "Monospaced")      "Monospaced")
             (nil (warn "Cannot find a monospaced Font.  Install Source Code Pro.")))))
    (if monospace-font
      (when (not (equal monospace-font variable-pitch-font-family))
	(setq mono-spaced-font-family monospace-font)
	(setq default-font-family monospace-font))
      (message "---- Can't find a monospace font to use.")))

  (message (format ">>> monospace font is %s" mono-spaced-font-family)))

;;; --------------------------------------------------------------------------

;; Use shell path

(defun set-exec-path-from-shell-PATH ()
   ;;; Set up Emacs' `exec-path' and PATH environment variable to match"
   ;;; that used by the user's shell.
   ;;; This is particularly useful under Mac OS X and macOS, where GUI
   ;;; apps are not started from a shell."
  (interactive)
  (let ((path-from-shell (replace-regexp-in-string "[ \t\n]*$" ""
                           (shell-command-to-string "$SHELL --login -c 'echo $PATH'"))))
    (setenv "PATH" path-from-shell)
    (setq exec-path (split-string path-from-shell path-separator))
    (add-to-list 'exec-path "/opt/homebrew/bin")
    (add-to-list 'exec-path "/usr/local/bin")
    (add-to-list 'exec-path "/opt/homebrew/opt/openjdk/bin")
    (add-to-list 'exec-path "/opt/homebrew/opt/node@20/bin/node")
    (setq-default insert-directory-program "gls"
      dired-use-ls-dired t
      ;; Needed to fix an issue on Mac which causes dired to fail
      dired-listing-switches "-al --group-directories-first")))

;;; --------------------------------------------------------------------------
