init.el
;;; Set a variable that represents the actual emacs configuration directory.
;;; This is being done so that the user-emacs-directory which normally points
;;; to the .emacs.d directory can be re-assigned so that customized files don't
;;; pollute the configuration directory. This is where things like YASnippet
;;; snippets are saved and also additional color themese are stored.

(defvar emacs-config-directory user-emacs-directory)

;;; Different emacs configuration installs with have their own configuration
;;; directory.
(make-directory working-files-directory t)

;;; Point the user-emacs-directory to the new working directory
(setq user-emacs-directory working-files-directory)

;;; Put any emacs cusomized variables in a special file
(setq custom-file (expand-file-name "customized-vars.el" user-emacs-directory))
;; create custom file if it does not exists.
(unless (file-exists-p custom-file)
  (write-region "" nil custom-file))
;; (add-hook 'elpaca-after-init-hook (lambda () (load custom-file 'noerror 'nomessage)))
(load custom-file 'noerror 'nomessage)
(setq enable-frameset-restore nil) ;; FORCE UNTIL FRAMESET RESTORE IS DONE

;; ensure that the loaded font values are supported by this OS. If not, try
;; to correct them.
(mrf/validate-variable-pitch-font)
(mrf/validate-monospace-font)

;;; --------------------------------------------------------------------------

(add-to-list 'load-path (expand-file-name "lisp" emacs-config-directory))
(add-to-list 'custom-theme-load-path (expand-file-name "Themes" custom-docs-dir))

;;; --------------------------------------------------------------------------

(setq-default
  window-resize-pixelwise t ;; enable smooth resizing
  window-resize-pixelwise t
  frame-resize-pixelwise t
  dired-dwim-target t       ;; try to guess target directory
  truncate-partial-width-windows 1 ;; truncate lines in partial-width windows
  backup-inhibited t         ;; disable backup (No ~ tilde files)
  auto-save-default nil     ;; disable auto save
  global-auto-revert-mode 1 ;; Refresh buffer if file has changed
  global-auto-revert-non-file-buffers t
  history-length 25          ;; Reasonable buffer length
  inhibit-startup-message t ;; Hide the startup message
  inhibit-startup-screent t
  lisp-indent-offset '2     ;; emacs lisp tab size
  visible-bell t             ;; Set up the visible bell
  truncate-lines 1           ;; long lines of text do not wrap
  fill-column 80             ;; Default line limit for fills
  ;; Triggers project for directories with any of the following files:
  project-vc-extra-root-markers '(".dir-locals.el"
                                 "requirements.txt"
                                 "Gemfile"
                                 "package.json"))

(defconst *is-a-mac* (eq system-type 'darwin))

;;; --------------------------------------------------------------------------
(setq savehist-file (expand-file-name "savehist" user-emacs-directory))
(savehist-mode t)
(setq history-length t)
(setq history-delete-duplicates t)
(setq savehist-save-minibuffer-history 1)
(setq savehist-additional-variables
      '(kill-ring
        search-ring
        regexp-search-ring))

;;; --------------------------------------------------------------------------
;; (global-display-line-numbers-mode 1) ;; Line numbers appear everywhere
(save-place-mode 1)                  ;; Remember where we were last editing a file.
(show-paren-mode 1)
(column-number-mode 1)
(tool-bar-mode -1)                   ;; Hide the toolbar
(global-prettify-symbols-mode 1)     ;; Display pretty symbols (i.e. λ = lambda)
;; (repeat-mode 1)
(add-hook 'prog-mode-hook 'display-line-numbers-mode)

;;; --------------------------------------------------------------------------

(defun mrf/save-desktop-frameset ()
  (unless (daemonp)
    (desktop-save-mode 0)
    (desktop-save-frameset)
    (with-temp-file (expand-file-name "saved-frameset.el" user-emacs-directory)
      (insert
      (format "(setq desktop-saved-frameset %S)" desktop-saved-frameset)))))

(add-hook 'kill-emacs-hook 'mrf/save-desktop-frameset)

;;; --------------------------------------------------------------------------
 
(defun mrf/restore-desktop-frameset ()
  (unless (and (daemonp) (not enable-frameset-restore))
    (let
      ((file (expand-file-name "saved-frameset.el" user-emacs-directory)))
      (desktop-save-mode 0)
      (when (f-exists? file) (load file)
      (desktop-restore-frameset)
      (when (featurep 'spacious-padding)
        (when spacious-padding-mode
          (spacious-padding-mode 0)
          (spacious-padding-mode 1)))))
      ))

;; Allow access from emacsclient
(add-hook 'elpaca-after-init-hook
  (lambda ()
    (use-package server :ensure nil)
    (unless (server-running-p)
      (server-start))))

;; (when (fboundp 'pixel-scroll-precision-mode)
;;    (pixel-scroll-precision-mode))

;;; --------------------------------------------------------------------------

(use-package f
  :ensure ( :package "f" :source "MELPA" :protocol https :inherit t
          :depth 1 :fetcher github :repo "rejeep/f.el"
          :files ("*.el" "*.el.in" "dir" "*.info" "*.texi" "*.texinfo"
                   "doc/dir" "doc/*.info" "doc/*.texi" "doc/*.texinfo"
                   "lisp/*.el" (:exclude ".dir-locals.el" "test.el"
                                 "tests.el" "*-test.el" "*-tests.el"
                                 "LICENSE" "README*" "*-pkg.el"))))

;;; --------------------------------------------------------------------------

(use-package hydra
  :ensure (:repo "abo-abo/hydra" :fetcher github
            :files (:defaults (:exclude "lv.el"))))

;;; --------------------------------------------------------------------------

(defun mrf/set-diminish ()
  (when (equal custom-project-handler 'custom-project-projectile)
    (diminish 'projectile-mode "PrM"))
  (diminish 'anaconda-mode)
  (diminish 'tree-sitter-mode "ts")
  (diminish 'lisp-interaction-mode "Lim")
  (diminish 'counsel-mode)
  (diminish 'lisp-interaction-mode "iLisp")
  (diminish 'golden-ratio-mode)
  (diminish 'mmm-keys-minor-mode "m3k")
  (diminish 'company-box-mode)
  (diminish 'company-mode))

(use-package diminish
  :config
  (if (not elpaca-after-init-time)
    (add-hook 'elpaca-after-init-hook
      (lambda () (run-with-timer 0.5 nil 'mrf/set-diminish)))
    (run-with-timer 1.0 nil 'mrf/set-diminsh)))

;;; --------------------------------------------------------------------------
