emacs-config.org
** Which Key
[[https://github.com/justbur/emacs-which-key][which-key]] is a useful UI panel that appears when you start pressing any key binding in Emacs to offer you all possible completions for the prefix.  For example, if you press =C-c= (hold control and press the letter =c=), a panel will appear at the bottom of the frame displaying all of the bindings under that prefix and which command they run.  This is very useful for learning the possible key bindings in the mode of your current buffer.

#+begin_src emacs-lisp
  ;;; --------------------------------------------------------------------------

  (use-package which-key
    :diminish which-key-mode
    :custom (which-key-idle-delay 1)
    :config
    (which-key-mode)
    (which-key-setup-side-window-right))

#+end_src

** Multiple-cursors
Multiple cursors for Emacs. This is some pretty crazy functionality, so yes, there are kinks. Don't be afraid though.

#+begin_src emacs-lisp
  ;;; --------------------------------------------------------------------------

  (use-package multiple-cursors
    :bind (("C-S-c C-S-c" . mc/edit-lines)
          ("C->" . mc/mark-next-like-this)
          ("C-<" . mc/mark-previous-like-this)
          ("C-c C-<" . mc/mark-all-like-this)))

#+end_src

** Anzu

anzu.el is an Emacs port of anzu.vim. anzu.el provides a minor mode which displays current match and total matches information in the mode-line in various search modes.

#+begin_src emacs-lisp
  ;;; --------------------------------------------------------------------------

  (use-package anzu
    :custom
    (anzu-mode-lighter "")
    (anzu-deactivate-region t)
    (anzu-search-threshold 1000)
    (anzu-replace-threshold 50)
    (anzu-replace-to-string-separator " => ")
    :config
    (global-anzu-mode +1)
    (set-face-attribute 'anzu-mode-line nil
      :foreground "yellow" :weight 'bold)
    (define-key isearch-mode-map
      [remap isearch-query-replace]  #'anzu-isearch-query-replace)
    (define-key isearch-mode-map
      [remap isearch-query-replace-regexp] #'anzu-isearch-query-replace-regexp))
  
#+end_src

** Visual Fill

We use [[https://github.com/joostkremers/visual-fill-column][visual-fill-column]] to center =org-mode= buffers for a more pleasing writing experience as it centers the contents of the buffer horizontally to seem more like you are editing a document.  This is really a matter of personal preference so you can remove the block below if you don't like the behavior.

#+begin_src emacs-lisp
  ;;; --------------------------------------------------------------------------

  (use-package visual-fill-column
    :after org)

#+end_src

** Default Text Scale

#+begin_src emacs-lisp
  ;;; --------------------------------------------------------------------------
  
  (use-package default-text-scale
    :hook (elpaca-after-init . default-text-scale-mode))

#+end_src

** Mac Specific

#+begin_src emacs-lisp
  ;;; --------------------------------------------------------------------------

  ;; Macintosh specific configurations.

  (defconst *is-a-mac* (eq system-type 'darwin))
  (when (eq system-type 'darwin)
    (setq mac-option-key-is-meta nil
      mac-command-key-is-meta t
      mac-command-modifier 'meta
      mac-option-modifier 'super))

#+end_src

** Prompt Indicator / minibuffer

#+begin_src emacs-lisp :tangle no
  ;;; --------------------------------------------------------------------------

  ;; Prompt indicator/Minibuffer

  (use-package emacs
    :init
    ;; Add prompt indicator to `completing-read-multiple'.
    ;; We display [CRM<separator>], e.g., [CRM,] if the separator is a comma.
    (defun crm-indicator (args)
      (cons (format "[CRM%s] %s"
            (replace-regexp-in-string
              "\\`\\[.*?]\\*\\|\\[.*?]\\*\\'" ""
              crm-separator)
            (car args))
        (cdr args)))
    (advice-add #'completing-read-multiple :filter-args #'crm-indicator)

    ;; Do not allow the cursor in the minibuffer prompt
    (setq minibuffer-prompt-properties
      '(read-only t cursor-intangible t face minibuffer-prompt))
    (add-hook 'minibuffer-setup-hook #'cursor-intangible-mode)

    ;; Enable recursive minibuffers
    (setq enable-recursive-minibuffers t))

#+end_src

** Global key-binding
#+begin_src emacs-lisp
  ;;; --------------------------------------------------------------------------

  (bind-key "C-c ]" 'indent-region prog-mode-map)
  (bind-key "C-c }" 'indent-region prog-mode-map)
  (bind-key "C-x C-j" 'dired-jump)

  (use-package evil-nerd-commenter
    :bind ("M-/" . evilnc-comment-or-uncomment-lines))

  ;;
  ;; A little better than just the typical "C-x o"
  ;; windmove is a built-in Emacs package.
  ;;
  (global-set-key (kbd "C-c <left>")  'windmove-left)
  (global-set-key (kbd "C-c <right>") 'windmove-right)
  (global-set-key (kbd "C-c <up>")    'windmove-up)
  (global-set-key (kbd "C-c <down>")  'windmove-down)

  ;;
  ;; Ctl-mouse to adjust/scale fonts will be disabled.
  ;; I personally like this since it was all to easy to accidentally
  ;; change the size of the font.
  ;;
  (global-unset-key (kbd "C-<mouse-4>"))
  (global-unset-key (kbd "C-<mouse-5>"))
  (global-unset-key (kbd "C-<wheel-down>"))
  (global-unset-key (kbd "C-<wheel-up>"))

#+end_src

** Eldoc

This package displays ElDoc documentations in a childframe. The childframe is selectable and scrollable with mouse, even though the cursor is hidden.

#+begin_src emacs-lisp
    ;;; --------------------------------------------------------------------------

  ;; prevent (emacs) eldoc loaded before Elpaca activation warning.
  ;; (Warning only displayed during first Elpaca installation)

  (elpaca-process-queues)
  (use-package eldoc
    :defer t
    :config
    (add-hook 'emacs-lisp-mode-hook 'eldoc-mode)
    (add-hook 'lisp-interaction-mode-hook 'eldoc-mode)
    (add-hook 'ielm-mode-hook 'eldoc-mode)
    ;; Eldoc will try to load/unload a theme which can cause issues with our
    ;; theme loading mechanism. Our theme could fail to load because of this.
    ;; So, to get our themes loading properly, load it here if not already
    ;; loaded.
    (unless theme-did-load
      (mrf/load-theme-from-selector)))

  (use-package eldoc-box
    :after eldoc
    :diminish DocBox
    :config
    (global-eldoc-mode t))

#+end_src

** Automatic Package Updates

The auto-package-update package helps us keep our Emacs packages up to date!  It will prompt you after a certain number of days either at startup or at a specific time of day to remind you to update your packages.

You can also use =M-x auto-package-update-now= to update right now!

#+begin_src emacs-lisp
  ;;; --------------------------------------------------------------------------
  ;;; Automatic Package Updates

  (use-package auto-package-update
    ;; :ensure (:fetcher github :repo "rranelli/auto-package-update.el")
    :defer t
    :custom
    (auto-package-update-interval 7)
    (auto-package-update-prompt-before-update t)
    (auto-package-update-hide-results t)
    :config
    (auto-package-update-maybe)
    (auto-package-update-at-time "09:00"))

#+end_src

** YASnippet

These are useful snippets of code that are commonly used in various languages. You can even create your own.

#+begin_src emacs-lisp
  ;;; --------------------------------------------------------------------------
  ;; YASnippets

  (use-package yasnippet
    :bind (:map yas-minor-mode-map
          ("<C-'>" . yas-expand))
    :config
    (setq yas-global-mode t)
    (setq yas-minor-mode t)
    (define-key yas-minor-mode-map (kbd "<tab>") nil)
    (add-to-list #'yas-snippet-dirs (expand-file-name "Snippets" custom-docs-dir))
    (yas-reload-all)
    (add-hook 'prog-mode-hook 'yas-minor-mode)
    (add-hook 'text-mode-hook 'yas-minor-mode)
    (setq yas-prompt-functions '(yas-ido-prompt))
    (defun help/yas-after-exit-snippet-hook-fn ()
      (prettify-symbols-mode))
    (add-hook 'yas-after-exit-snippet-hook #'help/yas-after-exit-snippet-hook-fn))

#+end_src

**** Yasnippet Snippets

Collections of more yasnippet snippets for various languages.

#+begin_src emacs-lisp
  ;;; --------------------------------------------------------------------------

  (use-package yasnippet-snippets
    :after yasnippet)

#+end_src

** All-the-icons

This package is a utility for using and formatting various Icon fonts within
Emacs.  Icon Fonts allow you to propertize and format icons the same way you
would normal text.  This enables things such as better scaling of and anti
aliasing of the icons.

#+begin_src emacs-lisp
  ;;; --------------------------------------------------------------------------

  (use-package all-the-icons
    :when (display-graphic-p))

#+end_src

** Auto-complete
Auto-Complete is an intelligent auto-completion extension for Emacs. It extends the standard Emacs completion interface and provides an environment that allows users to concentrate more on their own work.

Features:

- Visual interface
- Reduce overhead of completion by using statistic method
- Extensibility

#+begin_src emacs-lisp :tangle no
  ;;; --------------------------------------------------------------------------
  ;; Auto Complete

  (use-package auto-complete)

  (defvar ac-directory (unless (file-exists-p "auto-complete")
                       (make-directory "auto-complete")))
  (add-to-list 'load-path ac-directory)

  (global-auto-complete-mode 1)
  (setq-default ac-sources '(ac-source-pycomplete
                            ac-source-yasnippet
                            ac-source-abbrev
                            ac-source-dictionary
                            ac-source-words-in-same-mode-buffers))

  (ac-set-trigger-key "TAB")
  (ac-set-trigger-key "<tab>")


  ;; from http://blog.deadpansincerity.com/2011/05/setting-up-emacs-as-a-javascript-editing-environment-for-fun-and-profit/
  ;; Start auto-completion after 2 characters of a word
  (setq ac-auto-start 2)
  ;; case sensitivity is important when finding matches
  (setq ac-ignore-case nil)

#+end_src

** Ace Window
[[https://github.com/abo-abo/ace-window][ace-window]] is a package for selecting a window to switch to. Like =other-window= but better!

#+begin_src emacs-lisp
  ;;; --------------------------------------------------------------------------

  (use-package ace-window
    ;;:ensure (:repo "abo-abo/ace-window" :fetcher github)
    :bind ("M-o" . ace-window))

#+end_src

