init.el

(use-package which-key
  :diminish which-key-mode
  :custom (which-key-idle-delay 1)
  :config
  (which-key-mode)
  (which-key-setup-side-window-right))

;;; --------------------------------------------------------------------------

(use-package multiple-cursors
  :bind (("C-S-c C-S-c" . mc/edit-lines)
        ("C->" . mc/mark-next-like-this)
        ("C-<" . mc/mark-previous-like-this)
        ("C-c C-<" . mc/mark-all-like-this)))

;;; --------------------------------------------------------------------------

(use-package anzu
  :custom
  (anzu-mode-lighter "")
  (anzu-deactivate-region t)
  (anzu-search-threshold 1000)
  (anzu-replace-threshold 50)
  (anzu-replace-to-string-separator " => ")
  :config
  (global-anzu-mode +1)
  (set-face-attribute 'anzu-mode-line nil
    :foreground "yellow" :weight 'bold)
  (define-key isearch-mode-map
    [remap isearch-query-replace]  #'anzu-isearch-query-replace)
  (define-key isearch-mode-map
    [remap isearch-query-replace-regexp] #'anzu-isearch-query-replace-regexp))

;;; --------------------------------------------------------------------------

(use-package visual-fill-column
  :after org)

;;; --------------------------------------------------------------------------

(use-package default-text-scale
  :hook (elpaca-after-init . default-text-scale-mode))

;;; --------------------------------------------------------------------------

;; Macintosh specific configurations.

(defconst *is-a-mac* (eq system-type 'darwin))
(when (eq system-type 'darwin)
  (setq mac-option-key-is-meta nil
    mac-command-key-is-meta t
    mac-command-modifier 'meta
    mac-option-modifier 'super))

;;; --------------------------------------------------------------------------

(bind-key "C-c ]" 'indent-region prog-mode-map)
(bind-key "C-c }" 'indent-region prog-mode-map)
(bind-key "C-x C-j" 'dired-jump)

(use-package evil-nerd-commenter
  :bind ("M-/" . evilnc-comment-or-uncomment-lines))

;;
;; A little better than just the typical "C-x o"
;; windmove is a built-in Emacs package.
;;
(global-set-key (kbd "C-c <left>")  'windmove-left)
(global-set-key (kbd "C-c <right>") 'windmove-right)
(global-set-key (kbd "C-c <up>")    'windmove-up)
(global-set-key (kbd "C-c <down>")  'windmove-down)

;;
;; Ctl-mouse to adjust/scale fonts will be disabled.
;; I personally like this since it was all to easy to accidentally
;; change the size of the font.
;;
(global-unset-key (kbd "C-<mouse-4>"))
(global-unset-key (kbd "C-<mouse-5>"))
(global-unset-key (kbd "C-<wheel-down>"))
(global-unset-key (kbd "C-<wheel-up>"))

;;; --------------------------------------------------------------------------

;; prevent (emacs) eldoc loaded before Elpaca activation warning.
;; (Warning only displayed during first Elpaca installation)

(elpaca-process-queues)
(use-package eldoc
  :defer t
  :config
  (add-hook 'emacs-lisp-mode-hook 'eldoc-mode)
  (add-hook 'lisp-interaction-mode-hook 'eldoc-mode)
  (add-hook 'ielm-mode-hook 'eldoc-mode)
  ;; Eldoc will try to load/unload a theme which can cause issues with our
  ;; theme loading mechanism. Our theme could fail to load because of this.
  ;; So, to get our themes loading properly, load it here if not already
  ;; loaded.
  (unless theme-did-load
    (mrf/load-theme-from-selector)))

(use-package eldoc-box
  :after eldoc
  :diminish DocBox
  :config
  (global-eldoc-mode t))

;;; --------------------------------------------------------------------------
;;; Automatic Package Updates

(use-package auto-package-update
  ;; :ensure (:fetcher github :repo "rranelli/auto-package-update.el")
  :defer t
  :custom
  (auto-package-update-interval 7)
  (auto-package-update-prompt-before-update t)
  (auto-package-update-hide-results t)
  :config
  (auto-package-update-maybe)
  (auto-package-update-at-time "09:00"))

;;; --------------------------------------------------------------------------
;; YASnippets

(use-package yasnippet
  :bind (:map yas-minor-mode-map
        ("<C-'>" . yas-expand))
  :config
  (setq yas-global-mode t)
  (setq yas-minor-mode t)
  (define-key yas-minor-mode-map (kbd "<tab>") nil)
  (add-to-list #'yas-snippet-dirs (expand-file-name "Snippets" custom-docs-dir))
  (yas-reload-all)
  (add-hook 'prog-mode-hook 'yas-minor-mode)
  (add-hook 'text-mode-hook 'yas-minor-mode)
  (setq yas-prompt-functions '(yas-ido-prompt))
  (defun help/yas-after-exit-snippet-hook-fn ()
    (prettify-symbols-mode))
  (add-hook 'yas-after-exit-snippet-hook #'help/yas-after-exit-snippet-hook-fn))

;;; --------------------------------------------------------------------------

(use-package yasnippet-snippets
  :after yasnippet)

;;; --------------------------------------------------------------------------

(use-package all-the-icons
  :when (display-graphic-p))

;;; --------------------------------------------------------------------------

(use-package ace-window
  ;;:ensure (:repo "abo-abo/ace-window" :fetcher github)
  :bind ("M-o" . ace-window))

;;; --------------------------------------------------------------------------
;;; Window Number
