emacs-config.org
** Winum
Window numbers for Emacs: Navigate your windows and frames using numbers. This is not only handy but used by Treemacs.
#+begin_src emacs-lisp
  ;;; --------------------------------------------------------------------------
  ;;; Window Number

  (use-package winum
    ;;:ensure (:host github :repo "deb0ch/emacs-winum")
    :config (winum-mode))

#+end_src

** Jinx

Jinx is a fast just-in-time spell-checker for Emacs. Jinx highlights misspelled words in the text of the visible portion of the buffer. For efficiency, Jinx highlights misspellings lazily, recognizes window boundaries and text folding, if any. For example, when unfolding or scrolling, only the newly visible part of the text is checked if it has not been checked before. Each misspelling can be corrected from a list of dictionary words presented as a completion mnu.

*Important*
Jinx requires the library ~libenchant~ or ~enchant~ installed. This can be done via the [[https://github.com/AbiWord/enchant][enchant github]] site, through ~brew~ on macOS or the package management system of the OS.

#+begin_src emacs-lisp

  (use-package jinx
    :ensure (:host github :repo "minad/jinx")
    ;;:hook (emacs-startup . global-jinx-mode)
    :bind (("C-c C-$" . jinx-correct)
           ("C-x C-$" . jinx-languages))
    :config
    (dolist (hook '(text-mode-hook prog-mode-hook org-mode-hook))
      (add-hook hook #'jinx-mode)))


#+end_src

** Local packages

These are packages located in the ~"lisp"~ directory within the emacs-config-directory.

#+begin_src emacs-lisp

#+end_src


* Undo Systems

*These packages are selected via the =M-x customize= function.*

** Vundo (visual undo)

Vundo displays the undo history as a tree and lets you move in the tree to go back to previous buffer states. To use vundo, type M-x vundo RET in the buffer you want to undo. An undo tree buffer should pop up.

#+begin_src emacs-lisp
  ;;; --------------------------------------------------------------------------

  (use-package vundo
    ;;:ensure ( :host github :repo "casouri/vundo")
    :when (equal undo-handler 'undo-handler-vundo)
    :bind
    ("C-x u" . vundo)
    ("C-x r u" . vundo)
    :config
    (set-face-attribute 'vundo-default nil :family "Symbola")
    (setq vundo-glyph-alist vundo-unicode-symbols))

#+end_src

** Undo Tree

Instead of treating undo/redo as a linear sequence of changes, undo-tree-mode treats undo history as a branching tree of changes, similar to the way Vim handles it. This makes it substantially easier to undo and redo any change, while preserving the entire history of past states. The undo-tree visualizer is particularly helpful in complex cases. An added side bonus is that undo history can in some cases be stored more efficiently, allowing more changes to accumulate before Emacs starts discarding history. Undo history can be saved persistently across sessions with Emacs 24.3 and later. It also sports various other nifty features: storing and restoring past buffer states in registers, a diff view of the changes that will be made by undoing, and probably more besides.

#+begin_src emacs-lisp
  ;;; --------------------------------------------------------------------------

  (defun mrf/undo-tree-hook ()
    (set-frame-width (selected-frame) 20))

  (defun undo-tree-split-side-by-side (original-function &rest args)
    "Split undo-tree side-by-side"
    (let ((split-height-threshold nil)
         (split-width-threshold 0))
      (apply original-function args)))
  
#+end_src

#+begin_src emacs-lisp
  ;;; --------------------------------------------------------------------------

  ;;
  ;; Sometimes, when behind a firewall, the undo-tree package triggers elpaca
  ;; to queue up the Queue package which then hangs and fails. This happens
  ;; even if the :unless option is specified in the use-package (only :disabled
  ;; seems to work which isn't what I want). So, we prevent the loading of the
  ;; page altogether.
  ;;
  (when (equal undo-handler 'undo-handler-undo-tree)
    (use-package undo-tree
      :init
      (setq undo-tree-visualizer-timestamps nil
        undo-tree-visualizer-diff t
        undo-tree-enable-undo-in-region t
        ;; 10X bump of the undo limits to avoid issues with premature
        ;; Emacs GC which truncages the undo history very aggresively
        undo-limit 800000
        undo-strong-limit 12000000
        undo-outer-limit 120000000)
      :diminish untree
      :config
      (global-undo-tree-mode)
      (advice-add 'undo-tree-visualize :around #'undo-tree-split-side-by-side)
      (bind-keys :map undo-tree-visualizer-mode-map
        ("RET" . undo-tree-visualizer-quit)
        ("C-g" . undo-tree-visualizer-abort))
      (setq undo-tree-auto-save-history nil)))

#+end_src



* Theme List and Selection

This bit of code contains a list of themes that I like personally and then allows them to be switched between themselves. The index of ~theme-selector~ is what is set in order to access a theme via the ~mrf/load-theme-from-selector()~ function.

#+begin_src emacs-lisp
  ;;; --------------------------------------------------------------------------

  ;;
  ;; 1. The function `mrf/load-theme-from-selector' is called from the
  ;;    "C-= =" Keybinding (just search for it).
  ;;
  ;; 2. Once the new theme is loaded via the `theme-selector', the previous
  ;;    theme is unloaded (or disabled) the function(s) defined in the
  ;;    `disable-theme-functions' hook are called (defined in the load-theme.el
  ;;    package).
  ;;
  ;; 3. The function `mrf/cycle-theme-selector' is called by the hook. This
  ;;    function increments the theme-selector by 1, cycling the value to 0
  ;;    if beyond the `theme-list' bounds.
  ;;
  (setq-default loaded-theme (nth theme-selector theme-list))
  (add-to-list 'savehist-additional-variables 'loaded-theme)
  (add-to-list 'savehist-additional-variables 'custom-default-font-size)
  (add-to-list 'savehist-additional-variables 'theme-selector)
  (add-to-list 'savehist-additional-variables 'custom-default-mono-font-size)

#+end_src

** Cycle Theme Function

This is the main function that allows cycling (up or down) through the list of themes defined in the ~theme-list~.  This function is normally called by the ~disable-theme-functions~ hook. Before calling this function, set the variable ~theme-cycle-step~ to either a 1 or -1 depending upon which direction in the ~theme-list~ array to select the next element from. The resulting index will cycle to the end or the beginning of the list if the computed index goes beyond element 0 or the length of ~theme-list~. The parameter theme is passed to this function when a theme becomes disabled (via the ~disable-theme~ function) and represents the theme that has become disabled.

#+begin_src emacs-lisp
  ;;; --------------------------------------------------------------------------

  (defun mrf/cycle-theme-selector (&rest theme)
    "Cycle the `theme-selector' by 1, resetting to 0 if beyond array bounds."
    (interactive)
    (when (not (eq theme-cycle-step nil))
      (let ((step theme-cycle-step) (result 0))
        (when step
        (setq result (+ step theme-selector))
        (when (< result 0)
          (setq result (- (length theme-list) 1)))
        (when (> result (- (length theme-list) 1))
          (setq result 0)))
        (setq-default theme-selector result))))

  ;; This is used to trigger the cycling of the theme-selector
  ;; It is called when a theme is disabled. The theme is disabled from the
  ;; `mrf/load-theme-from-selector' function.
  (add-hook 'disable-theme-functions #'mrf/cycle-theme-selector)

#+end_src

** Load Theme Function

This function simply loads the theme from the theme-list indexed by the ~theme-selector~ variable. Note the advice for ~load-theme~ that deactivates the current theme before activating the new theme. This is done to reset all the colors, a clean slate, before the new theme is activated.

#+begin_src emacs-lisp
  ;;; --------------------------------------------------------------------------

  (defvar theme-did-load nil
    "Set to true if the last Theme was loaded.")

  (defun mrf/load-theme-from-selector (&optional step)
    "Load the theme in `theme-list' indexed by `theme-selector'."
    (interactive)
    (setq theme-cycle-step nil)
    (cond
      ((or (eq step nil) (eq step 0)) (setq theme-cycle-step 0))
      ((> step 0) (setq theme-cycle-step 1))
      ((< step 0) (setq theme-cycle-step -1)))
    (when loaded-theme
      (disable-theme (intern loaded-theme)))
    (setq loaded-theme (nth theme-selector theme-list))
    (setq theme-did-load (load-theme (intern loaded-theme) t))
    (when (featurep 'org)
      (mrf/org-font-setup))
    (set-face-foreground 'line-number "SkyBlue4"))

#+end_src

** Theme selection helper functions.

#+begin_src emacs-lisp

  (defun mrf/print-custom-theme-name ()
    "Print the current loaded theme from the `theme-list' on the modeline."
    (interactive)
    (message (format "Custom theme is %S" loaded-theme)))

  ;; Quick Helper Functions
  (defun next-theme ()
    "Go to the next theme in the list."
    (interactive)
    (mrf/load-theme-from-selector 1))

  (defun previous-theme ()
    "Go to the next theme in the list."
    (interactive)
    (mrf/load-theme-from-selector -1))

  (defun which-theme ()
    "Go to the next theme in the list."
    (interactive)
    (mrf/print-custom-theme-name))

  ;; Go to NEXT theme
  (global-set-key (kbd "C-c C-=") 'next-theme)
  ;; Go to PREVIOUS theme
  (global-set-key (kbd "C-c C--") 'previous-theme)
  ;; Print current theme
  (global-set-key (kbd "C-c C-?") 'which-theme)
#+end_src

