init.el

(use-package winum
  ;;:ensure (:host github :repo "deb0ch/emacs-winum")
  :config (winum-mode))



;;; --------------------------------------------------------------------------

(use-package vundo
  ;;:ensure ( :host github :repo "casouri/vundo")
  :when (equal undo-handler 'undo-handler-vundo)
  :bind
  ("C-x u" . vundo)
  ("C-x r u" . vundo)
  :config
  (set-face-attribute 'vundo-default nil :family "Symbola")
  (setq vundo-glyph-alist vundo-unicode-symbols))

;;; --------------------------------------------------------------------------

(defun mrf/undo-tree-hook ()
  (set-frame-width (selected-frame) 20))

(defun undo-tree-split-side-by-side (original-function &rest args)
  "Split undo-tree side-by-side"
  (let ((split-height-threshold nil)
       (split-width-threshold 0))
    (apply original-function args)))

;;; --------------------------------------------------------------------------

;;
;; Sometimes, when behind a firewall, the undo-tree package triggers elpaca
;; to queue up the Queue package which then hangs and fails. This happens
;; even if the :unless option is specified in the use-package (only :disabled
;; seems to work which isn't what I want). So, we prevent the loading of the
;; page altogether.
;;
(when (equal undo-handler 'undo-handler-undo-tree)
  (use-package undo-tree
    :init
    (setq undo-tree-visualizer-timestamps nil
      undo-tree-visualizer-diff t
      undo-tree-enable-undo-in-region t
      ;; 10X bump of the undo limits to avoid issues with premature
      ;; Emacs GC which truncages the undo history very aggresively
      undo-limit 800000
      undo-strong-limit 12000000
      undo-outer-limit 120000000)
    :diminish untree
    :config
    (global-undo-tree-mode)
    (advice-add 'undo-tree-visualize :around #'undo-tree-split-side-by-side)
    (bind-keys :map undo-tree-visualizer-mode-map
      ("RET" . undo-tree-visualizer-quit)
      ("C-g" . undo-tree-visualizer-abort))
    (setq undo-tree-auto-save-history nil)))

;;; --------------------------------------------------------------------------

;;
;; 1. The function `mrf/load-theme-from-selector' is called from the
;;    "C-= =" Keybinding (just search for it).
;;
;; 2. Once the new theme is loaded via the `theme-selector', the previous
;;    theme is unloaded (or disabled) the function(s) defined in the
;;    `disable-theme-functions' hook are called (defined in the load-theme.el
;;    package).
;;
;; 3. The function `mrf/cycle-theme-selector' is called by the hook. This
;;    function increments the theme-selector by 1, cycling the value to 0
;;    if beyond the `theme-list' bounds.
;;
(setq-default loaded-theme (nth theme-selector theme-list))
(add-to-list 'savehist-additional-variables 'loaded-theme)
(add-to-list 'savehist-additional-variables 'custom-default-font-size)
(add-to-list 'savehist-additional-variables 'theme-selector)
(add-to-list 'savehist-additional-variables 'custom-default-mono-font-size)

;;; --------------------------------------------------------------------------

(defun mrf/cycle-theme-selector (&rest theme)
  "Cycle the `theme-selector' by 1, resetting to 0 if beyond array bounds."
  (interactive)
  (when (not (eq theme-cycle-step nil))
    (let ((step theme-cycle-step) (result 0))
      (when step
      (setq result (+ step theme-selector))
      (when (< result 0)
        (setq result (- (length theme-list) 1)))
      (when (> result (- (length theme-list) 1))
        (setq result 0)))
      (setq-default theme-selector result))))

;; This is used to trigger the cycling of the theme-selector
;; It is called when a theme is disabled. The theme is disabled from the
;; `mrf/load-theme-from-selector' function.
(add-hook 'disable-theme-functions #'mrf/cycle-theme-selector)

;;; --------------------------------------------------------------------------

(defvar theme-did-load nil
  "Set to true if the last Theme was loaded.")

(defun mrf/load-theme-from-selector (&optional step)
  "Load the theme in `theme-list' indexed by `theme-selector'."
  (interactive)
  (setq theme-cycle-step nil)
  (cond
    ((or (eq step nil) (eq step 0)) (setq theme-cycle-step 0))
    ((> step 0) (setq theme-cycle-step 1))
    ((< step 0) (setq theme-cycle-step -1)))
  (when loaded-theme
    (disable-theme (intern loaded-theme)))
  (setq loaded-theme (nth theme-selector theme-list))
  (setq theme-did-load (load-theme (intern loaded-theme) t))
  (when (featurep 'org)
    (mrf/org-font-setup))
  (set-face-foreground 'line-number "SkyBlue4"))

(defun mrf/print-custom-theme-name ()
  "Print the current loaded theme from the `theme-list' on the modeline."
  (interactive)
  (message (format "Custom theme is %S" loaded-theme)))

;; Quick Helper Functions
(defun next-theme ()
  "Go to the next theme in the list."
  (interactive)
  (mrf/load-theme-from-selector 1))

(defun previous-theme ()
  "Go to the next theme in the list."
  (interactive)
  (mrf/load-theme-from-selector -1))

(defun which-theme ()
  "Go to the next theme in the list."
  (interactive)
  (mrf/print-custom-theme-name))

;; Go to NEXT theme
(global-set-key (kbd "C-c C-=") 'next-theme)
;; Go to PREVIOUS theme
(global-set-key (kbd "C-c C--") 'previous-theme)
;; Print current theme
(global-set-key (kbd "C-c C-?") 'which-theme)

;;; --------------------------------------------------------------------------
