emacs-config.org
** Theme Override Values

#+begin_src emacs-lisp
  ;;; --------------------------------------------------------------------------

  (defun mrf/org-theme-override-values ()
    (defface org-block-begin-line
      '((t (:underline "#1D2C39" :foreground "SlateGray" :background "#1D2C39")))
      "Face used for the line delimiting the begin of source blocks.")

    (defface org-block
      '((t (:background "#242635" :extend t :font "Fira Code Retina")))
      "Face used for the source block background.")

    (defface org-block-end-line
      '((t (:overline "#1D2C39" :foreground "SlateGray" :background "#1D2C39")))
      "Face used for the line delimiting the end of source blocks.")

    (defface org-modern-horizontal-rule
      '((t (:strike-through "green" :weight bold)))
      "Face used for the Horizontal like (-----)"))

  ;;; --------------------------------------------------------------------------

  (defun mrf/customize-modus-theme ()
    (when (featurep 'org)
      (mrf/org-font-setup))
    (setq modus-themes-common-palette-overrides
      '((bg-mode-line-active bg-blue-intense)
         (fg-mode-line-active fg-main)
         (border-mode-line-active blue-intense))))

  (add-hook 'elpaca-after-init-hook 'mrf/customize-modus-theme)

  (defun mrf/customize-ef-theme ()
    (defface ef-themes-fixed-pitch
      '((t (:background "#242635" :extend t :font "Courier New")))
      "Face used for the source block background.")
    (when (featurep 'org)
      (mrf/org-font-setup))
    (setq ef-themes-common-palette-override
      '( (bg-mode-line bg-blue-intense)
         (fg-mode-line fg-main)
         (border-mode-line-active blue-intense))))
  ;;(add-hook 'org-load-hook 'mrf/customize-ef-theme)
  (add-hook 'elpaca-after-init-hook 'mrf/customize-ef-theme)

#+end_src

** Color Theming

<<<Color Theming>>> as a curated list of theming packages.
*Note:* If new themes are added in the ~theme-list~ custom variable then they must be included here along with any customizations.

#+begin_src emacs-lisp
  ;;; --------------------------------------------------------------------------

  (add-to-list 'custom-theme-load-path (expand-file-name "Themes" custom-docs-dir))

  (mrf/org-theme-override-values)
  (use-package tron-legacy-theme :defer t)
  (use-package ef-themes :init (mrf/customize-ef-theme) :defer t)
  (use-package modus-themes :init (mrf/customize-modus-theme) :defer t)
  (use-package material-theme :defer t)
  (use-package color-theme-modern :defer t)
  (use-package color-theme-sanityinc-tomorrow :defer t)
  ;; Can't defer darktooth since we need the base theme to always load
  (use-package darktooth-theme :ensure t)
  (use-package zenburn-theme :defer t)

#+end_src

** Selected theme
This includes the theme to use in both graphical and non-graphical.

#+begin_src emacs-lisp
  ;;; --------------------------------------------------------------------------
  ;; (add-hook 'emacs-startup-hook #'(mrf/load-theme-from-selector))
  ;; (mrf/load-theme-from-selector)
  ;; For terminal mode we choose Material theme

  (defun mrf/load-terminal-theme ()
    (load-theme (intern default-terminal-theme) t))

  (if (not (display-graphic-p))
    (add-hook 'elpaca-after-init-hook 'mrf/load-terminal-theme)
    ;;else
    (progn
      (if (not elpaca-after-init-time)
        (add-hook 'elpaca-after-init-hook
        (lambda ()
          (unless theme-did-load
            (mrf/load-theme-from-selector))))
        ;; else
        (add-hook 'window-setup-hook
        (lambda ()
          (unless theme-did-load
            (mrf/load-theme-from-selector))))
        )))

#+end_src


* Frame and Font Setup

It's nice to know that Emacs is somewhat working. To help this along, we set the Frame (window size fonts) early in the loading process.

** Define the various font size constants

#+begin_src emacs-lisp
  ;;; --------------------------------------------------------------------------

  ;; Frame (view) setup including fonts.
  ;; You will most likely need to adjust this font size for your system!

  (setq-default mrf/small-font-size 150)
  (setq-default mrf/small-mono-font-size 150)
  (setq-default mrf/small-variable-font-size 170)

  (setq-default mrf/medium-font-size 170)
  (setq-default mrf/medium-mono-font-size 170)
  (setq-default mrf/medium-variable-font-size 190)

  (setq-default mrf/large-font-size 190)
  (setq-default mrf/large-mono-font-size 190)
  (setq-default mrf/large-variable-font-size 210)

  (setq-default mrf/x-large-font-size 220)
  (setq-default mrf/x-large-mono-font-size 220)
  (setq-default mrf/x-large-variable-font-size 240)

  ;; (setq-default custom-default-font-size mrf/medium-font-size)
  (setq-default mrf/default-variable-font-size (+ custom-default-font-size 20))
  ;; (setq-default mrf/set-frame-maximized t)  ;; or f

  ;; Make frame transparency overridable
  ;; (setq-default mrf/frame-transparency '(90 . 90))

  (setq frame-resize-pixelwise t)

#+end_src

** Functions to set the frame size
#+begin_src emacs-lisp
  ;;; --------------------------------------------------------------------------

  ;; Functions to set the frame size

  (defun mrf/frame-recenter (&optional frame)
    "Center FRAME on the screen.  FRAME can be a frame name, a terminal name,
    or a frame.  If FRAME is omitted or nil, use currently selected frame."
    (interactive)
    ;; (set-frame-size (selected-frame) 250 120)
    (unless (eq 'maximised (frame-parameter nil 'fullscreen))
      (progn
        (let ((width (nth 3 (assq 'geometry (car (display-monitor-attributes-list)))))
               (height (nth 4 (assq 'geometry (car (display-monitor-attributes-list))))))
          (cond (( > width 3000) (mrf/update-large-display))
            (( > width 2000) (mrf/update-built-in-display))
            (t (mrf/set-frame-alpha-maximized)))
          ))
      ))

  (defun mrf/update-large-display ()
    (modify-frame-parameters
      frame '((user-position . t)
               (top . 0.0)
               (left . 0.70)
               (width . (text-pixels . 2800))
               (height . (text-pixels . 1650))) ;; 1800
      ))

  (defun mrf/update-built-in-display ()
    (modify-frame-parameters
      frame '((user-position . t)
               (top . 0.0)
               (left . 0.90)
               (width . (text-pixels . 1800))
               (height . (text-pixels . 1170)));; 1329
      ))


  ;; Set frame transparency
  (defun mrf/set-frame-alpha-maximized ()
    "Function to set the alpha and also maximize the frame."
    ;; (set-frame-parameter (selected-frame) 'alpha mrf/frame-transparency)
    (set-frame-parameter (selected-frame) 'fullscreen 'maximized)
    (add-to-list 'default-frame-alist '(fullscreen . maximized)))

  ;; default window width and height
  (defun mrf/custom-set-frame-size ()
    "Simple function to set the default frame width/height."
    ;; (set-frame-parameter (selected-frame) 'alpha mrf/frame-transparency)
    (setq swidth (nth 3 (assq 'geometry (car (display-monitor-attributes-list)))))
    (setq sheight (nth 4 (assq 'geometry (car (display-monitor-attributes-list)))))

    (add-to-list 'default-frame-alist '(fullscreen . maximized))
    (unless enable-frameset-restore (mrf/frame-recenter))
    )

#+end_src

** Default fonts and sizes

#+begin_src emacs-lisp
  ;;; --------------------------------------------------------------------------

  ;; Default fonts

  (defun mrf/update-face-attribute ()
    "Set the font faces."
    ;; ====================================
    (set-face-attribute 'default nil
      :family default-font-family
      :height custom-default-font-size
      :weight 'medium)

    ;; Set the fixed pitch face
    (set-face-attribute 'fixed-pitch nil
      :family mono-spaced-font-family
      :height custom-default-mono-font-size
      :weight 'medium)

    ;; Set the variable pitch face
    (set-face-attribute 'variable-pitch nil
      :family variable-pitch-font-family
      :height (+ custom-default-font-size 20)
      :weight 'medium))

  ;; This is done so that the Emacs window is sized early in the init phase along with the default font size.
  ;; Startup works without this but it's nice to see the window expand early...
  (add-hook 'emacs-startup-hook
    (lambda ()
      (when (display-graphic-p)
        (mrf/update-face-attribute)
        (unless (daemonp)
  	(if enable-frameset-restore
            (mrf/restore-desktop-frameset)
  	  (mrf/frame-recenter)))
        )))

#+end_src

