emacs-config.org
** Track Slected Front Size

The functions in the list =after-setting-font-hook= are called whenever the frame's font changes. In order to save this value, we capture it and store it in the =custom-default-font-size= custom variable. This variable is saved whenver Emacs exists. Then, when Emacs is started again, the default and fixed-pitch font height values are set to =custom-default-font-size=. The variable pitch font is computed as ~(+ custom-default-font-size 20)~

#+begin_src emacs-lisp
  ;;; --------------------------------------------------------------------------

  (defun mrf/default-font-height-change ()
    (setq-default custom-default-font-size (face-attribute 'default :height))
    (mrf/update-face-attribute)
    (unless enable-frameset-restore (mrf/frame-recenter)))

  (add-hook 'after-setting-font-hook 'mrf/default-font-height-change)

#+end_src

** Helper to up the font size for a higher-res monitor.
*** Frame font selection
This little function toggles between a larger font size and the default font size.

#+begin_src emacs-lisp
  ;;; --------------------------------------------------------------------------
  ;; Frame font selection

  (defvar mrf/font-size-slot 1)

  (defun mrf/update-font-size ()
    (cond
      ((equal mrf/font-size-slot 3)
        (setq custom-default-font-size mrf/x-large-font-size
              custom-default-mono-font-size mrf/x-large-mono-font-size
              mrf/default-variable-font-size (+ custom-default-font-size 20)
              mrf/font-size-slot 2)
        (mrf/update-face-attribute))
      ((equal mrf/font-size-slot 2)
        (setq custom-default-font-size mrf/large-font-size
              custom-default-mono-font-size mrf/large-mono-font-size
              mrf/default-variable-font-size (+ custom-default-font-size 20)
              mrf/font-size-slot 1)
        (mrf/update-face-attribute))
      ((equal mrf/font-size-slot 1)
        (setq custom-default-font-size mrf/medium-font-size
              custom-default-mono-font-size mrf/medium-mono-font-size
              mrf/default-variable-font-size (+ custom-default-font-size 20)
              mrf/font-size-slot 0)
        (mrf/update-face-attribute))
      ((equal mrf/font-size-slot 0)
        (setq custom-default-font-size mrf/small-font-size
              custom-default-mono-font-size mrf/small-mono-font-size
              mrf/default-variable-font-size (+ custom-default-font-size 20)
              mrf/font-size-slot 3)
        (mrf/update-face-attribute))))

#+end_src

**** Resolution Key Bindings
Some key kindings to switch to different screen resolutions.

#+begin_src emacs-lisp
  ;;; --------------------------------------------------------------------------
  ;; Some alternate keys below....

  (bind-keys ("C-c 1". use-small-display-font)
    ("C-c 2". use-medium-display-font)
    ("C-c 3". use-large-display-font)
    ("C-c 4". use-x-large-display-font))

  (let ((map global-map))
    (define-key map (kbd "C-S-c 1")
      (lambda () (interactive) (use-small-display-font t)))
    (define-key map (kbd "C-S-c 2")
      (lambda () (interactive) (use-medium-display-font t)))
    (define-key map (kbd "C-S-c 3")
      (lambda () (interactive) (use-large-display-font t)))
    (define-key map (kbd "C-S-c 4")
      (lambda () (interactive) (use-x-large-display-font t))))

#+end_src

**** Frame support functions
These functions are used to configure the main frame font size. Based upon a monitor's size, it may be necessary to make the font larger or smaller.

#+begin_src emacs-lisp
    ;;; --------------------------------------------------------------------------
  ;; Frame support functions

  (defun mrf/set-frame-font (slot)
    (setq mrf/font-size-slot slot)
    (mrf/update-font-size)
    (unless enable-frameset-restore (mrf/frame-recenter)))

  (defun mrf/should-recenter (&optional force-recenter)
    (if force-recenter
      (mrf/frame-recenter)
      ;;else
      (unless enable-frameset-restore (mrf/frame-recenter))))

  ;;; --------------------------------------------------------------------------

  (defun use-small-display-font (&optional force-recenter)
    (interactive)
    (mrf/set-frame-font 0)
    (mrf/should-recenter force-recenter))


  (defun use-medium-display-font (&optional force-recenter)
    (interactive)
    (mrf/set-frame-font 1)
    (mrf/should-recenter force-recenter))


  (defun use-large-display-font (&optional force-recenter)
    (interactive)
    (mrf/set-frame-font 2)
    (mrf/should-recenter force-recenter))


  (defun use-x-large-display-font (&optional force-recenter)
    (interactive)
    (mrf/set-frame-font 3)
    (mrf/should-recenter force-recenter))


  ;; This is done so that the Emacs window is sized early in the init phase along with the default font size.
  ;; Startup works without this but it's nice to see the window expand early...
  (when (display-graphic-p)
    (add-hook 'elpaca-after-init-hook
      (lambda ()
        (progn
        (mrf/update-face-attribute)
        (unless (daemonp)
          (unless enable-frameset-restore (mrf/frame-recenter))))
        )))

#+end_src

** Window, mode-line, +more padding

This package provides a global minor mode to increase the spacing/padding of Emacs windows and frames. The idea is to make editing and reading feel more comfortable.

#+begin_src emacs-lisp
  ;;; --------------------------------------------------------------------------

  (use-package spacious-padding
    :custom
    (spacious-padding-widths
      '( :internal-border-width 10
         :header-line-width 4
         :mode-line-width 6
         :tab-width 4
         :right-divider-width 10
         :scroll-bar-width 8
         :fringe-width 8))
    :config
    (spacious-padding-mode t))

  ;; Read the doc string of `spacious-padding-subtle-mode-line' as it
  ;; is very flexible and provides several examples.
  ;; (setq spacious-padding-subtle-mode-line
  ;;       `( :mode-line-active 'default
  ;;          :mode-line-inactive vertical-border))
#+end_src


* Org Mode

Org Mode is one of the hallmark features of Emacs.  It is a rich document editor, project planner, task and time tracker, blogging engine, and literate coding utility all wrapped up in one package [[https://orgmode.org/][Orgmode]].

The =mrf/org-font-setup= function configures various text faces to tweak the sizes of headings and use variable width fonts in most cases so that it looks more like we're editing a document in =org-mode=.  We switch back to fixed width (monospace) fonts for code blocks and tables so that they display correctly.

*NOTE:* Most of the code below has been taken from the [[https://systemcrafters.net][System Crafters]] site run by David Wilson. Please visit that site for lots of great stuff!

