init.el

(defun mrf/default-font-height-change ()
  (setq-default custom-default-font-size (face-attribute 'default :height))
  (mrf/update-face-attribute)
  (unless enable-frameset-restore (mrf/frame-recenter)))

(add-hook 'after-setting-font-hook 'mrf/default-font-height-change)

;;; --------------------------------------------------------------------------
;; Frame font selection

(defvar mrf/font-size-slot 1)

(defun mrf/update-font-size ()
  (cond
    ((equal mrf/font-size-slot 3)
      (setq custom-default-font-size mrf/x-large-font-size
            custom-default-mono-font-size mrf/x-large-mono-font-size
            mrf/default-variable-font-size (+ custom-default-font-size 20)
            mrf/font-size-slot 2)
      (mrf/update-face-attribute))
    ((equal mrf/font-size-slot 2)
      (setq custom-default-font-size mrf/large-font-size
            custom-default-mono-font-size mrf/large-mono-font-size
            mrf/default-variable-font-size (+ custom-default-font-size 20)
            mrf/font-size-slot 1)
      (mrf/update-face-attribute))
    ((equal mrf/font-size-slot 1)
      (setq custom-default-font-size mrf/medium-font-size
            custom-default-mono-font-size mrf/medium-mono-font-size
            mrf/default-variable-font-size (+ custom-default-font-size 20)
            mrf/font-size-slot 0)
      (mrf/update-face-attribute))
    ((equal mrf/font-size-slot 0)
      (setq custom-default-font-size mrf/small-font-size
            custom-default-mono-font-size mrf/small-mono-font-size
            mrf/default-variable-font-size (+ custom-default-font-size 20)
            mrf/font-size-slot 3)
      (mrf/update-face-attribute))))

;;; --------------------------------------------------------------------------
;; Some alternate keys below....

(bind-keys ("C-c 1". use-small-display-font)
  ("C-c 2". use-medium-display-font)
  ("C-c 3". use-large-display-font)
  ("C-c 4". use-x-large-display-font))

(let ((map global-map))
  (define-key map (kbd "C-S-c 1")
    (lambda () (interactive) (use-small-display-font t)))
  (define-key map (kbd "C-S-c 2")
    (lambda () (interactive) (use-medium-display-font t)))
  (define-key map (kbd "C-S-c 3")
    (lambda () (interactive) (use-large-display-font t)))
  (define-key map (kbd "C-S-c 4")
    (lambda () (interactive) (use-x-large-display-font t))))

;;; --------------------------------------------------------------------------
;; Frame support functions

(defun mrf/set-frame-font (slot)
  (setq mrf/font-size-slot slot)
  (mrf/update-font-size)
  (unless enable-frameset-restore (mrf/frame-recenter)))

(defun mrf/should-recenter (&optional force-recenter)
  (if force-recenter
    (mrf/frame-recenter)
    ;;else
    (unless enable-frameset-restore (mrf/frame-recenter))))

;;; --------------------------------------------------------------------------

(defun use-small-display-font (&optional force-recenter)
  (interactive)
  (mrf/set-frame-font 0)
  (mrf/should-recenter force-recenter))


(defun use-medium-display-font (&optional force-recenter)
  (interactive)
  (mrf/set-frame-font 1)
  (mrf/should-recenter force-recenter))


(defun use-large-display-font (&optional force-recenter)
  (interactive)
  (mrf/set-frame-font 2)
  (mrf/should-recenter force-recenter))


(defun use-x-large-display-font (&optional force-recenter)
  (interactive)
  (mrf/set-frame-font 3)
  (mrf/should-recenter force-recenter))


;; This is done so that the Emacs window is sized early in the init phase along with the default font size.
;; Startup works without this but it's nice to see the window expand early...
(when (display-graphic-p)
  (add-hook 'elpaca-after-init-hook
    (lambda ()
      (progn
      (mrf/update-face-attribute)
      (unless (daemonp)
        (unless enable-frameset-restore (mrf/frame-recenter))))
      )))

;;; --------------------------------------------------------------------------

(use-package spacious-padding
  :custom
  (spacious-padding-widths
    '( :internal-border-width 10
       :header-line-width 4
       :mode-line-width 6
       :tab-width 4
       :right-divider-width 10
       :scroll-bar-width 8
       :fringe-width 8))
  :config
  (spacious-padding-mode t))

;; Read the doc string of `spacious-padding-subtle-mode-line' as it
;; is very flexible and provides several examples.
;; (setq spacious-padding-subtle-mode-line
;;       `( :mode-line-active 'default
;;          :mode-line-inactive vertical-border))

;;; --------------------------------------------------------------------------
