emacs-config.org
** Font setup

This function sets up the fonts faces that are used within org-mode.

#+begin_src emacs-lisp
  ;;; --------------------------------------------------------------------------

  (use-package faces :ensure nil)
  (defun mrf/org-font-setup ()
    "Setup org mode fonts."

    (font-lock-add-keywords
      'org-mode
      '(("^ *\\([-]\\) "
          (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•"))))))
    
    (set-face-attribute 'org-block nil
      :foreground 'unspecified
      :inherit 'fixed-pitch
      :font mono-spaced-font-family
      :height custom-default-mono-font-size)
    
    (set-face-attribute 'org-formula nil
      :inherit 'fixed-pitch)
    
    (set-face-attribute 'org-code nil
      :foreground 'unspecified
      :font mono-spaced-font-family
      :height custom-default-mono-font-size
      :inherit '(shadow fixed-pitch))

    (set-face-attribute 'org-table nil
      :foreground 'unspecified
      :font mono-spaced-font-family
      :height custom-default-mono-font-size
      :inherit '(shadow fixed-pitch))
    
    (set-face-attribute 'org-verbatim nil
      :foreground 'unspecified
      :font mono-spaced-font-family
      :height custom-default-mono-font-size
      :inherit '(shadow fixed-pitch))
    
    (set-face-attribute 'org-special-keyword nil
      :inherit '(font-lock-comment-face fixed-pitch))
    
    (set-face-attribute 'org-meta-line nil
      :inherit '(font-lock-comment-face fixed-pitch))
    
    (set-face-attribute 'org-checkbox nil
      :foreground 'unspecified
      :font mono-spaced-font-family
      :height custom-default-mono-font-size
      :inherit 'fixed-pitch)
    
    (set-face-attribute 'line-number nil
      :foreground 'unspecified
      :font mono-spaced-font-family
      :height custom-default-mono-font-size
      :inherit 'fixed-pitch)
    
    (set-face-attribute 'line-number-current-line nil
      :foreground 'unspecified
      :font mono-spaced-font-family
      :height custom-default-mono-font-size
      :inherit 'fixed-pitch)

    (dolist (face '((org-level-1 . 1.50)
                     (org-level-2 . 1.25)
                     (org-level-3 . 1.15)
                     (org-level-4 . 1.05)
                     (org-level-5 . 0.95)
                     (org-level-6 . 0.90)
                     (org-level-7 . 0.90)
                     (org-level-8 . 0.90)))
      (set-face-attribute (car face) nil :font "Helvetica Neue" :weight 'regular
        :height (cdr face))))
#+end_src

** Setup

This section contains the basic configuration for =org-mode= plus the configuration for Org agendas and capture templates.

#+begin_src emacs-lisp
  ;; -----------------------------------------------------------------

  (defun mrf/org-mode-visual-fill ()
    (interactive)
    (setq visual-fill-column-width custom-org-fill-column
      visual-fill-column-center-text enable-org-fill-column-centering)
    (visual-fill-column-mode 1))

  (defun mrf/org-mode-setup ()
    (org-indent-mode)
    (variable-pitch-mode 1)
    (visual-line-mode 1)
    (mrf/org-mode-visual-fill)
    (font-lock-add-keywords nil
      '(("^_\\{5,\\}"    0 '(:foreground "green" :weight bold))))
    (setq org-ellipsis " ▾")
    (setq org-agenda-start-with-log-mode t)
    (setq org-log-done 'time)
    (setq org-log-into-drawer t)
    ;; (use-package org-habit)
    ;; (add-to-list 'org-modules 'org-habit)
    ;; (setq org-habit-graph-column 60)
    (setq org-todo-keywords
      '((sequence "TODO(t)" "NEXT(n)" "|" "DONE(d!)")
         (sequence "BACKLOG(b)" "PLAN(p)" "READY(r)" "ACTIVE(a)"
           "REVIEW(v)" "WAIT(w@/!)" "HOLD(h)" "|" "COMPLETED(c)" "CANC(k@)")))
    (setq org-refile-targets
      '(("Archive.org" :maxlevel . 1)
         ("Tasks.org" :maxlevel . 1))))

#+end_src

**** Function to setup the agenda

#+begin_src emacs-lisp
  ;;; --------------------------------------------------------------------------

  (defun mrf/org-setup-agenda ()
    (setq org-agenda-custom-commands
      '(("d" "Dashboard"
          ((agenda "" ((org-deadline-warning-days 7)))
            (todo "NEXT"
              ((org-agenda-overriding-header "Next Tasks")))
            (tags-todo "agenda/ACTIVE" ((org-agenda-overriding-header "Active Projects")))))

         ("n" "Next Tasks"
           ((todo "NEXT"
              ((org-agenda-overriding-header "Next Tasks")))))

         ("W" "Work Tasks" tags-todo "+work-email")

         ;; Low-effort next actions
         ("e" tags-todo "+TODO=\"NEXT\"+Effort<15&+Effort>0"
           ((org-agenda-overriding-header "Low Effort Tasks")
             (org-agenda-max-todos 20)
             (org-agenda-files org-agenda-files)))

         ("w" "Workflow Status"
           ((todo "WAIT"
              ((org-agenda-overriding-header "Waiting on External")
                (org-agenda-files org-agenda-files)))
             (todo "REVIEW"
               ((org-agenda-overriding-header "In Review")
                 (org-agenda-files org-agenda-files)))
             (todo "PLAN"
               ((org-agenda-overriding-header "In Planning")
                 (org-agenda-todo-list-sublevels nil)
                 (org-agenda-files org-agenda-files)))
             (todo "BACKLOG"
               ((org-agenda-overriding-header "Project Backlog")
                 (org-agenda-todo-list-sublevels nil)
                 (org-agenda-files org-agenda-files)))
             (todo "READY"
               ((org-agenda-overriding-header "Ready for Work")
                 (org-agenda-files org-agenda-files)))
             (todo "ACTIVE"
               ((org-agenda-overriding-header "Active Projects")
                 (org-agenda-files org-agenda-files)))
             (todo "COMPLETED"
               ((org-agenda-overriding-header "Completed Projects")
                 (org-agenda-files org-agenda-files)))
             (todo "CANC"
               ((org-agenda-overriding-header "Cancelled Projects")
                 (org-agenda-files org-agenda-files)))))))
    ) ;; mrf/org-setup-agenda

#+end_src

**** The capture-templates function

#+begin_src emacs-lisp
  ;;; --------------------------------------------------------------------------

  (defun mrf/org-setup-capture-templates ()
    (setq org-capture-templates
      `(("t" "Tasks / Projects")
         ("tt" "Task" entry (file+olp "~/Projects/Code/emacs-from-scratch/OrgFiles/Tasks.org" "Inbox")
         "* TODO %?\n  %U\n  %a\n        %i" :empty-lines 1)

         ("j" "Journal Entries")
         ("jj" "Journal" entry
         (file+olp+datetree "~/Projects/Code/emacs-from-scratch/OrgFiles/Journal.org")
         "\n* %<%I:%M %p> - Journal :journal:\n\n%?\n\n"
         ;; ,(dw/read-file-as-string "~/Notes/Templates/Daily.org")
         :clock-in :clock-resume
         :empty-lines 1)
         ("jm" "Meeting" entry
         (file+olp+datetree "~/Projects/Code/emacs-from-scratch/OrgFiles/Journal.org")
         "* %<%I:%M %p> - %a :meetings:\n\n%?\n\n"
         :clock-in :clock-resume
         :empty-lines 1)

         ("w" "Workflows")
         ("we" "Checking Email" entry (file+olp+datetree
                                      "~/Projects/Code/emacs-from-scratch/OrgFiles/Journal.org")
         "* Checking Email :email:\n\n%?" :clock-in :clock-resume :empty-lines 1)

         ("m" "Metrics Capture")
         ("mw" "Weight" table-line (file+headline
                                   "~/Projects/Code/emacs-from-scratch/OrgFiles/Metrics.org"
                                   "Weight")
         "| %U | %^{Weight} | %^{Notes} |" :kill-buffer t))))

#+end_src

