emacs-config.org
** The main 'Org' package
#+begin_src emacs-lisp
  ;;; --------------------------------------------------------------------------

  (use-package org
    :preface
    (mrf/org-theme-override-values)
    :commands (org-capture org-agenda)
    :defer t
    :hook (org-mode . mrf/org-mode-setup)
    :custom
    (org-startup-indented t)
    (org-pretty-entities t)
    (org-use-sub-superscripts "{}")
    (org-hide-emphasis-markers t)
    (org-startup-with-inline-images t)
    (org-image-actual-width '(300))
    :bind (:map org-mode-map
            ("C-c e" . org-edit-src-code))
    :mode ("\\.org\\'" . org-mode)
    :config
    (setq org-hide-emphasis-markers nil)
    ;; Save Org buffers after refiling!
    (advice-add 'org-refile :after 'org-save-all-org-buffers)
    (setq org-tag-alist
      '((:startgroup)
         ;; Put mutually exclusive tags here
         (:endgroup)
         ("@errand" . ?E)
         ("@home" . ?H)
         ("@work" . ?W)
         ("agenda" . ?a)
         ("planning" . ?p)
         ("publish" . ?P)
         ("batch" . ?b)
         ("note" . ?n)
         ("idea" . ?i)))
    ;; Configure custom agenda views
    (mrf/org-setup-agenda)
    (mrf/org-setup-capture-templates)
    (mrf/org-font-setup)
    (yas-global-mode t)
    (define-key global-map (kbd "C-c j")
      (lambda () (interactive) (org-capture nil "jj"))))

#+end_src

#+RESULTS:
: #s(hash-table size 65 test eql rehash-size 1.5 rehash-threshold 0.8125 data (:use-package (26172 1876 296393 0) :use-package-secs (0 0 907 0) :preface (26171 64968 44297 0) :init (26171 64968 44286 0) :init-secs (0 0 28 0) :preface-secs (0 0 265 0) :config (26171 64988 735976 0) :config-secs (0 0 361702 0)))

** Org Modern

#+begin_src emacs-lisp
  ;;; --------------------------------------------------------------------------

  (use-package org-modern
    :when (display-graphic-p)
    :after org
    :hook (org-mode . org-modern-mode)
    :config
    ;; Add frame borders and window dividers
    (modify-all-frames-parameters
      '((right-divider-width . 40)
         (internal-border-width . 40)))
    (dolist (face '(window-divider
                     window-divider-first-pixel
                     window-divider-last-pixel))
      (face-spec-reset-face face)
      (set-face-foreground face (face-attribute 'default :background nil)))
    (set-face-background 'fringe (face-attribute 'default :background nil))
    (setq
      ;; Edit settings
      org-auto-align-tags nil
      org-tags-column 0
      org-catch-invisible-edits 'show-and-error
      org-special-ctrl-a/e t
      org-insert-heading-respect-content t

      ;; Org styling, hide markup etc.
      org-hide-emphasis-markers nil
      org-pretty-entities t
      org-ellipsis "…"

      ;; Agenda styling
      org-agenda-tags-column 0
      org-agenda-block-separator ?─
      org-agenda-time-grid
      '((daily today require-timed)
         (800 1000 1200 1400 1600 1800 2000)
         " ┄┄┄┄┄ " "┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄")
      org-agenda-current-time-string
      "◀── now ─────────────────────────────────────────────────")
    (global-org-modern-mode))

#+end_src

** Better Bullets
[[https://github.com/sabof/org-bullets][org-bullets]] replaces the heading stars in =org-mode= buffers with nicer looking characters that you can control.  Another option for this is [[https://github.com/integral-dw/org-superstar-mode][org-superstar-mode]].

#+begin_src emacs-lisp
  ;;; --------------------------------------------------------------------------

  (use-package org-superstar
    :after org
    :custom
    (org-superstar-headline-bullets-list '("✪" "✫" "✦" "✧" "✸" "✺"))
    :hook (org-mode . org-superstar-mode))

#+end_src

** Export Code
To execute or export code in =org-mode= code blocks, you'll need to set up =org-babel-load-languages= for each language you'd like to use.  [[https://orgmode.org/worg/org-contrib/babel/languages.html][Babel]] documents all of the languages that you can use with =org-babel=.

#+begin_src emacs-lisp
  ;;; --------------------------------------------------------------------------

  (with-eval-after-load 'org
    (org-babel-do-load-languages
      'org-babel-load-languages
      (seq-filter
        (lambda (pair)
  	(locate-library (concat "ob-" (symbol-name (car pair)))))
        '((emacs-lisp . t)
  	 (ditaa . t)
  	 (dot . t)
  	 (emacs-lisp . t)
  	 (gnuplot . t)
  	 (haskell . nil)
  	 (latex . t)
  	 (ledger . t)
  	 (ocaml . nil)
  	 (octave . t)
  	 (plantuml . t)
  	 (python . t)
  	 (ruby . t)
  	 (screen . nil)
  	 (sh . t) ;; obsolete
  	 (shell . t)
  	 (sql . t)
  	 (sqlite . t))))
    (push '("conf-unix" . conf-unix) org-src-lang-modes))
  
#+end_src

** Structure Templates
Org Mode's structure templates feature enables you to quickly insert code blocks into your Org files in combination with =org-tempo= by typing =<= followed by the template name like =el= or =py= and then press =TAB=.  For example, to insert an empty =emacs-lisp= block below, you can type =<el= and press =TAB= to expand into such a block.  You can add more =src= block templates below by copying one of the lines and changing the two strings at the end, the first to be the template name and the second to contain the name of the language as it is known by Org Babel.

This snippet adds a hook to =org-mode= buffers so that =mrf/org-babel-tangle-config= gets executed each time such a buffer gets saved.  This function checks to see if the file being saved is the Emacs.org file you're looking at right now, and if so, automatically exports the configuration here to the associated output files.

#+begin_src emacs-lisp
  ;;; --------------------------------------------------------------------------

  (with-eval-after-load 'org
    ;; This is needed as of Org 9.2
    (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
    (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
    (add-to-list 'org-structure-template-alist '("py" . "src python")))

#+end_src

** Markdown support
While there is standard markdown support built into =org-mode=, this additional markdown package can also be used.
*Disabled for now. Plus there is a large starup time.*
#+begin_src emacs-lisp :tangle no
  ;;; --------------------------------------------------------------------------

  (use-package ox-gfm
    :after org)

#+end_src

** Org-Roam
Org Mode is known to be a great tool not just for writing and personal notes but also TODO lists, project planning, time tracking, and more. Once you start to become really invested in Org Mode you’ll eventually have to come up with a system for managing your Org files so that it’s easy to store and find the information you need.

Org Roam is an extension to Org Mode which solves a couple of the biggest problems that I’ve personally had when using Org for personal notes:

- How many Org files do I need?
- How do I decide where to put things in my Org files?

Org Roam solves these problems by making it easy to create topic-focused Org Files and link them together so that you can treat the information as nodes in a network rather than as hierarchical documents. You can think of it like a personal wiki!

*** Some required pacakages 

#+begin_src emacs-lisp
  ;;; --------------------------------------------------------------------------
  (use-package emacsql :demand t :ensure t :after org)
  (use-package emacsql-sqlite :demand t :ensure t :after org)
   
#+end_src

*** Org Agenda from Roam Notes
One of the most useful features of Org Mode is the agenda view. You can actually use your Org Roam notes as the source for this view!

Typically you won’t want to pull in all of your Org Roam notes, so we’ll only use the notes with a specific tag like Project.

Here is a snippet that will find all the notes with a specific tag and then set your org-agenda-list with the corresponding note files.

#+begin_src emacs-lisp
  ;;; --------------------------------------------------------------------------
  ;; The buffer you put this code in must have lexical-binding set to t!
  ;; See the final configuration at the end for more details.

  (defun mrf/org-roam-filter-by-tag (tag-name)
    (lambda (node)
      (member tag-name (org-roam-node-tags node))))

  (defun mrf/org-roam-list-notes-by-tag (tag-name)
    (mapcar #'org-roam-node-file
      (seq-filter
        (mrf/org-roam-filter-by-tag tag-name)
        (org-roam-node-list))))

  (defun mrf/org-roam-refresh-agenda-list ()
    (interactive)
    (setq org-agenda-files (mrf/org-roam-list-notes-by-tag "Project")))

  ;; Build the agenda list the first time for the session
#+end_src

