init.el
  :commands (org-capture org-agenda)
  :defer t
  :hook (org-mode . mrf/org-mode-setup)
  :custom
  (org-startup-indented t)
  (org-pretty-entities t)
  (org-use-sub-superscripts "{}")
  (org-hide-emphasis-markers t)
  (org-startup-with-inline-images t)
  (org-image-actual-width '(300))
  :bind (:map org-mode-map
          ("C-c e" . org-edit-src-code))
  :config
  (setq org-hide-emphasis-markers nil)
  ;; Save Org buffers after refiling!
  (advice-add 'org-refile :after 'org-save-all-org-buffers)
  (setq org-tag-alist
    '((:startgroup)
       ;; Put mutually exclusive tags here
       (:endgroup)
       ("@errand" . ?E)
       ("@home" . ?H)
       ("@work" . ?W)
       ("agenda" . ?a)
       ("planning" . ?p)
       ("publish" . ?P)
       ("batch" . ?b)
       ("note" . ?n)
       ("idea" . ?i)))
  ;; Configure custom agenda views
  (mrf/org-setup-agenda)
  (mrf/org-setup-capture-templates)
  (mrf/org-font-setup)
  (yas-global-mode t)
  (define-key global-map (kbd "C-c j")
    (lambda () (interactive) (org-capture nil "jj"))))

;;; --------------------------------------------------------------------------

(use-package org-modern
  :when (display-graphic-p)
  :after org
  :hook (org-mode . org-modern-mode)
  :config
  ;; Add frame borders and window dividers
  (modify-all-frames-parameters
    '((right-divider-width . 40)
       (internal-border-width . 40)))
  (dolist (face '(window-divider
                   window-divider-first-pixel
                   window-divider-last-pixel))
    (face-spec-reset-face face)
    (set-face-foreground face (face-attribute 'default :background nil)))
  (set-face-background 'fringe (face-attribute 'default :background nil))
  (setq
    ;; Edit settings
    org-auto-align-tags nil
    org-tags-column 0
    org-catch-invisible-edits 'show-and-error
    org-special-ctrl-a/e t
    org-insert-heading-respect-content t

    ;; Org styling, hide markup etc.
    org-hide-emphasis-markers nil
    org-pretty-entities t
    org-ellipsis "…"

    ;; Agenda styling
    org-agenda-tags-column 0
    org-agenda-block-separator ?─
    org-agenda-time-grid
    '((daily today require-timed)
       (800 1000 1200 1400 1600 1800 2000)
       " ┄┄┄┄┄ " "┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄")
    org-agenda-current-time-string
    "◀── now ─────────────────────────────────────────────────")
  (global-org-modern-mode))

;;; --------------------------------------------------------------------------

(use-package org-superstar
  :after org
  :custom
  (org-superstar-headline-bullets-list '("✪" "✫" "✦" "✧" "✸" "✺"))
  :hook (org-mode . org-superstar-mode))

;;; --------------------------------------------------------------------------

(with-eval-after-load 'org
  (org-babel-do-load-languages
    'org-babel-load-languages
    (seq-filter
      (lambda (pair)
	(locate-library (concat "ob-" (symbol-name (car pair)))))
      '((emacs-lisp . t)
	 (ditaa . t)
	 (dot . t)
	 (emacs-lisp . t)
	 (gnuplot . t)
	 (haskell . nil)
	 (latex . t)
	 (ledger . t)
	 (ocaml . nil)
	 (octave . t)
	 (plantuml . t)
	 (python . t)
	 (ruby . t)
	 (screen . nil)
	 (sh . t) ;; obsolete
	 (shell . t)
	 (sql . t)
	 (sqlite . t))))
  (push '("conf-unix" . conf-unix) org-src-lang-modes))

;;; --------------------------------------------------------------------------

(with-eval-after-load 'org
  ;; This is needed as of Org 9.2
  (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
  (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
  (add-to-list 'org-structure-template-alist '("py" . "src python")))

;;; --------------------------------------------------------------------------
(use-package emacsql :demand t :ensure t :after org)
(use-package emacsql-sqlite :demand t :ensure t :after org)

;;; --------------------------------------------------------------------------
;; The buffer you put this code in must have lexical-binding set to t!
;; See the final configuration at the end for more details.

(defun mrf/org-roam-filter-by-tag (tag-name)
  (lambda (node)
    (member tag-name (org-roam-node-tags node))))

(defun mrf/org-roam-list-notes-by-tag (tag-name)
  (mapcar #'org-roam-node-file
    (seq-filter
      (mrf/org-roam-filter-by-tag tag-name)
      (org-roam-node-list))))

(defun mrf/org-roam-refresh-agenda-list ()
  (interactive)
  (setq org-agenda-files (mrf/org-roam-list-notes-by-tag "Project")))

;; Build the agenda list the first time for the session

;;; --------------------------------------------------------------------------

(defun mrf/org-roam-project-finalize-hook ()
