emacs-config.org
*** Selecting from a list of notes
The org-roam-node-find function gives us the ability to filter the list of notes that get displayed for selection.

We can define our own function that shows a selection list for notes that have a specific tag like Project which we talked about before. This can be useful to set up a keybinding to quickly select from a specific set of notes!

One added benefit is that we can override the set of capture templates that get used when a new note gets created.

This means that we can automatically create a new note with our project capture template if the note doesn’t already exist!

#+begin_src emacs-lisp
  ;;; --------------------------------------------------------------------------

  (defun mrf/org-roam-project-finalize-hook ()
    "Adds the captured project file to `org-agenda-files' if the
  capture was not aborted."
    ;; Remove the hook since it was added temporarily
    (remove-hook 'org-capture-after-finalize-hook #'mrf/org-roam-project-finalize-hook)

    ;; Add project file to the agenda list if the capture was confirmed
    (unless org-note-abort
      (with-current-buffer (org-capture-get :buffer)
        (add-to-list 'org-agenda-files (buffer-file-name)))))

  (defun mrf/org-roam-find-project ()
    (interactive)
    ;; Add the project file to the agenda after capture is finished
    (add-hook 'org-capture-after-finalize-hook #'mrf/org-roam-project-finalize-hook)

    ;; Select a project file to open, creating it if necessary
    (org-roam-node-find
      nil
      nil
      (mrf/org-roam-filter-by-tag "Project")
      :templates
      '(("p" "project" plain "* Goals\n\n%?\n\n* Tasks\n\n** TODO Add initial tasks\n\n* Dates\n\n"
        :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+category: ${title}\n#+filetags: Project")
        :unnarrowed t))))

  ;; (global-set-key (kbd "C-c n p") #'mrf/org-roam-find-project)
  
#+end_src

*** Keep and inbox of notes and tasks
If you want to quickly capture new notes and tasks with a single keybinding into a place that you can review later, we can use org-roam-capture- to capture to a single-specific file like Inbox.org!

Even though this file won’t have the timestamped filename, it will still be treated as a node in your Org Roam notes.
#+begin_src emacs-lisp
  ;;; --------------------------------------------------------------------------

  (defun mrf/org-roam-capture-inbox ()
    (interactive)
    (org-roam-capture- :node (org-roam-node-create)
      :templates '(("i" "inbox" plain "* %?"
                   :if-new (file+head "Inbox.org" "#+title: Inbox\n")))))
  
#+end_src

*** Insert a node immediately

#+begin_src emacs-lisp

  (defun mrf/org-roam-node-insert-immediate (arg &rest args)
    (interactive "P")
    (let ((args (push arg args))
         (org-roam-capture-templates
           (list (append (car org-roam-capture-templates)
                   '(:immediate-finish t)))))
      (apply #'org-roam-node-insert args)))
#+end_src

*** Capture a task
If you’ve set up project note files like we mentioned earlier, you can set up a capture template that allows you to quickly capture tasks for any project.

Much like the example before, we can either select a project that exists or automatically create a project note when it doesn’t exist yet.

#+begin_src emacs-lisp
  ;;; --------------------------------------------------------------------------

  (defun mrf/org-roam-capture-task ()
    (interactive)
    ;; Add the project file to the agenda after capture is finished
    (add-hook 'org-capture-after-finalize-hook #'mrf/org-roam-project-finalize-hook)

    ;; Capture the new task, creating the project file if necessary
    (org-roam-capture- :node (org-roam-node-read nil
                             (mrf/org-roam-filter-by-tag "Project"))
      :templates '(("p" "project" plain "** TODO %?"
                   :if-new
                   (file+head+olp "%<%Y%m%d%H%M%S>-${slug}.org"
                     "#+title: ${title}\n#+category: ${title}\n#+filetags: Project"
                     ("Tasks"))))))
#+end_src

*** Todo
The following snippet sets up a hook for all Org task state changes and then copies the completed (DONE) entry to today’s note file

#+begin_src emacs-lisp
  ;;; --------------------------------------------------------------------------

  (defun mrf/org-roam-copy-todo-to-today ()
    (interactive)
    (let ((org-refile-keep t) ;; Set this to nil to delete the original!
         (org-roam-dailies-capture-templates
           '(("t" "tasks" entry "%?"
               :if-new (file+head+olp "%<%Y-%m-%d>.org" "#+title: %<%Y-%m-%d>\n" ("Tasks")))))
         (org-after-refile-insert-hook #'save-buffer)
         today-file pos)
      (save-window-excursion
        (org-roam-dailies--capture (current-time) t)
        (setq today-file (buffer-file-name))
        (setq pos (point)))

      ;; Only refile if the target file is different than the current file
      (unless (equal (file-truename today-file)
              (file-truename (buffer-file-name)))
        (org-refile nil nil (list "Tasks" today-file nil pos)))))

#+end_src

*** Table-of-contents
#+begin_src emacs-lisp

  (use-package toc-org
    :after org markdown-mode
    :hook
    (org-mode . toc-org-mode)
    (markdown-mode-hook . toc-org-mode)
    :bind (:map markdown-mode-map
          ("C-c C-o" . toc-org-markdown-follow-thing-at-point)))

#+end_src

*** Main Org-roam Configuration

#+begin_src emacs-lisp

  (use-package org-roam
    ;; :demand t  ;; Ensure org-roam is loaded by default
    :defer t
    :init
    (setq org-roam-v2-ack t)
    (make-directory (expand-file-name "org-roam-notes" user-emacs-directory) t)
    :ensure t
    :commands (org-roam-node-find org-roam-node-insert org-roam-capture-templates)
    ;; :after org
    :custom
    (org-roam-directory (expand-file-name "org-roam-notes" user-emacs-directory))
    (org-roam-completion-everywhere t)
    :bind ( ("C-c n l" . org-roam-buffer-toggle)
          ("C-c n f" . org-roam-node-find)
          ("C-c n i" . org-roam-node-insert)
          ("C-c n I" . mrf/org-roam-node-insert-immediate)
          ("C-c n p" . mrf/org-roam-find-project)
          ("C-c n t" . mrf/org-roam-capture-task)
          ("C-c n b" . mrf/org-roam-capture-inbox)
          :map org-mode-map
          ("C-M-i" . completion-at-point)
          :map org-roam-dailies-map
          ("Y" . org-roam-dailies-capture-yesterday)
          ("T" . org-roam-dailies-capture-tomorrow))
    :bind-keymap
    ("C-c n d" . org-roam-dailies-map)
    :config
    (require 'org-roam-dailies) ;; Ensure the keymap is available
    (mrf/org-roam-refresh-agenda-list)
    (add-to-list 'org-after-todo-state-change-hook
      (lambda ()
        (when (equal org-state "DONE")
        (mrf/org-roam-copy-todo-to-today))))
    (org-roam-db-autosync-mode))

#+end_src

** Org-transclusion

Org-transclusion lets you insert a copy of text content via a file link or ID link within an Org file. It lets you have the same content present in different buffers at the same time without copy-and-pasting it. Edit the source of the content, and you can refresh the transcluded copies to the up-to-date state. Org-transclusion keeps your files clear of the transcluded copies, leaving only the links to the original content.

*This is experimental for me and will only enable it when testing.*

#+begin_src emacs-lisp :tangle no

  (use-package org-transclusion
    :after org
    :config
    (define-key global-map (kbd "<f12>") #'org-transclusion-add)
    (define-key global-map (kbd "C-n t") #'org-transclusion-mode))

#+end_src


* Denote

Denote aims to be a simple-to-use, focused-in-scope, and effective note-taking and file-naming tool for Emacs.

Denote is based on the idea that files should follow a predictable and descriptive file-naming scheme. The file name must offer a clear indication of what the contents are about, without reference to any other metadata. Denote basically streamlines the creation of such files or file names while providing facilities to link between them (where those files are editable).

Denote’s file-naming scheme is not limited to “notes”. It can be used for all types of file, including those that are not editable in Emacs, such as videos. Naming files in a consistent way makes their filtering and retrieval considerably easier. Denote provides relevant facilities to rename files, regardless of file type.

