emacs-config.org
** Denote Keymap

#+begin_src emacs-lisp
  ;;; --------------------------------------------------------------------------

  (defun mrf/define-denote-keymap ()
    (interactive)
    ;; Denote DOES NOT define any key bindings.  This is for the user to
    ;; decide.
    ;; Just in case, unbind some org-roam keys so it doesn't get loaded
    ;; unintentionally. These are some that show up in the which-key menu:
    (unbind-key "C-c n f")
    (unbind-key "C-c n l")
    (unbind-key "C-c n p")
    (let ((map global-map))
      (define-key map (kbd "C-c n n") #'denote)
      (define-key map (kbd "C-c n c") #'denote-region) ; "contents" mnemonic
      (define-key map (kbd "C-c n N") #'denote-type)
      (define-key map (kbd "C-c n o") #'denote-open-or-create)
      (define-key map (kbd "C-c n d") #'denote-date)
      (define-key map (kbd "C-c n z") #'denote-signature) ; "zettelkasten" mnemonic
      (define-key map (kbd "C-c n s") #'denote-subdirectory)
      (define-key map (kbd "C-c n t") #'denote-template)
      ;; If you intend to use Denote with a variety of file types, it is
      ;; easier to bind the link-related commands to the `global-map', as
      ;; shown here.  Otherwise follow the same pattern for `org-mode-map',
      ;; `markdown-mode-map', and/or `text-mode-map'.
      (define-key map (kbd "C-c n i") #'denote-link) ; "insert" mnemonic
      (define-key map (kbd "C-c n I") #'denote-add-links)
      (define-key map (kbd "C-c n b") #'denote-backlinks)
      (define-key map (kbd "C-c n f f") #'denote-find-link)
      (define-key map (kbd "C-c n f b") #'denote-find-backlink)
      ;; Note that `denote-rename-file' can work from any context, not just
      ;; Dired bufffers.  That is why we bind it here to the `global-map'.
      (define-key map (kbd "C-c n r") #'denote-rename-file)
      (define-key map (kbd "C-c n R") #'denote-rename-file-using-front-matter))

    ;; Key bindings specifically for Dired.
    (let ((map dired-mode-map))
      (define-key map (kbd "C-c C-d C-i") #'denote-link-dired-marked-notes)
      (define-key map (kbd "C-c C-d C-r") #'denote-dired-rename-files)
      (define-key map (kbd "C-c C-d C-k") #'denote-dired-rename-marked-files-with-keywords)
      (define-key map (kbd "C-c C-d C-R") #'denote-dired-rename-marked-files-using-front-matter))

    (if (mrf/minor-mode-is-active 'which-key-mode)
      (which-key-add-key-based-replacements "C-c n f" "denote-find")))

#+end_src

** Denote Configuration

#+begin_src  emacs-lisp
  ;;; --------------------------------------------------------------------------
  
  (use-package denote
    :custom
    (denote-directory (expand-file-name "notes" user-emacs-directory))
    (denote-save-buffers nil)
    ;; (denote-known-keywords '("emacs" "philosophy" "politics" "economics"))
    (denote-infer-keywords t)
    (denote-sort-keywords t)
    (denote-file-type nil) ; Org is the default, set others here
    (denote-prompts '(title keywords))
    (denote-excluded-directories-regexp nil)
    (denote-excluded-keywords-regexp nil)
    (denote-rename-confirmations '(rewrite-front-matter modify-file-name))
    (denote-date-prompt-use-org-read-date t)
    (denote-date-format nil) ; read doc string
    (denote-backlinks-show-context t)
    (denote-dired-directories
      (list denote-directory
        (thread-last denote-directory (expand-file-name "attachments"))
        (expand-file-name "books" user-emacs-directory)))
    :config
    (add-hook 'find-file-hook #'denote-link-buttonize-buffer)
    (add-hook 'dired-mode-hook #'denote-dired-mode-in-directories)
    (denote-rename-buffer-mode 1)

    (mrf/define-denote-keymap) ;; Define the keymap for Denote.

    (with-eval-after-load 'org-capture
      (setq denote-org-capture-specifiers "%l\n%i\n%?")
      (add-to-list 'org-capture-templates
        '("n" "New note (with denote.el)" plain
           (file denote-last-path)
           #'denote-org-capture
           :no-save t
           :immediate-finish nil
           :kill-buffer t
           :jump-to-captured t)))

    (add-hook 'context-menu-functions #'denote-context-menu))

#+end_src


