emacs-config.org
* Treemacs
<<<Treemacs>>> is a file and project explorer similar to NeoTree or vim’s NerdTree, but largely inspired by the Project Explorer in Eclipse. It shows the file system outlines of your projects in a simple tree layout allowing quick navigation and exploration, while also possessing basic file management utilities.

#+begin_src emacs-lisp
  ;;; --------------------------------------------------------------------------
  ;;; Treemacs

  (use-package treemacs
    :after (:all winum ace-window)
    :bind (:map global-map
            ("M-0"         . treemacs-select-window)
            ("C-x t 1"   . treemacs-delete-other-windows)
            ("C-x t t"   . treemacs)
            ("C-x t d"   . treemacs-select-directory)
            ("C-x t B"   . treemacs-bookmark)
            ("C-x t C-t" . treemacs-find-file)
            ("C-x t M-t" . treemacs-find-tag))
    :config
    (setq treemacs-collapse-dirs                  (if treemacs-python-executable 3 0)
      treemacs-deferred-git-apply-delay  0.5
      treemacs-directory-name-transformer        #'identity
      treemacs-display-in-side-window            t
      treemacs-eldoc-display                     'simple
      treemacs-file-event-delay          2000
      treemacs-file-extension-regex              treemacs-last-period-regex-value
      treemacs-file-follow-delay                 0.2
      treemacs-file-name-transformer             #'identity
      treemacs-follow-after-init                 t
      treemacs-expand-after-init                 t
      treemacs-find-workspace-method             'find-for-file-or-pick-first
      treemacs-git-command-pipe          ""
      treemacs-goto-tag-strategy                 'refetch-index
      treemacs-header-scroll-indicators  '(nil . "^^^^^^")
      treemacs-hide-dot-git-directory            t
      treemacs-indentation                       2
      treemacs-indentation-string                " "
      treemacs-is-never-other-window             nil
      treemacs-max-git-entries           5000
      treemacs-missing-project-action            'ask
      treemacs-move-forward-on-expand            nil
      treemacs-no-png-images                     nil
      treemacs-no-delete-other-windows   t
      treemacs-project-follow-cleanup            nil
      treemacs-persist-file                      (expand-file-name
                                                     ".cache/treemacs-persist"
                                                     user-emacs-directory)
      treemacs-position                  'left
      treemacs-read-string-input                 'from-child-frame
      treemacs-recenter-distance                 0.1
      treemacs-recenter-after-file-follow        nil
      treemacs-recenter-after-tag-follow         nil
      treemacs-recenter-after-project-jump       'always
      treemacs-recenter-after-project-expand     'on-distance
      treemacs-litter-directories                '("/node_modules"
                                              "/.venv"
                                              "/.cask"
                                              "/__pycache__")
      treemacs-project-follow-into-home  nil
      treemacs-show-cursor                       nil
      treemacs-show-hidden-files                 t
      treemacs-silent-filewatch          nil
      treemacs-silent-refresh                    nil
      treemacs-sorting                   'alphabetic-asc
      treemacs-select-when-already-in-treemacs 'move-back
      treemacs-space-between-root-nodes  t
      treemacs-tag-follow-cleanup                t
      treemacs-tag-follow-delay          1.5
      treemacs-text-scale                        nil
      treemacs-user-mode-line-format             nil
      treemacs-user-header-line-format   nil
      treemacs-wide-toggle-width                 70
      treemacs-width                             38
      treemacs-width-increment           1
      treemacs-width-is-initially-locked         t
      treemacs-workspace-switch-cleanup  nil)

    ;; The default width and height of the icons is 22 pixels. If you are
    ;; using a Hi-DPI display, uncomment this to double the icon size.
    ;;(treemacs-resize-icons 44)

    (treemacs-follow-mode t)
    (treemacs-filewatch-mode t)
    (treemacs-fringe-indicator-mode 'always)
    (when treemacs-python-executable
      (treemacs-git-commit-diff-mode t))
    (pcase (cons (not (null (executable-find "git")))
             (not (null treemacs-python-executable)))
      (`(t . t)
        (treemacs-git-mode 'deferred))
      (`(t . _)
        (treemacs-git-mode 'simple)))
    (treemacs-hide-gitignored-files-mode nil))

#+end_src

** Treemacs Projectile

#+begin_src emacs-lisp
  ;;; --------------------------------------------------------------------------

  (use-package treemacs-projectile
    :when (equal custom-project-handler 'custom-project-projectile)
    :after treemacs projectile)

#+end_src

** Treemacs dired
#+begin_src emacs-lisp
  ;;; --------------------------------------------------------------------------

  (use-package treemacs-icons-dired
    :after treemacs
    :hook (dired-mode . treemacs-icons-dired-enable-once))

#+end_src

** Treemacs Persp
#+begin_src emacs-lisp
  ;;; --------------------------------------------------------------------------

  ;; (use-package treemacs-perspective
  ;;    :disabled
  ;;    :after (treemacs persp-mode) ;;or perspective vs. persp-mode
  ;;    :config (treemacs-set-scope-type 'Perspectives))

  (use-package treemacs-persp ;;treemacs-perspective if you use perspective.el vs. persp-mode
    ;;:ensure (:files ("src/extra/treemacs-persp.el" "treemacs-persp-pkg.el"):host github :repo "Alexander-Miller/treemacs")
    :after (:any treemacs persp-mode) ;;or perspective vs. persp-mode
    :config (treemacs-set-scope-type 'Perspectives))

#+end_src

** Treemacs tab-bar

#+begin_src emacs-lisp
  ;;; --------------------------------------------------------------------------

  (use-package treemacs-tab-bar ;;treemacs-tab-bar if you use tab-bar-mode
    :after treemacs
    :config (treemacs-set-scope-type 'Tabs))

#+end_src

** Treemacs all-the-icons

#+begin_src emacs-lisp
  ;;; --------------------------------------------------------------------------

  (use-package treemacs-all-the-icons
    :after treemacs
    :if (display-graphic-p))

#+end_src


* Dashboard
<<<Dashboard>>> is an extensible Emacs startup screen showing you what’s most important.
**** Value of dashboard-startup-banner can be:
***** =nil= to display no banner
***** ='official= which displays the official emacs logo
***** ='logo= which displays an alternative emacs logo
***** =1, 2 or 3= which displays one of the text banners
***** ~"path/to/your/image.gif"~, ~"path/to/your/image.png"~ or ~"path/to/your/text.txt"~  which displays whatever gif/image/text you would prefer
***** a cons of '("path/to/your/image.png" . "path/to/your/text.txt")

** Dashboard Setup
#+begin_src emacs-lisp
    ;;; --------------------------------------------------------------------------

  (use-package dashboard
    :custom
    (dashboard-items '(   (recents . 15)
                        (bookmarks . 10)
                        (projects . 10)))
    (dashboard-center-content t)
    (dashboard-set-heading-icons t)
    (dashboard-set-file-icons t)
    (dashboard-footer-messages '("Greetings Program!"))
    (dashboard-banner-logo-title "Welcome to Emacs!")
    (dashboard-startup-banner 'logo)
    :bind ("C-c d" . dashboard-open)
    :config
    ;; (setq initial-buffer-choice (lambda () (get-buffer-create dashboard-buffer-name)))
    (add-hook 'elpaca-after-init-hook #'dashboard-insert-startupify-lists)
    (add-hook 'elpaca-after-init-hook #'dashboard-initialize)
    (dashboard-setup-startup-hook))

#+end_src



* Integrated Development Environments
The following are configured for Python development and provide an IDE type experience.  It's worth noting that Eglot/LSP can be configured for other languages. The others are Python specific. Use the =configure= system to select which one is used (=Mrf Custom Selection=).
*** Features
- context-sensitive code completion
- jump to definitions
- find references
- view documentation
- virtual environment
- eldoc mode

