emacs-config.org
** EGlot

<<<Eglot>>> is the Emacs client for the Language Server Protocol (LSP). Eglot provides infrastructure and a set of commands for enriching the source code editing capabilities of Emacs via LSP. Eglot itself is completely language-agnostic, but it can support any programming language for which there is a language server and an Emacs major mode.

#+begin_src emacs-lisp
    ;;; --------------------------------------------------------------------------
    ;;; Emacs Polyglot is the Emacs LSP client that stays out of your way:

  (defvar mrf/clangd-path (executable-find "clangd")
    "Clangd executable path.")

  (defun mrf/projectile-proj-find-function (dir)
    "Find the project `DIR' function for Projectile.
    Thanks @wyuenho on GitHub"
    (let ((root (projectile-project-root dir)))
      (and root (cons 'transient root))))

  (use-package track-changes
    :defer t
    :config
    (unless theme-did-load
      (mrf/load-theme-from-selector)))

#+end_src

*** JSON-RPC

The JSON-RPC protocol is used to communicate with many different types of server. This is required for the DAPE and DAP Debug Adapters as well as Eglot.

#+begin_src emacs-lisp
  ;;; ------------------------------------------------------------------------
  (use-package jsonrpc
    :config
    ;; For some odd reason, it is possible that jsonrpc will try to load a
    ;; theme. (jsonrpc/lisp/custom.el:1362). If our theme hasn't been loaded
    ;; yet, go ahead and try. This could prevent a startup without the theme
    ;; properly loaded.
    (unless theme-did-load
      (mrf/load-theme-from-selector)))

#+end_src

*** Eglot Setup

#+begin_src emacs-lisp

  (use-package eglot
    :when (equal custom-ide 'custom-ide-eglot)
    ;; :ensure (:repo "https://github.com/emacs-mirror/emacs" :local-repo "eglot" :branch "master"
    ;;            :files ("lisp/progmodes/eglot.el" "doc/emacs/doclicense.texi" "doc/emacs/docstyle.texi"
    ;;                      "doc/misc/eglot.texi" "etc/EGLOT-NEWS" (:exclude ".git")))
    :after eldoc track-changes company
    :after (:any (:all company which-key eldoc) (:any jsonrpc python))
    :init
    (setq company-backends
      (cons 'company-capf
        (remove 'company-capf company-backends)))
    :hook
    (lisp-mode . eglot-ensure)
    (python-mode . eglot-ensure)
    (go-mode . eglot-ensure)
    (rust-mode . eglot-ensure)
    ;; (c-mode . eglot-ensure)
    ;; (c++-mode . eglot-ensure)
    ;; (prog-mode . eglot-ensure)
    :config
    (add-to-list 'major-mode-remap-alist '(python-mode . python-ts-mode))
    (which-key-add-key-based-replacements "C-c g r" "find-symbol-reference")
    (which-key-add-key-based-replacements "C-c g o" "find-defitions-other-window")
    (which-key-add-key-based-replacements "C-c g g" "find-defitions")
    (which-key-add-key-based-replacements "C-c g ?" "eldoc-definition")
    ;; Eldoc/Eglot will try to load/unload a theme which can cause issues with our
    ;; theme loading mechanism. Our theme could fail to load because of this.  So,
    ;; to get our themes loading properly, load it here if not already loaded.
    (unless theme-did-load
      (mrf/load-theme-from-selector))
    (add-to-list 'eglot-stay-out-of 'flymake)
    (if (featurep 'company) ;; Company should be loaded.
      (bind-keys :map eglot-mode-map
        ("<tab>" . company-indent-or-complete-common))
      (message "Eglot: Company was expected to be loaded but wasn't.")))

#+end_src

** Language Server Protocol (lsp-mode)

Client for Language Server Protocol (v3.14). lsp-mode aims to provide IDE-like experience by providing optional integration with the most popular Emacs packages like company, flycheck and projectile.

❤ Community Driven
💎 Fully featured - supports all features in Language Server Protocol v3.14.
🚀 Fast - see performance section.
🌟 Flexible - choose between full-blown IDE with flashy UI or minimal distraction free.
⚙ Easy to configure - works out of the box and automatically upgrades if additional packages are present.

#+begin_src emacs-lisp
  ;;; --------------------------------------------------------------------------
  ;;; Language Server Protocol

  ;; (when (equal custom-ide 'custom-ide-lsp)
  ;;   (eval-when-compile (defvar lsp-enable-which-key-integration)))

  (use-package lsp-mode
    :when (equal custom-ide 'custom-ide-lsp)
    :commands (lsp lsp-deferred)
    :hook (lsp-mode . mrf/lsp-mode-setup)
    :init
    (setq lsp-keymap-prefix "C-c l")  ;; Or 'C-l', 's-l'
    :config
    (if (featurep 'company)
      (bind-keys :map lsp-mode-map
        ("<tab>" . company-indent-or-complete-common)))
    (mrf/define-rust-lsp-values)
    (lsp-enable-which-key-integration t))
  
#+end_src

*** LSP UI

This package contains all the higher level UI modules of lsp-mode, like flycheck support and code lenses. By default, lsp-mode automatically activates lsp-ui unless lsp-auto-configure is set to nil. You only have to put (use-package lsp-ui) in your config and the package will work out of the box.

#+begin_src emacs-lisp
  ;;; --------------------------------------------------------------------------

  (use-package lsp-ui
    :when (equal custom-ide 'custom-ide-lsp)
    :after lsp
    :custom
    (lsp-ui-sideline-enable t)
    (lsp-ui-sideline-show-hover t)
    (lsp-ui-sideline-delay 0.5)
    (lsp-ui-sideline-ignore-duplicates t)
    (lsp-ui-peek-always-show t)
    (lsp-ui-doc-delay 3)
    (lsp-ui-doc-position 'bottom)
    ;;(lsp-ui-doc-position 'top)
    (lsp-ui-doc-alignment 'frame)
    (lsp-ui-doc-header nil)
    (lsp-ui-doc-show-with-cursor t)
    (lsp-ui-doc-include-signature t)
    (lsp-ui-doc-use-childframe t)
    :commands lsp-ui-mode
    :bind (:map lsp-ui-mode-map
            ("C-c l d" . lsp-ui-doc-focus-frame))
    :hook (lsp-mode . lsp-ui-mode))
  
#+end_src

*** LSP Treemacs integration

Integration between lsp-mode and treemacs and implementation of treeview controls using treemacs as a tree renderer.

#+begin_src emacs-lisp
  ;;; --------------------------------------------------------------------------
  ;;; To enable bidirectional synchronization of lsp workspace folders and
  ;;; treemacs projects set lsp-treemacs-sync-mode to 1.

  (use-package lsp-treemacs
    :when (equal custom-ide 'custom-ide-lsp)
    :after lsp treemacs
    :bind (:map prog-mode-map
            ("C-c t" . treemacs))
    :config
    (lsp-treemacs-sync-mode 1))

  (use-package lsp-ivy
    :when (and (equal custom-ide 'custom-ide-lsp)
            (equal completion-handler 'comphand-ivy-counsel))
    :after lsp ivy)
#+end_src

*** LSP mode hook function

This function is called from the lsp-mode-hook when enering or leaving LSP mode.

#+begin_src emacs-lisp
  ;;; --------------------------------------------------------------------------
  ;;; LSP mode setup hook

  (defun mrf/lsp-mode-setup ()
    "Custom LSP setup function."
    (add-hook 'lsp-after-open-hook 'lsp-enable-imenu)
    (when (equal custom-ide 'custom-ide-lsp)
      (setq lsp-headerline-breadcrumb-segments '(path-up-to-project file symbols))
      (setq lsp-clangd-binary-path "/usr/bin/clangd")'
      (lsp-headerline-breadcrumb-mode)))

#+end_src

*** LSP configuration for Rust

#+begin_src emacs-lisp

  (defun mrf/define-rust-lsp-values ()
    (setq-default lsp-rust-analyzer-cargo-watch-command "clippy")
    (setq-default lsp-eldoc-render-all t)
    (setq-default lsp-idle-delay 0.6)
    ;; enable / disable the hints as you prefer:
    (setq-default lsp-inlay-hint-enable t)
    ;; These are optional configurations. See
    ;; https://emacs-lsp.github.io/lsp-mode/page/lsp-rust-analyzer/#lsp-rust-analyzer-display-chaining-hints
    ;; for a full list
    (setq-default lsp-rust-analyzer-display-lifetime-elision-hints-enable "skip_trivial")
    (setq-default lsp-rust-analyzer-display-chaining-hints t)
    (setq-default lsp-rust-analyzer-display-lifetime-elision-hints-use-parameter-names nil)
    (setq-default lsp-rust-analyzer-display-closure-return-type-hints t)
    (setq-default lsp-rust-analyzer-display-parameter-hints nil)
    (setq-default lsp-rust-analyzer-display-reborrow-hints nil))
  
#+end_src

** LSP Bridge
