emacs-config.org
****  *Note:* This is a stand-alone package. This doesn't require eglot/lsp-mode/elpy, etc.

The goal of lsp-bridge is use multi-thread technology to implement the fastest LSP client in the Emacs ecosystem.

Advantages of lsp-bridge:

+ Blazingly fast: Offload LSP request and data analysis to an external process,  preventing Emacs from getting stuck due to delays or large data triggering  garbage collection.

+ Remote Completion: Built-in support for remote server code completion, with various login methods such as passwords and public keys, supports tramp protocol and jump server

+ Out of the box: Ready to use immediately after installation, no additional configuration required, no need to tweak with completion frontend, completion backend and multi-backend mix

+ Multi-server fusion: A simple JSON is all you need to combine multiple LSP Servers into one file that provides services for example Python which offers code completion with Pyright and diagnostic and formatting capabilities with Ruff

+ Flexible Customization: Customizing LSP server options is as simple as using a JSON file, allowing different projects to have different JSON configurations with just a few lines of rules

#+begin_src emacs-lisp
  ;;; --------------------------------------------------------------------------

  (use-package lsp-bridge
    :when (equal custom-ide 'custom-ide-lsp-bridge)
    :ensure ( :host github :repo "manateelazycat/lsp-bridge"
            :files (:defaults "*.el" "*.py" "acm" "core" "langserver"
                     "multiserver" "resources") :build (:not compile))
    :custom
    (lsp-bridge-python-lsp-server "pylsp")
    :config
    (global-lsp-bridge-mode))

#+end_src


#+begin_src emacs-lisp
  ;;; --------------------------------------------------------------------------
  
  (use-package markdown-mode
    :when (equal custom-ide 'custom-ide-lsp-bridge))

#+end_src


** Anaconda-mode

Anaconda-mode provides Code navigation, documentation lookup and completion for Python.

#+begin_src emacs-lisp
  ;;; --------------------------------------------------------------------------

  (use-package anaconda-mode
    :when (equal custom-ide 'custom-ide-anaconda)
    :bind (:map python-mode-map
          ("C-c g o" . anaconda-mode-find-definitions-other-frame)
          ("C-c g g" . anaconda-mode-find-definitions)
          ("C-c C-x" . next-error))
    :config
    (which-key-add-key-based-replacements "C-c g o" "find-defitions-other-window")
    (which-key-add-key-based-replacements "C-c g g" "find-defitions")
    (use-package pyvenv-auto)
    :hook
    (if (featurep 'company)
      (bind-keys :map anaconda-mode-map
        ("<tab>" . company-indent-or-complete-common)))
    (python-mode-hook . anaconda-eldoc-mode))

#+end_src

** ELPY
Elpy is an Emacs package to bring powerful Python editing to Emacs.  It combines and configures a number of other packages, both written in Emacs Lisp as well as Python.  Elpy is fully documented at [[https://elpy.readthedocs.io/en/latest/index.html][read the docs]].

#+begin_src emacs-lisp
  ;;; --------------------------------------------------------------------------

  (use-package elpy
    :when (equal custom-ide 'custom-ide-elpy)
    :after python which-key
    :custom
    (elpy-rpc-python-command "python3")
    (display-fill-column-indicator-mode 1)
    (highlight-indentation-mode nil)
    :bind (:map python-mode-map
          ("C-c g a" . elpy-goto-assignment)
          ("C-c g o" . elpy-goto-definition-other-window)
          ("C-c g g" . elpy-goto-definition)
          ("C-c g ?" . elpy-doc))
    :config
    (use-package jedi)
    (use-package flycheck
      :when (equal custom-ide 'custom-ide-elpy)
      :after elpy
      :defer t
      :diminish FlM
      ;;:ensure (:host github :repo "flycheck/flycheck")
      :hook (elpy-mode . flycheck-mode))        (which-key-add-key-based-replacements "C-c g a" "goto-assignment")
    (which-key-add-key-based-replacements "C-c g o" "find-defitions-other-window")
    (which-key-add-key-based-replacements "C-c g g" "find-defitions")
    (which-key-add-key-based-replacements "C-c g ?" "eldoc-definition")
    (if (featurep 'company)
      (bind-keys :map elpy-mode-map
        ("<tab>" . company-indent-or-complete-common)))
    (elpy-enable))

#+end_src



* Completion Systems
Here are a series of completion systems that are available for Emacs.

** Prescient

prescient.el is a library which sorts and filters lists of candidates, such as appear when you use a package like Ivy or Company. Extension packages such as ivy-prescient.el and company-prescient.el adapt the library for usage with various frameworks.

prescient.el also provides a completion style (prescient) for filtering candidates via Emacs's generic completion, such as in Icomplete, Vertico, and Corfu. These last two have extension packages to correctly set up filtering and sorting.

As compared to other packages which accomplish similar tasks, including IDO, Ivy, Helm, Smex, Flx, Historian, and Company-Statistics, prescient.el aims to be simpler, more predictable, and faster.

TL;DR prescient.el: simple but effective sorting and filtering for Emacs.

#+begin_src emacs-lisp

  (use-package prescient)
  
#+end_src

** Orderless

This package provides an orderless completion style that divides the pattern into space-separated components, and matches candidates that match all of the components in any order. Each component can match in any one of several ways: literally, as a regexp, as an initialism, in the flex style, or as multiple word prefixes. By default, regexp and literal matches are enabled.

#+begin_src emacs-lisp
  ;;; --------------------------------------------------------------------------

  (use-package orderless
    :when (or (equal completion-handler 'comphand-vertico)
            (equal completion-handler 'comphand-ivy-counsel))
    :custom
    (completion-styles '(orderless basic))
    (completion-category-overrides '((file (styles basic partial-completion)))))

#+end_src

** IVY Mode

<<<Ivy>>> is an excellent completion framework for Emacs.  It provides a minimal yet powerful selection menu that appears when you open files, switch buffers, and for many other tasks in Emacs.  Counsel is a customized set of commands to replace `find-file` with `counsel-find-file`, etc which provide useful commands for each of the default completion commands.

#+begin_src emacs-lisp
  ;;; --------------------------------------------------------------------------
  ;;; Swiper and IVY mode

  (use-package ivy
    :when (equal completion-handler 'comphand-ivy-counsel)
    :bind (("C-s" . swiper)
            :map ivy-minibuffer-map
              ;;; ("TAB" . ivy-alt-done)
            ("C-l" . ivy-alt-done)
            ("C-j" . ivy-next-line)
            ("C-k" . ivy-previous-line)
            :map ivy-switch-buffer-map
            ("C-k" . ivy-previous-line)
            ("C-l" . ivy-done)
            ("C-d" . ivy-switch-buffer-kill)
            :map ivy-reverse-i-search-map
            ("C-k" . ivy-previous-line)
            ("C-d" . ivy-reverse-i-search-kill))
    :custom
    (enable-recursive-minibuffers t)
    (ivy-use-virtual-buffers t)
    :config
    (ivy-mode 1)
    (setq ivy-re-builders-alist '((t . orderless-ivy-re-builder)))
    (add-to-list 'ivy-highlight-functions-alist
      '(orderless-ivy-re-builder . orderless-ivy-highlight)))

#+end_src

*** Ivy-rich and ivy-yasnippet

Ivy-rich provides rich transformers for commands from ivy and counsel.
Ivy-yasnippet lets you preview yasnippet snippets with ivy.

#+begin_src emacs-lisp
  ;;; --------------------------------------------------------------------------

  (use-package ivy-rich
    :when (equal completion-handler 'comphand-ivy-counsel)
    :after ivy
    :init
    (ivy-rich-mode 1)
    :config
    (setcdr (assq t ivy-format-functions-alist) #'ivy-format-function-line))

  (use-package ivy-yasnippet
    :when (equal completion-handler 'comphand-ivy-counsel)
    :after (:any yasnippet ivy))
  ;; :ensure (:host github :repo "mkcms/ivy-yasnippet"))

#+end_src

*** Swiper
Swiper is an alternative to isearch that uses Ivy to show an overview of all matches.

#+begin_src emacs-lisp
  ;;; --------------------------------------------------------------------------

  (use-package swiper
    :when (equal completion-handler 'comphand-ivy-counsel)
    :after ivy)

#+end_src

*** Counsel

~ivy-mode~ ensures that any Emacs command using completing-read-function uses ivy for completion.
Counsel takes this further, providing versions of common Emacs commands that are customised to make the best use of Ivy. For example, ~counsel-find-file~ has some additional keybindings. Pressing =DEL= will move you to the parent directory.

#+begin_src emacs-lisp :results output silent
  ;;; --------------------------------------------------------------------------

  (use-package counsel
    :when (equal completion-handler 'comphand-ivy-counsel)
    :bind ( ("C-M-j" . 'counsel-switch-buffer)
            ("M-x" . 'counsel-M-x)
            ("M-g o" . 'counsel-outline)
            ("C-x C-f" . 'counsel-find-file)
            ("C-c C-r" . 'ivy-resume)
            :map minibuffer-local-map
            ("C-r" . 'counsel-minibuffer-history))
    :custom
    (counsel-linux-app-format-function #'counsel-linux-app-format-function-name-only)
    :config
    (counsel-mode 1))

#+end_src

*** Ivy Prescient
~prescient.el~ is a library which sorts and filters lists of candidates, such as appear when you use a package like =Ivy= or =Company=.

#+begin_src emacs-lisp
  ;;; --------------------------------------------------------------------------

  (use-package ivy-prescient
    :when (equal completion-handler 'comphand-ivy-counsel)
    :after (ivy prescient)
    :custom
    (prescient-persist-mode t)
    (ivy-prescient-mode t)
    (ivy-prescient-enable-filtering t))

#+end_src

