init.el

(use-package lsp-bridge
  :when (equal custom-ide 'custom-ide-lsp-bridge)
  :ensure ( :host github :repo "manateelazycat/lsp-bridge"
          :files (:defaults "*.el" "*.py" "acm" "core" "langserver"
                   "multiserver" "resources") :build (:not compile))
  :custom
  (lsp-bridge-python-lsp-server "pylsp")
  :config
  (global-lsp-bridge-mode))

;;; --------------------------------------------------------------------------

(use-package markdown-mode
  :when (equal custom-ide 'custom-ide-lsp-bridge))

;;; --------------------------------------------------------------------------

(use-package anaconda-mode
  :when (equal custom-ide 'custom-ide-anaconda)
  :bind (:map python-mode-map
        ("C-c g o" . anaconda-mode-find-definitions-other-frame)
        ("C-c g g" . anaconda-mode-find-definitions)
        ("C-c C-x" . next-error))
  :config
  (which-key-add-key-based-replacements "C-c g o" "find-defitions-other-window")
  (which-key-add-key-based-replacements "C-c g g" "find-defitions")
  (use-package pyvenv-auto)
  :hook
  (if (featurep 'company)
    (bind-keys :map anaconda-mode-map
      ("<tab>" . company-indent-or-complete-common)))
  (python-mode-hook . anaconda-eldoc-mode))

;;; --------------------------------------------------------------------------

(use-package elpy
  :when (equal custom-ide 'custom-ide-elpy)
  :after python which-key
  :custom
  (elpy-rpc-python-command "python3")
  (display-fill-column-indicator-mode 1)
  (highlight-indentation-mode nil)
  :bind (:map python-mode-map
        ("C-c g a" . elpy-goto-assignment)
        ("C-c g o" . elpy-goto-definition-other-window)
        ("C-c g g" . elpy-goto-definition)
        ("C-c g ?" . elpy-doc))
  :config
  (use-package jedi)
  (use-package flycheck
    :when (equal custom-ide 'custom-ide-elpy)
    :after elpy
    :defer t
    :diminish FlM
    ;;:ensure (:host github :repo "flycheck/flycheck")
    :hook (elpy-mode . flycheck-mode))        (which-key-add-key-based-replacements "C-c g a" "goto-assignment")
  (which-key-add-key-based-replacements "C-c g o" "find-defitions-other-window")
  (which-key-add-key-based-replacements "C-c g g" "find-defitions")
  (which-key-add-key-based-replacements "C-c g ?" "eldoc-definition")
  (if (featurep 'company)
    (bind-keys :map elpy-mode-map
      ("<tab>" . company-indent-or-complete-common)))
  (elpy-enable))

(use-package prescient)

;;; --------------------------------------------------------------------------

(use-package orderless
  :when (or (equal completion-handler 'comphand-vertico)
          (equal completion-handler 'comphand-ivy-counsel))
  :custom
  (completion-styles '(orderless basic))
  (completion-category-overrides '((file (styles basic partial-completion)))))

;;; --------------------------------------------------------------------------
;;; Swiper and IVY mode

(use-package ivy
  :when (equal completion-handler 'comphand-ivy-counsel)
  :bind (("C-s" . swiper)
          :map ivy-minibuffer-map
            ;;; ("TAB" . ivy-alt-done)
          ("C-l" . ivy-alt-done)
          ("C-j" . ivy-next-line)
          ("C-k" . ivy-previous-line)
          :map ivy-switch-buffer-map
          ("C-k" . ivy-previous-line)
          ("C-l" . ivy-done)
          ("C-d" . ivy-switch-buffer-kill)
          :map ivy-reverse-i-search-map
          ("C-k" . ivy-previous-line)
          ("C-d" . ivy-reverse-i-search-kill))
  :custom
  (enable-recursive-minibuffers t)
  (ivy-use-virtual-buffers t)
  :config
  (ivy-mode 1)
  (setq ivy-re-builders-alist '((t . orderless-ivy-re-builder)))
  (add-to-list 'ivy-highlight-functions-alist
    '(orderless-ivy-re-builder . orderless-ivy-highlight)))

;;; --------------------------------------------------------------------------

(use-package ivy-rich
  :when (equal completion-handler 'comphand-ivy-counsel)
  :after ivy
  :init
  (ivy-rich-mode 1)
  :config
  (setcdr (assq t ivy-format-functions-alist) #'ivy-format-function-line))

(use-package ivy-yasnippet
  :when (equal completion-handler 'comphand-ivy-counsel)
  :after (:any yasnippet ivy))
;; :ensure (:host github :repo "mkcms/ivy-yasnippet"))

;;; --------------------------------------------------------------------------

(use-package swiper
  :when (equal completion-handler 'comphand-ivy-counsel)
  :after ivy)

;;; --------------------------------------------------------------------------

(use-package counsel
  :when (equal completion-handler 'comphand-ivy-counsel)
  :bind ( ("C-M-j" . 'counsel-switch-buffer)
          ("M-x" . 'counsel-M-x)
          ("M-g o" . 'counsel-outline)
          ("C-x C-f" . 'counsel-find-file)
          ("C-c C-r" . 'ivy-resume)
          :map minibuffer-local-map
          ("C-r" . 'counsel-minibuffer-history))
  :custom
  (counsel-linux-app-format-function #'counsel-linux-app-format-function-name-only)
  :config
  (counsel-mode 1))

;;; --------------------------------------------------------------------------

(use-package ivy-prescient
  :when (equal completion-handler 'comphand-ivy-counsel)
  :after (ivy prescient)
  :custom
  (prescient-persist-mode t)
  (ivy-prescient-mode t)
  (ivy-prescient-enable-filtering t))

;;; --------------------------------------------------------------------------

;;;; Code Completion
(use-package corfu
  :when (equal completion-handler 'comphand-corfu)
