init.el
  ;; Optional customizations
  :custom
  (corfu-cycle t)                  ; Allows cycling through candidates
  (corfu-auto t)                   ; Enable auto completion
  (corfu-auto-prefix 2)
  (corfu-auto-delay 0.8)
  (corfu-popupinfo-delay '(0.5 . 0.2))
  (corfu-preview-current 'insert) ; insert previewed candidate
  (corfu-preselect 'prompt)
  (corfu-on-exact-match nil)       ; Don't auto expand tempel snippets
  ;; Optionally use TAB for cycling, default is `corfu-complete'.
  :bind (:map corfu-map
        ("M-SPC"          . corfu-insert-separator)
        ("TAB"            . corfu-next)
        ([tab]            . corfu-next)
        ("S-TAB"          . corfu-previous)
        ([backtab]    . corfu-previous)
        ("S-<return>" . corfu-insert)
        ("RET"            . nil))
  :init
  (global-corfu-mode)
  (corfu-history-mode)
  (corfu-popupinfo-mode) ; Popup completion info
  :config
  (add-hook 'eshell-mode-hook
    (lambda () (setq-local corfu-quit-at-boundary t
               corfu-quit-no-match t
               corfu-auto nil)
      (corfu-mode))))

(use-package corfu-prescient
  :when (equal completion-handler 'comphand-corfu)
  :after (corfu prescient))

;;; --------------------------------------------------------------------------

(use-package vertico
  :when (equal completion-handler 'comphand-vertico)
  :demand t
  ;;:wait t
  ;;:ensure (:repo "minad/vertico" :files (:defaults "extensions/vertico-*.el") :fetcher github)
  :custom
  (recentf-mode t)
  (vertico-count 12)
  (vertico-cycle nil)
  (vertico-multiform-mode 1)
  :config
  (vertico-mode)
  ;; :bind ("C-x C-f" . ido-find-file)
  ;; Clean up file path when typing
  :hook ((rfn-eshadow-update-overlay . vertico-directory-tidy)
        ;; Make sure vertico state is saved
        (minibuffer-setup . vertico-repeat-save)))

;;; --------------------------------------------------------------------------

(use-package marginalia
  ;; :when (equal completion-handler 'comphand-vertico)
  ;; :after vertico
  :custom
  (marginalia-max-relative-age 0)
  (marginalia-align 'left)
  (marginalia-annotators '(marginalia-annotators-heavy marginalia-annotators-light nil))
  :config
  (marginalia-mode t))

(use-package all-the-icons-completion
  :after (marginalia all-the-icons)
  :hook (marginalia-mode . all-the-icons-completion-marginalia-setup))

(use-package consult
  :when (equal completion-handler 'comphand-vertico)
  :after vertico
  :bind
  ([remap switch-to-buffer] . consult-buffer)
  ([remap switch-to-buffer-other-window] . consult-buffer-other-window)
  ([remap switch-to-buffer-other-frame] . consult-buffer-other-frame)
  ([remap project-switch-to-buffer] . consult-project-buffer)
  ([remap bookmark-jump] . consult-bookmark)
  ([remap recentf-open] . consult-recent-file)
  ([remap yank] . nil)
  ([remap yank-pop] . consult-yank-pop)
  ([remap goto-line] . consult-goto-line)
  ("M-g m" . consult-mark)
  ("M-g M" . consult-global-mark)
  ("M-g o" . consult-outline)
  ("M-g i" . consult-imenu)
  ("M-g I" . consult-imenu-multi)
  ("M-s l" . consult-line)
  ("M-s p" . consult-preview)  
  ("M-s L" . consult-line-multi)
  ("M-s k" . consult-keep-lines)
  ("M-s u" . consult-focus-lines)
  ("M-s r" . consult-ripgrep)
  ("M-s f" . consult-find)
  ("M-s F" . consult-locate)
  ("M-g e" . consult-compile-error)
  ("M-g f" . consult-flymake)
  ([remap repeat-complex-command] . consult-complex-command)
  ("M-s e" . consult-isearch-history)
  ([remap isearch-edit-string] . consult-isearch-history)
  ([remap next-matching-history-element] . consult-history)
  ([remap previous-matching-history-element] . consult-history)
  ([remap Info-search] . consult-info)
  :custom
  (xref-show-xrefs-function 'consult-xref)
  (xref-show-definitions-function 'consult-xref)
  :config
  (setq consult-buffer-sources
    '(consult--source-hidden-buffer 
       consult--source-buffer
       (:name "Ephemeral" :state consult--buffer-state
       :narrow 109 :category buffer
       :items ("*Messages*"  "*scratch*" "*vterm*"
                "*Async-native-compile-log*" "*dashboard*"))
       consult--source-modified-buffer
       consult--source-recent-file)))

;;; --------------------------------------------------------------------------

(use-package vertico-prescient
  :when (equal completion-handler 'comphand-vertico)
  :after vertico prescient)

;;; --------------------------------------------------------------------------

(use-package vertico-posframe
  :when (equal completion-handler 'comphand-vertico)
  :after vertico
  :custom
  (setq vertico-multiform-commands
    '((consult-line
        posframe
        (vertico-posframe-poshandler . posframe-poshandler-frame-top-center)
        (vertico-posframe-border-width . 10)
        ;; NOTE: This is useful when emacs is used in both in X and
        ;; terminal, for posframe do not work well in terminal, so
        ;; vertico-buffer-mode will be used as fallback at the
        ;; moment.
        (vertico-posframe-fallback-mode . vertico-buffer-mode))
       (t posframe)))
  (vertico-multiform-mode 1)
  (setq vertico-posframe-parameters
    '((left-fringe . 8)
       (right-fringe . 8))))

;;; --------------------------------------------------------------------------

;; This has to be evaluated at the end of the init since it's possible that the
;; completion-handler variable will not yet be defined at this point in the
;; init phase using elpaca.
(add-hook 'elpaca-after-init-hook
  (lambda ()
    (when (equal completion-handler 'comphand-built-in)
      (ido-everywhere t))))

;;; --------------------------------------------------------------------------
