emacs-config.org
** Embark

Embark makes it easy to choose a command to run based on what is near point, both during a minibuffer completion session (in a way familiar to Helm or Counsel users) and in normal buffers. Bind the command  embark-act to a key and it acts like prefix-key for a keymap of actions (commands) relevant to the target around point. With point on an URL in a buffer you can open the URL in a browser or eww or download the file it points to. If while switching buffers you spot an old one, you can kill it right there and continue to select another. Embark comes preconfigured with over a hundred actions for common types of targets such as files, buffers, identifiers, s-expressions, sentences; and it is easy to add more actions and more target types. Embark can also collect all the candidates in a minibuffer to an occur-like buffer or export them to a buffer in a major-mode specific to the type of candidates, such as dired for a set of files, ibuffer for a set of buffers, or customize for a set of variables.

#+begin_src emacs-lisp
  ;;; --------------------------------------------------------------------------

  (use-package embark
    :when enable-embark
    :bind
    (("C-." . embark-act)         ;; pick some comfortable binding
      ("C-;" . embark-dwim)        ;; good alternative: M-.
      ("C-h B" . embark-bindings)) ;; alternative for `describe-bindings'

    :init

    ;; Optionally replace the key help with a completing-read interface
    (setq prefix-help-command #'embark-prefix-help-command)

    ;; Show the Embark target at point via Eldoc. You may adjust the
    ;; Eldoc strategy, if you want to see the documentation from
    ;; multiple providers. Beware that using this can be a little
    ;; jarring since the message shown in the minibuffer can be more
    ;; than one line, causing the modeline to move up and down:

    ;; (add-hook 'eldoc-documentation-functions #'embark-eldoc-first-target)
    ;; (setq eldoc-documentation-strategy #'eldoc-documentation-compose-eagerly)

    :config

    ;; Hide the mode line of the Embark live/completions buffers
    (add-to-list 'display-buffer-alist
      '("\\`\\*Embark Collect \\(Live\\|Completions\\)\\*"
         nil
         (window-parameters (mode-line-format . none)))))

  ;; Consult users will also want the embark-consult package.
  (use-package embark-consult
    :when (equal completion-handler 'comphand-vertico)
    :defer t
    ;;:ensure t ; only need to install it, embark loads it after consult if found
    :hook
    (embark-collect-mode . consult-preview-at-point-mode))

#+end_src



* Software Development
** Language Support Packages
*** Flycheck

This is more support for a language rather than a langage itself

#+begin_src emacs-lisp
    ;;; --------------------------------------------------------------------------

  (use-package flycheck
    :unless (equal custom-ide 'custom-ide-elpy)
    :diminish FlM
    :defer t
    ;;:ensure (:host github :repo "flycheck/flycheck")
    :config
    (eval-after-load 'flycheck
      '(flycheck-package-setup))
    (global-flycheck-mode))

  (use-package flycheck-package
    :after flycheck)

#+end_src

*** Tree-sitter
Tree-sitter is a parser generator tool and an incremental parsing library. It can build a concrete syntax tree for a source file and efficiently update the syntax tree as the source file is edited. Tree-sitter aims to be:

- General enough to parse any programming language
- Fast enough to parse on every keystroke in a text editor
- Robust enough to provide useful results even in the presence of syntax errors
- Dependency-free so that the runtime library (which is written in pure C) can be embedded in any application

**** Treesit-support functions

Some functions that are used during the initialization of tree-sitter.

#+begin_src emacs-lisp
  ;;; --------------------------------------------------------------------------

  (defun mrf/tree-sitter-setup ()
    (tree-sitter-hl-mode t))

  (defun lsp-go-install-save-hooks ()
    (add-hook 'before-save-hook #'lsp-format-buffer t t)
    (add-hook 'before-save-hook #'lsp-organize-imports t t))
  
#+end_src

**** The main Tree-sitter setup

#+begin_src emacs-lisp
  ;;; --------------------------------------------------------------------------

  (use-package tree-sitter
    :defer t
    :after (:any python python-mode lisp-mode)
    :config
    ;; Activate tree-sitter globally (minor mode registered on every buffer)
    (global-tree-sitter-mode)
    (cond
      ((equal custom-ide 'custom-ide-eglot)
        (add-hook 'go-mode-hook 'eglot-ensure))
      ((equal custom-ide 'custom-ide-lsp)
        (add-hook 'go-mode-hook 'lsp-deferred)))
    :hook
    (tree-sitter-after-on . mrf/tree-sitter-setup)
    (typescript-mode . lsp-deferred)
    ;; (c-mode . lsp-deferred)
    ;; (c++-mode . lsp-deferred)
    (before-save . lsp-go-install-save-hooks)
    (js2-mode . lsp-deferred))

  (use-package tree-sitter-langs
    :after tree-sitter)
#+end_src

**** Treesit-auto

If a tree-sitter grammer is available and installed, use it instead of the corresponding default mode.  Conversely, when a tree-sitter grammar is not available and a fallback major mode is available/specified, use it instead.

#+begin_src emacs-lisp
  ;;; --------------------------------------------------------------------------

  (use-package treesit-auto
    :demand t
    :config
    (global-treesit-auto-mode))

#+end_src

*** Magit
[[https://magit.vc/][
Magit]] is the one of the best Git interface implementations .  Common Git operations are easy to execute quickly using Magit's command panel system.

#+begin_src emacs-lisp
  ;;; --------------------------------------------------------------------------

  (use-package transient :defer t)
  (use-package git-commit :after transient :defer t)
  (use-package magit :after git-commit :defer t)

  ;; NOTE: Make sure to configure a GitHub token before using this package!
  ;; - https://magit.vc/manual/forge/Token-Creation.html#Token-Creation
  ;; - https://magit.vc/manual/ghub/Getting-Started.html#Getting-Started

  (use-package forge :after magit :defer t)
  (use-package treemacs-magit :defer t :after treemacs magit)

#+end_src

** Python :Python:

<<<Python>>> is an interpreted, interactive, object-oriented programming language. It incorporates modules, exceptions, dynamic typing, very high level dynamic data types, and classes. It supports multiple programming paradigms beyond object-oriented programming, such as procedural and functional programming. Python combines remarkable power with very clear syntax. It has interfaces to many system calls and libraries, as well as to various window systems, and is extensible in C or C++. It is also usable as an extension language for applications that need a programmable interface. Finally, Python is portable: it runs on many Unix variants including Linux and macOS, and on Windows.

This is the Python setup for development under Emacs.

*** Important
Before any work can begin in python, make sure that the right packages are installed.

#+begin_src shell :results output silent

  pip3 install --upgrade pip
  pip3 install "python-lsp-server[all]"
  pip3 install debugpy

#+end_src

In addition to that, it is important that =autopep8=, which is a script, can reach python or python3. For my configuration, =autopep8= looks for python this like this:

: #!/Library/Frameworks/Python.framework/Versions/Current/bin/python3 :

*Note:* If this python path doesn't exist, you will see the very annoying

: file-missing "Doing vfork" "No such file or directory" :
message

*** Specialized python-mode Keymaps :Python:
The following are keymaps that are used by by the custom-ide and for python-mode

#+begin_src emacs-lisp
  ;;; --------------------------------------------------------------------------

  (defun mrf/set-custom-ide-python-keymaps ()
    (cond
      ((equal custom-ide 'custom-ide-lsp)
        (bind-keys :map python-mode-map
          ("C-c g r" . lsp-find-references)
          ("C-c g o" . xref-find-definitions-other-window)
          ("C-c g g" . xref-find-definitions)
          ("C-c g ?" . eldoc-doc-buffer)))
      ((equal custom-ide 'custom-ide-eglot)
        (bind-keys :map python-mode-map
          ("C-c g r" . eglot-find-implementation)
          ("C-c g o" . xref-find-definitions-other-window)
          ("C-c g g" . xref-find-definitions)
          ("C-c g ?" . eldoc-doc-buffer)))
      ((equal custom-ide 'custom-ide-elpy)
        (elpy-enable)
        (bind-keys :map python-mode-map
          ("C-c g a" . elpy-goto-assignment)
          ("C-c g o" . elpy-goto-definition-other-window)
          ("C-c g g" . elpy-goto-definition)
          ("C-c g ?" . elpy-doc)))
      ((equal custom-ide 'custom-ide-lsp-bridge)
        (bind-keys :map python-mode-map
          ("C-c g a" . lsp-bridge-find-reference)
          ("C-c g o" . lsp-bridge-find-def-other-window)
          ("C-c g g" . lsp-bridge-find-def)
          ("C-c g i" . lsp-bridge-find-impl)
          ("C-c g r" . lsp-bridge-rename)
          ("C-c g ?" . lsp-bridge-popup-documentation)))
      ))

#+end_src

*** Standard setup
