init.el

(use-package embark
  :when enable-embark
  :bind
  (("C-." . embark-act)         ;; pick some comfortable binding
    ("C-;" . embark-dwim)        ;; good alternative: M-.
    ("C-h B" . embark-bindings)) ;; alternative for `describe-bindings'

  :init

  ;; Optionally replace the key help with a completing-read interface
  (setq prefix-help-command #'embark-prefix-help-command)

  ;; Show the Embark target at point via Eldoc. You may adjust the
  ;; Eldoc strategy, if you want to see the documentation from
  ;; multiple providers. Beware that using this can be a little
  ;; jarring since the message shown in the minibuffer can be more
  ;; than one line, causing the modeline to move up and down:

  ;; (add-hook 'eldoc-documentation-functions #'embark-eldoc-first-target)
  ;; (setq eldoc-documentation-strategy #'eldoc-documentation-compose-eagerly)

  :config

  ;; Hide the mode line of the Embark live/completions buffers
  (add-to-list 'display-buffer-alist
    '("\\`\\*Embark Collect \\(Live\\|Completions\\)\\*"
       nil
       (window-parameters (mode-line-format . none)))))

;; Consult users will also want the embark-consult package.
(use-package embark-consult
  :when (equal completion-handler 'comphand-vertico)
  :defer t
  ;;:ensure t ; only need to install it, embark loads it after consult if found
  :hook
  (embark-collect-mode . consult-preview-at-point-mode))

;;; --------------------------------------------------------------------------

(use-package flycheck
  :unless (equal custom-ide 'custom-ide-elpy)
  :diminish FlM
  :defer t
  ;;:ensure (:host github :repo "flycheck/flycheck")
  :config
  (eval-after-load 'flycheck
    '(flycheck-package-setup))
  (global-flycheck-mode))

(use-package flycheck-package
  :after flycheck)

;;; --------------------------------------------------------------------------

(defun mrf/tree-sitter-setup ()
  (tree-sitter-hl-mode t))

(defun lsp-go-install-save-hooks ()
  (add-hook 'before-save-hook #'lsp-format-buffer t t)
  (add-hook 'before-save-hook #'lsp-organize-imports t t))

(use-package tree-sitter
  :defer t
  :after (:any python python-mode lisp-mode)
  :config
  ;; Activate tree-sitter globally (minor mode registered on every buffer)
  (global-tree-sitter-mode)
  (cond
    ((equal custom-ide 'custom-ide-eglot)
      (add-hook 'go-mode-hook 'eglot-ensure))
    ((equal custom-ide 'custom-ide-lsp)
      (add-hook 'go-mode-hook 'lsp-deferred)))
  :hook
  (tree-sitter-after-on . mrf/tree-sitter-setup)
  (typescript-mode . lsp-deferred)
  ;; (c-mode . lsp-deferred)
  ;; (c++-mode . lsp-deferred)
  (before-save . lsp-go-install-save-hooks)
  (js2-mode . lsp-deferred))

(use-package tree-sitter-langs
  :after tree-sitter)

;;; --------------------------------------------------------------------------
(use-package transient :defer t)
(use-package git-commit :after transient :defer t)
(use-package magit :after git-commit :defer t)

;; NOTE: Make sure to configure a GitHub token before using this package!
;; - https://magit.vc/manual/forge/Token-Creation.html#Token-Creation
;; - https://magit.vc/manual/ghub/Getting-Started.html#Getting-Started

(use-package forge :after magit :defer t)
(use-package treemacs-magit :defer t :after treemacs magit)

;;; --------------------------------------------------------------------------

(defun mrf/set-custom-ide-python-keymaps ()
  (cond
    ((equal custom-ide 'custom-ide-lsp)
      (bind-keys :map python-mode-map
        ("C-c g r" . lsp-find-references)
        ("C-c g o" . xref-find-definitions-other-window)
        ("C-c g g" . xref-find-definitions)
        ("C-c g ?" . eldoc-doc-buffer)))
    ((equal custom-ide 'custom-ide-eglot)
      (bind-keys :map python-mode-map
        ("C-c g r" . eglot-find-implementation)
        ("C-c g o" . xref-find-definitions-other-window)
        ("C-c g g" . xref-find-definitions)
        ("C-c g ?" . eldoc-doc-buffer)))
    ((equal custom-ide 'custom-ide-elpy)
      (elpy-enable)
      (bind-keys :map python-mode-map
        ("C-c g a" . elpy-goto-assignment)
        ("C-c g o" . elpy-goto-definition-other-window)
        ("C-c g g" . elpy-goto-definition)
        ("C-c g ?" . elpy-doc)))
    ((equal custom-ide 'custom-ide-lsp-bridge)
      (bind-keys :map python-mode-map
        ("C-c g a" . lsp-bridge-find-reference)
        ("C-c g o" . lsp-bridge-find-def-other-window)
        ("C-c g g" . lsp-bridge-find-def)
        ("C-c g i" . lsp-bridge-find-impl)
        ("C-c g r" . lsp-bridge-rename)
        ("C-c g ?" . lsp-bridge-popup-documentation)))
    ))

;;; --------------------------------------------------------------------------
