emacs-config.org
***** Python mode support functions

These functions are used during python intialization or file loading. This is where Python IDE functionality, linting and debugging setup begins.

#+begin_src emacs-lisp
  ;;; --------------------------------------------------------------------------

  (defun mrf/load-python-file-hook ()
    (python-mode)
    (when (equal custom-ide 'custom-ide-anaconda)
      (anaconda-mode 1))
    (message ">>> mrf/load-python-file-hook")
    (setq highlight-indentation-mode -1)
    (setq display-fill-column-indicator-mode t))

  (defun mrf/before-save ()
    "Force the check of the current python file being saved."
    (when (eq major-mode 'python-mode) ;; Python Only
      (flycheck-mode 0)
      (flycheck-mode t)
      (delete-trailing-whitespace)))

  ;; Enable DAP or DAPE, Eglot or LSP modes
  ;; This function should only be called ONCE during python-mode startup.
  (defun mrf/enable-python-features ()
    (message ">>> mrf/enable-python-features")
    ;; _____________________________
    ;; check for which debug adapter
    (cond
      ((equal debug-adapter 'debug-adapter-dap-mode)
        (unless (featurep 'dap-mode) (dap-mode)) ;; Load if not loaded.
        (define-dap-hydra))
      ((equal debug-adapter 'debug-adapter-dape)
        ;; dape should load as part of (use-package .... :after python)
        (message "dape should be auto-loading for Python.")))
    ;;___________________________
    ;; check for which custom-ide
    (cond
      ((equal custom-ide 'custom-ide-eglot)
        (eglot-ensure))
      ((equal custom-ide 'custom-ide-lsp)
        (lsp-deferred))))

  (defun mrf/python-mode-triggered ()
    ;; (eldoc-box-hover-at-point-mode t) ;; Using Mitch Key for this
    (mrf/enable-python-features)
    (mrf/set-custom-ide-python-keymaps)
    (unless (featurep 'yasnippet)
      (yas-global-mode t))
    (add-hook 'before-save-hook 'mrf/before-save)
    (set-fill-column 80))

#+end_src

***** Python mode initialization

This is the primary Python setup that is triggered by the first load of the Python mode and then any time a file is loaded.

#+begin_src emacs-lisp
  ;;; --------------------------------------------------------------------------

  (add-to-list 'auto-mode-alist '("\\.py\\'" . mrf/load-python-file-hook))

  (use-package python-mode
    :hook (python-mode . mrf/python-mode-triggered))

  (use-package blacken :after python) ;Format Python file upon save.

  (if (boundp 'python-shell-completion-native-disabled-interpreters)
    (add-to-list 'python-shell-completion-native-disabled-interpreters "python3")
    (setq python-shell-completion-native-disabled-interpreters '("python3")))

#+end_src

*** Auto-pep 8
autopep8 automatically formats Python code to conform to the `PEP 8` style guide.  It uses the pycodestyle_ utility to determine what parts of the code needs to be formatted.  autopep8 is capable of fixing most of the formatting issues_ that can be reported by pycodestyle. Refer to the [[IMPORTANT][IMPORTANT]] section above for possible issues when autopep8 is installed.

#+begin_src emacs-lisp
  ;;; --------------------------------------------------------------------------

  (use-package py-autopep8
    :after python
    :hook (python-mode . py-autopep8-mode))

#+end_src

*** Python Keybinding
**** Helpful Macros
#+begin_src emacs-lisp
  ;;; --------------------------------------------------------------------------

  ;; This is a helpful macro that is used to put double quotes around a word.
  (defalias 'quote-word
    (kmacro "\" M-d \" <left> C-y"))

  (defalias 'quote-region
    (kmacro "C-w \" \" <left> C-y <right>"))

  (eval-after-load "python"
    #'(bind-keys :map python-mode-map
        ("C-c C-q" . quote-region)
        ("C-c q"   . quote-word)
        ("C-c |"   . display-fill-column-indicator-mode)))

#+end_src

*** Python Virtual Environment Support
We use Pyvenv-auto is a package that automatically changes to the Python virtual environment based upon the project's directory.  pyvenv-auto looks at the root director of the project for a =.venv= or =venv= (and a few others)

#+begin_src emacs-lisp
  ;;; --------------------------------------------------------------------------

  (use-package pyvenv-auto
    :after python
    :hook (python-mode . pyvenv-auto-run))

#+end_src

*** Pydoc
#Pydoc, the Python documentation navigation package
#+begin_src emacs-lisp
  ;;; --------------------------------------------------------------------------

  (use-package pydoc
    ;;:ensure (:host github :repo "statmobile/pydoc")
    :after python
    :custom
    (pydoc-python-command "python3")
    (pydoc-pip-version-command "pip3 --version"))

#+end_src

** JavaScript
*** Typescript
This is a basic configuration for the TypeScript language so that =.ts= files activate =typescript-ts-mode= when opened.  We're also adding a hook to =typescript-mode-hook= to call =lsp-deferred= so that we activate =lsp-mode= to get LSP features every time we edit TypeScript code.

#+begin_src emacs-lisp
  ;;; --------------------------------------------------------------------------

  (use-package typescript-mode
    :defer t
    :mode "\\.ts\\'"
    :hook
    (typescript-mode . lsp-deferred)
    (js2-mode . lsp-deferred)
    :config
    (setq typescript-indent-level 4)
    (cond
      ((equal debug-adapter 'debug-adapter-dap-mode)
        (bind-keys :map typescript-mode-map
        ("C-c ." . dap-hydra/body))
        (dap-node-setup))
      ((equal debug-adapter 'debug-adapter-dape)
        (bind-keys :map typescript-mode-map
        ("C-c ." . dape-hydra/body)))))

#+end_src

*** NodeJS

#+begin_src emacs-lisp
  ;;; --------------------------------------------------------------------------

  (defun mrf/load-js-file-hook ()
    (js2-mode)

    (when (equal debug-adapter 'debug-adapter-dap-mode)
      (dap-mode)
      (dap-firefox-setup))

    (when (equal debug-adapter 'debug-adapter-dape)
      (dape))

    (highlight-indentation-mode nil)
    (dap-firefox-setup))

  (use-package nodejs-repl :defer t)

  (defun mrf/nvm-which ()
    (let ((output (shell-command-to-string "source ~/.nvm/nvm.sh; nvm which")))
      (cadr (split-string output "[\n]+" t))))

  (setq nodejs-repl-command #'mrf/nvm-which)

#+end_src

*** JS2-Mode
#+begin_src emacs-lisp
  ;;; --------------------------------------------------------------------------

  (use-package js2-mode
    :hook (js-mode . js2-minor-mode)
    :bind (:map js2-mode-map
          ("{" . paredit-open-curly)
          ("}" . paredit-close-curly-and-newline))
    :mode ("\\.js\\'" "\\.mjs\\'" "\\.json$")
    :custom (js2-highlight-level 3))

  (use-package ac-js2
    :after js2-mode
    :hook (js2-mode . ac-js2-mode))

#+end_src

** C/C++
#+begin_src emacs-lisp
  ;;; --------------------------------------------------------------------------

  (defun mrf/load-c-file-hook ()
    (c-mode)
    (unless (featurep 'realgud))
    (use-package realgud)
    (highlight-indentation-mode nil)
    (display-fill-column-indicator-mode t))

  (defun code-compile ()
    "Look for a Makefile and compiles the code with gcc/cpp."
    (interactive)
    (unless (file-exists-p "Makefile")
      (set (make-local-variable 'compile-command)
        (let ((file (file-name-nondirectory buffer-file-name)))
        (format "%s -o %s %s"
          (if  (equal (file-name-extension file) "cpp") "g++" "gcc" )
          (file-name-sans-extension file)
          file)))
      (compile compile-command)))

  (global-set-key [f9] 'code-compile)
  (add-to-list 'auto-mode-alist '("\\.c\\'" . mrf/load-c-file-hook))
#+end_src

*** GameBoy Development
RGBDS is a compiler that has been around quite a long time (since 1997). It supports Z80 and the LR35902 assembler syntaxes that are used in the development of Game Boy and Game Boy color games.

#+begin_src emacs-lisp
  ;;; --------------------------------------------------------------------------

  (use-package z80-mode
    :when enable-gb-dev
    :ensure (:host github :repo "SuperDisk/z80-mode"))

  (use-package mwim
    :when enable-gb-dev
    :ensure (:host github :repo "alezost/mwim.el"))

  (use-package rgbds-mode
    :when enable-gb-dev
    :after mwim
    :ensure (:host github :repo "japanoise/rgbds-mode"))

#+end_src

** Rust

Rust is blazingly fast and memory-efficient: with no runtime or garbage collector, it can power performance-critical services, run on embedded devices, and easily integrate with other languages.

