init.el

(defun mrf/load-python-file-hook ()
  (python-mode)
  (when (equal custom-ide 'custom-ide-anaconda)
    (anaconda-mode 1))
  (message ">>> mrf/load-python-file-hook")
  (setq highlight-indentation-mode -1)
  (setq display-fill-column-indicator-mode t))

(defun mrf/before-save ()
  "Force the check of the current python file being saved."
  (when (eq major-mode 'python-mode) ;; Python Only
    (flycheck-mode 0)
    (flycheck-mode t)
    (delete-trailing-whitespace)))

;; Enable DAP or DAPE, Eglot or LSP modes
;; This function should only be called ONCE during python-mode startup.
(defun mrf/enable-python-features ()
  (message ">>> mrf/enable-python-features")
  ;; _____________________________
  ;; check for which debug adapter
  (cond
    ((equal debug-adapter 'debug-adapter-dap-mode)
      (unless (featurep 'dap-mode) (dap-mode)) ;; Load if not loaded.
      (define-dap-hydra))
    ((equal debug-adapter 'debug-adapter-dape)
      ;; dape should load as part of (use-package .... :after python)
      (message "dape should be auto-loading for Python.")))
  ;;___________________________
  ;; check for which custom-ide
  (cond
    ((equal custom-ide 'custom-ide-eglot)
      (eglot-ensure))
    ((equal custom-ide 'custom-ide-lsp)
      (lsp-deferred))))

(defun mrf/python-mode-triggered ()
  ;; (eldoc-box-hover-at-point-mode t) ;; Using Mitch Key for this
  (mrf/enable-python-features)
  (mrf/set-custom-ide-python-keymaps)
  (unless (featurep 'yasnippet)
    (yas-global-mode t))
  (add-hook 'before-save-hook 'mrf/before-save)
  (set-fill-column 80))

;;; --------------------------------------------------------------------------

(add-to-list 'auto-mode-alist '("\\.py\\'" . mrf/load-python-file-hook))

(use-package python-mode
  :hook (python-mode . mrf/python-mode-triggered))

(use-package blacken :after python) ;Format Python file upon save.

(if (boundp 'python-shell-completion-native-disabled-interpreters)
  (add-to-list 'python-shell-completion-native-disabled-interpreters "python3")
  (setq python-shell-completion-native-disabled-interpreters '("python3")))

;;; --------------------------------------------------------------------------

(use-package py-autopep8
  :after python
  :hook (python-mode . py-autopep8-mode))

;;; --------------------------------------------------------------------------

;; This is a helpful macro that is used to put double quotes around a word.
(defalias 'quote-word
  (kmacro "\" M-d \" <left> C-y"))

(defalias 'quote-region
  (kmacro "C-w \" \" <left> C-y <right>"))

(eval-after-load "python"
  #'(bind-keys :map python-mode-map
      ("C-c C-q" . quote-region)
      ("C-c q"   . quote-word)
      ("C-c |"   . display-fill-column-indicator-mode)))

;;; --------------------------------------------------------------------------

(use-package pyvenv-auto
  :after python
  :hook (python-mode . pyvenv-auto-run))

;;; --------------------------------------------------------------------------

(use-package pydoc
  ;;:ensure (:host github :repo "statmobile/pydoc")
  :after python
  :custom
  (pydoc-python-command "python3")
  (pydoc-pip-version-command "pip3 --version"))

;;; --------------------------------------------------------------------------

(use-package typescript-mode
  :defer t
  :mode "\\.ts\\'"
  :hook
  (typescript-mode . lsp-deferred)
  (js2-mode . lsp-deferred)
  :config
  (setq typescript-indent-level 4)
  (cond
    ((equal debug-adapter 'debug-adapter-dap-mode)
      (bind-keys :map typescript-mode-map
      ("C-c ." . dap-hydra/body))
      (dap-node-setup))
    ((equal debug-adapter 'debug-adapter-dape)
      (bind-keys :map typescript-mode-map
      ("C-c ." . dape-hydra/body)))))

;;; --------------------------------------------------------------------------

(defun mrf/load-js-file-hook ()
  (js2-mode)

  (when (equal debug-adapter 'debug-adapter-dap-mode)
    (dap-mode)
    (dap-firefox-setup))

  (when (equal debug-adapter 'debug-adapter-dape)
    (dape))

  (highlight-indentation-mode nil)
  (dap-firefox-setup))

(use-package nodejs-repl :defer t)

(defun mrf/nvm-which ()
  (let ((output (shell-command-to-string "source ~/.nvm/nvm.sh; nvm which")))
    (cadr (split-string output "[\n]+" t))))

(setq nodejs-repl-command #'mrf/nvm-which)

;;; --------------------------------------------------------------------------

(use-package js2-mode
  :hook (js-mode . js2-minor-mode)
  :bind (:map js2-mode-map
        ("{" . paredit-open-curly)
        ("}" . paredit-close-curly-and-newline))
  :mode ("\\.js\\'" "\\.mjs\\'" "\\.json$")
  :custom (js2-highlight-level 3))

(use-package ac-js2
  :after js2-mode
  :hook (js2-mode . ac-js2-mode))

;;; --------------------------------------------------------------------------

(defun mrf/load-c-file-hook ()
  (c-mode)
  (unless (featurep 'realgud))
  (use-package realgud)
  (highlight-indentation-mode nil)
  (display-fill-column-indicator-mode t))

(defun code-compile ()
  "Look for a Makefile and compiles the code with gcc/cpp."
  (interactive)
  (unless (file-exists-p "Makefile")
    (set (make-local-variable 'compile-command)
      (let ((file (file-name-nondirectory buffer-file-name)))
      (format "%s -o %s %s"
        (if  (equal (file-name-extension file) "cpp") "g++" "gcc" )
        (file-name-sans-extension file)
        file)))
    (compile compile-command)))

(global-set-key [f9] 'code-compile)
(add-to-list 'auto-mode-alist '("\\.c\\'" . mrf/load-c-file-hook))

;;; --------------------------------------------------------------------------

(use-package z80-mode
  :when enable-gb-dev
  :ensure (:host github :repo "SuperDisk/z80-mode"))

(use-package mwim
  :when enable-gb-dev
  :ensure (:host github :repo "alezost/mwim.el"))

(use-package rgbds-mode
  :when enable-gb-dev
  :after mwim
  :ensure (:host github :repo "japanoise/rgbds-mode"))
