emacs-config.org
*** Rustic package configuration

#+begin_src emacs-lisp

  (use-package rustic
    :ensure t
    :bind (:map rustic-mode-map
            ("M-j" . lsp-ui-imenu)
            ("M-?" . lsp-find-references)
            ("C-c C-c l" . flycheck-list-errors)
            ("C-c C-c a" . lsp-execute-code-action)
            ("C-c C-c r" . lsp-rename)
            ("C-c C-c q" . lsp-workspace-restart)
            ("C-c C-c Q" . lsp-workspace-shutdown)
            ("C-c C-c s" . lsp-rust-analyzer-status))
    :config
    ;; uncomment for less flashiness
    ;; (setq lsp-eldoc-hook nil)
    ;; (setq lsp-enable-symbol-highlighting nil)
    ;; (setq lsp-signature-auto-activate nil)

    ;; comment to disable rustfmt on save
    (setq rustic-format-on-save t)
    (add-hook 'rustic-mode-hook 'rk/rustic-mode-hook))

  (defun rk/rustic-mode-hook ()
    ;; so that run C-c C-c C-r works without having to confirm, but don't try to
    ;; save rust buffers that are not file visiting. Once
    ;; https://github.com/brotzeit/rustic/issues/253 has been resolved this should
    ;; no longer be necessary.
    (when buffer-file-name
      (setq-local buffer-save-without-query t))
    (add-hook 'before-save-hook 'lsp-format-buffer nil t))
  
#+end_src

*** Rust-mode configuration

#+begin_src emacs-lisp
  ;;; --------------------------------------------------------------------------

  ;; (use-package graphql-mode)
  (use-package rust-mode
    :defer t
    :init (setq rust-mode-treesitter-derive t)
    :hook
    (rust-mode . lsp-deferred)
    (rust-mode . (lambda () (setq indent-tabs-mode nil)
                   (prettify-symbols-mode)))
    :config
    (setq rust-format-on-save t))

  (use-package rust-playground :ensure t :after rust-mode)
  (use-package toml-mode :ensure t :after rust-mode)

#+end_src

*** Cargo-mode configuration

#+begin_src emacs-lisp

  (use-package cargo-mode
    :defer t
    :after rust-mode
    :ensure (:fetcher github :repo "ayrat555/cargo-mode"
            :files ("*.el" "*.el.in" "dir" "*.info" "*.texi"
                     "*.texinfo" "doc/dir" "doc/*.info" "doc/*.texi"
                     "doc/*.texinfo" "lisp/*.el"
                     (:exclude ".dir-locals.el" "test.el" "tests.el"
                       "*-test.el" "*-tests.el" "LICENSE" "README*"
                       "*-pkg.el"))))

#+end_src

** Golang
**** Important!
Make sure that =gopls= and =dlv= are installed. gopls is the Go! (or golang)  language server - like LSP. =dlv= is the =golang= debugger.

#+begin_src shell

  brew install gopls
  go get golang.org/x/tools/cmd/guru
  brew install dlv

#+end_src


*** Main go-mode config

#+begin_src emacs-lisp
    ;;; --------------------------------------------------------------------------

  (defun eglot-format-buffer-on-save ()
    (add-hook 'before-save-hook #'eglot-format-buffer -10 t))

  (use-package go-mode
    :defer t
    :mode ("\\.go\\'" . go-mode)
    :custom
    (compile-command "go build -v && go test -v && go vet")
    :bind (:map go-mode-map
  	  ("C-c C-c" . 'compile))
    :config
    (eglot-format-buffer-on-save)
    (define-key (current-local-map) "\C-c\C-c" 'compile)
    (cond
      ((equal custom-ide 'custom-ide-eglot)
        (add-hook 'go-mode-hook 'eglot-ensure)
        (add-hook 'go-mode-hook #'elot-format-buffer-on-save))
      ((equal custom-ide 'custom-ide-lsp)
        (add-hook 'go-mode-hook 'lsp-deferred))))
  
#+end_src

*** go-eldoc config

=go-eldoc.el= provides eldoc for Go language. `go-eldoc.el' shows type information
for variable, functions and current argument position of function.

#+begin_src emacs-lisp

  (use-package go-eldoc
    :after go-mode
    :hook (go-mode . go-eldoc-setup)
    :config
    (eglot-format-buffer-on-save)
    (set-face-attribute 'eldoc-highlight-function-argument nil
      :underline t :foreground "green"
      :weight 'bold))
  
#+end_src

*** go-guru config

Integration of the Go 'guru' analysis tool into Emacs.

#+begin_src emacs-lisp

  (use-package go-guru
    :after go-mode
    :hook (go-mode . go-guru-hl-identifier-mode))
  
#+end_src

** Other Languages
Lesser used or lesser known languages.

*** Lisp

Lisp support is handled by SLIME which is the “Superior Lisp Interaction Mode for Emacs”. SLIME extends Emacs with support for interactive programming in Common Lisp. The features are centered around slime-mode, an Emacs minor-mode that complements the standard lisp-mode. While lisp-mode supports editing Lisp source files, slime-mode adds support for interacting with a running Common Lisp process for compilation, debugging, documentation lookup, and so on. Extensive documentation can be found [[https://slime.common-lisp.dev/doc/html/][at this link]].

#+begin_src emacs-lisp
  ;;; --------------------------------------------------------------------------

  (use-package slime
    :defer t
    :mode ("\\.lisp\\'" . slime-mode)
    :config
    (setq inferior-lisp-program "/opt/homebrew/bin/sbcl"))

#+end_src

*** Swift / Swift Playground

#+begin_src emacs-lisp :tangle no
  ;;; --------------------------------------------------------------------------

  (use-package swift-mode
    :defer t
    :mode ("\\.swift\\'" . swift-mode))

  (use-package swift-helpful
    :ensure (:files ("*.el" "swift-info/*.info"
                      ("images" "swift-info/images/*.png") "swift-helpful-pkg.el")
              :host github
              :repo "danielmartin/swift-helpful"))

  (use-package swift-playground-mode :ensure t
    :init
    (autoload 'swift-playground-global-mode "swift-playground-mode" nil t)
    (add-hook 'swift-mode-hook #'swift-playground-global-mode))

#+end_src

** Debug Support
*** Debug Adapter Protocol for Emacs (<<<DAPE>>>)

Dape is a Debug Adapter Client written in pure Emacs. The debug adapter protocol, much like its more well-known counterpart, the language server protocol, aims to establish a common API for programming tools. However, instead of functionalities such as code completions, it provides a standardized interface for debuggers.

To begin a debugging session, invoke the dape command. In the minibuffer prompt, enter a debug adapter configuration name from dape-configs.

For complete functionality, make sure to enable eldoc-mode in your source buffers and repeat-mode for more pleasant key mappings.

**Features**

- Batteries included support (describe-variable dape-configs)
- Log breakpoints
- Conditional breakpoints
- Variable explorer
- Variable watch
- Variable hover with eldoc
- REPL
- gdb-mi.el like interface
- Memory editor with hexl
- Integration with compile
- Debug adapter configuration ergonomics
- No external dependencies outside of core Emacs

**** Example additional options

-----
*The following source blocks are meant as examples on what can be coded to enable certain features. They are normally NOT tangled.*

***** To not display info and/or buffers on startup:
#+begin_src emacs-lisp :tangle no
  (remove-hook 'dape-on-start-hooks 'dape-info)
  (remove-hook 'dape-on-start-hooks 'dape-repl)
#+end_src

***** To display info and/or repl buffers on stopped
#+begin_src emacs-lisp :tangle no
  (add-hook 'dape-on-stopped-hooks 'dape-info)
  (add-hook 'dape-on-stopped-hooks 'dape-repl)
#+end_src

***** By default dape uses gdb keybinding prefix If you do not want to use any prefix, set it to nil.
#+begin_src emacs-lisp :tangle no
  (setq dape-key-prefix "\C-x\C-a")
#+end_src

***** Kill compile buffer on build success:
#+begin_src emacs-lisp :tangle no
  (add-hook 'dape-compile-compile-hooks 'kill-buffer)
#+end_src

***** Save buffers on startup, useful for interpreted languages
#+begin_src emacs-lisp :tangle no
  (add-hook 'dape-on-start-hooks
    (defun dape--save-on-start ()
      (save-some-buffers t t)))
#+end_src
-----

**** DAPE Initialization

Please note that DAP is triggered after loading of various languages (for Emacs startup time).  New languages that use DAPE should also be listed. Don't put just ~prog-mode~ since we want to delay loading until needed be specific languages only.

#+begin_src emacs-lisp
  ;;; ------------------------------------------------------------------------

  (use-package dape
    :when (equal debug-adapter 'debug-adapter-dape)
    :init
    (define-dape-hydra)
    :after (:any python go-mode)
    ;; To use window configuration like gud (gdb-mi)
    ;; :init
    ;; (setq dape-buffer-window-arrangement 'gud)
    :custom
    (dape-buffer-window-arrangement 'right)  ;; Info buffers to the right
    :config
    (define-dape-hydra)
    (message "prepare-dape end")
    (bind-keys :map prog-mode-map
      ("C-c ." . dape-hydra/body))
    (mrf/additional-dape-configs))
  
#+end_src

**** DAPE for TypeScript

#+begin_src emacs-lisp
  ;;; --------------------------------------------------------------------------

  (setq mrf/vscode-js-debug-dir (file-name-concat user-emacs-directory "dape/vscode-js-debug"))

  (defun mrf/install-vscode-js-debug ()
    "Run installation procedure to install JS debugging support"
    (interactive)
    (mkdir mrf/vscode-js-debug-dir t)
    (let ((default-directory (expand-file-name mrf/vscode-js-debug-dir)))

      (vc-git-clone "https://github.com/microsoft/vscode-js-debug.git" "." nil)
      (call-process "npm" nil "*snam-install*" t "install")
      (call-process "npx" nil "*snam-install*" t "gulp" "dapDebugServer")))

#+end_src

****** Run This Only Once!

This is meant to be evaluated and run once. Calling this function will clone the vscode-js-debug framework. This is a DAP-based JavaScript debugger. It debugs Node.js, Chrome, Edge, WebView2, VS Code extensions, and more. It has been the default JavaScript debugger in Visual Studio Code since 1.46, and is gradually rolling out in Visual Studio proper.

#+begin_src emacs-lisp
  ;;; --------------------------------------------------------------------------

  ;; (mrf/install-vscode-js-debug)

#+end_src

#+RESULTS:
: vscode-js-debug installed

**** Additional DAPE Configs
:Golang:
#+begin_src emacs-lisp
  ;;; ------------------------------------------------------------------------
  (defun mrf/additional-dape-configs ()
    "Additional DAPE configruations for various languages."

    (with-eval-after-load
      (add-to-list 'dape-configs
        `(delve
         modes (go-mode go-ts-mode)
         command "dlv"
         command-args ("dap" "--listen" "127.0.0.1:55878")
         command-cwd dape-cwd-fn
         host "127.0.0.1"
         port 55878
         :type "debug"  ;; needed to set the adapterID correctly as a string type
         :request "launch"
         :cwd dape-cwd-fn
         :program dape-cwd-fn))))

#+end_src

**** DAPE Hydra

Below are all the necessary functions and definitions for Hydra use under DAPE.

