init.el

(use-package rustic
  :ensure t
  :bind (:map rustic-mode-map
          ("M-j" . lsp-ui-imenu)
          ("M-?" . lsp-find-references)
          ("C-c C-c l" . flycheck-list-errors)
          ("C-c C-c a" . lsp-execute-code-action)
          ("C-c C-c r" . lsp-rename)
          ("C-c C-c q" . lsp-workspace-restart)
          ("C-c C-c Q" . lsp-workspace-shutdown)
          ("C-c C-c s" . lsp-rust-analyzer-status))
  :config
  ;; uncomment for less flashiness
  ;; (setq lsp-eldoc-hook nil)
  ;; (setq lsp-enable-symbol-highlighting nil)
  ;; (setq lsp-signature-auto-activate nil)

  ;; comment to disable rustfmt on save
  (setq rustic-format-on-save t)
  (add-hook 'rustic-mode-hook 'rk/rustic-mode-hook))

(defun rk/rustic-mode-hook ()
  ;; so that run C-c C-c C-r works without having to confirm, but don't try to
  ;; save rust buffers that are not file visiting. Once
  ;; https://github.com/brotzeit/rustic/issues/253 has been resolved this should
  ;; no longer be necessary.
  (when buffer-file-name
    (setq-local buffer-save-without-query t))
  (add-hook 'before-save-hook 'lsp-format-buffer nil t))

;;; --------------------------------------------------------------------------

;; (use-package graphql-mode)
(use-package rust-mode
  :defer t
  :init (setq rust-mode-treesitter-derive t)
  :hook
  (rust-mode . lsp-deferred)
  (rust-mode . (lambda () (setq indent-tabs-mode nil)
                 (prettify-symbols-mode)))
  :config
  (setq rust-format-on-save t))

(use-package rust-playground :ensure t :after rust-mode)
(use-package toml-mode :ensure t :after rust-mode)

(use-package cargo-mode
  :defer t
  :after rust-mode
  :ensure (:fetcher github :repo "ayrat555/cargo-mode"
          :files ("*.el" "*.el.in" "dir" "*.info" "*.texi"
                   "*.texinfo" "doc/dir" "doc/*.info" "doc/*.texi"
                   "doc/*.texinfo" "lisp/*.el"
                   (:exclude ".dir-locals.el" "test.el" "tests.el"
                     "*-test.el" "*-tests.el" "LICENSE" "README*"
                     "*-pkg.el"))))

;;; --------------------------------------------------------------------------

(defun eglot-format-buffer-on-save ()
  (add-hook 'before-save-hook #'eglot-format-buffer -10 t))

(use-package go-mode
  :mode ("\\.go\\'" . go-mode)
  :config
  (eglot-format-buffer-on-save)
  (cond
    ((equal custom-ide 'custom-ide-eglot)
      (add-hook 'go-mode-hook 'eglot-ensure)
      (add-hook 'go-mode-hook #'eglot-format-buffer-on-save))
    ((equal custom-ide 'custom-ide-lsp)
      (add-hook 'go-mode-hook 'lsp-deferred))))

(use-package go-eldoc
  :after go-mode
  :hook (go-mode . go-eldoc-setup)
  :config
  (eglot-format-buffer-on-save)
  (set-face-attribute 'eldoc-highlight-function-argument nil
    :underline t :foreground "green"
    :weight 'bold))

(use-package go-guru
  :after go-mode
  :hook (go-mode . go-guru-hl-identifier-mode))

;;; --------------------------------------------------------------------------

(use-package slime
  :defer t
  :mode ("\\.lisp\\'" . slime-mode)
  :config
  (setq inferior-lisp-program "/opt/homebrew/bin/sbcl"))

;;; ------------------------------------------------------------------------

(use-package dape
  :when (equal debug-adapter 'debug-adapter-dape)
  :init
  (define-dape-hydra)
  :after (:any python go-mode)
  ;; To use window configuration like gud (gdb-mi)
  ;; :init
  ;; (setq dape-buffer-window-arrangement 'gud)
  :custom
  (dape-buffer-window-arrangement 'right)  ;; Info buffers to the right
  :config
  (define-dape-hydra)
  (message "prepare-dape end")
  (bind-keys :map prog-mode-map
    ("C-c ." . dape-hydra/body))
  (mrf/additional-dape-configs))

;;; --------------------------------------------------------------------------

(setq mrf/vscode-js-debug-dir (file-name-concat user-emacs-directory "dape/vscode-js-debug"))

(defun mrf/install-vscode-js-debug ()
  "Run installation procedure to install JS debugging support"
  (interactive)
  (mkdir mrf/vscode-js-debug-dir t)
  (let ((default-directory (expand-file-name mrf/vscode-js-debug-dir)))

    (vc-git-clone "https://github.com/microsoft/vscode-js-debug.git" "." nil)
    (call-process "npm" nil "*snam-install*" t "install")
    (call-process "npx" nil "*snam-install*" t "gulp" "dapDebugServer")))

;;; --------------------------------------------------------------------------

;; (mrf/install-vscode-js-debug)

;;; ------------------------------------------------------------------------
(defun mrf/additional-dape-configs ()
  "Additional DAPE configruations for various languages."

  (with-eval-after-load
    (add-to-list 'dape-configs
      `(delve
       modes (go-mode go-ts-mode)
       command "dlv"
       command-args ("dap" "--listen" "127.0.0.1:55878")
       command-cwd dape-cwd-fn
       host "127.0.0.1"
       port 55878
       :type "debug"  ;; needed to set the adapterID correctly as a string type
       :request "launch"
       :cwd dape-cwd-fn
       :program dape-cwd-fn))))

;;; --------------------------------------------------------------------------
