emacs-config.org
***** DAPE Hydra Debug Functions

#+begin_src emacs-lisp :output silent
  ;;; --------------------------------------------------------------------------

  (defun mrf/dape-end-debug-session ()
    "End the debug session."
    (interactive)
    (dape-quit))

  (defun mrf/dape-delete-all-debug-sessions ()
    "End the debug session and delete all breakpoints."
    (interactive)
    (dape-breakpoint-remove-all)
    (mrf/dape-end-debug-session))
  
#+end_src

***** DAPE Hydra Definition

#+begin_src emacs-lisp

  ;;; --------------------------------------------------------------------------

  (defun define-dape-hydra ()
    (defhydra dape-hydra (:color pink :hint nil :foreign-keys run)
      "
    ^Stepping^          ^Switch^                 ^Breakpoints^          ^Debug^                     ^Eval
    ^^^^^^^^----------------------------------------------------------------------------------------------------------------
    _._: Next           _st_: Thread             _bb_: Toggle           _dd_: Debug                 _ee_: Eval Expression
    _/_: Step in        _si_: Info               _bd_: Delete           _dw_: Watch dwim
    _,_: Step out       _sf_: Stack Frame        _ba_: Add              _dx_: end session
    _c_: Continue       _su_: Up stack frame     _bc_: Set condition    _dX_: end all sessions
    _r_: Restart frame  _sd_: Down stack frame   _bl_: Set log message  _dp_: Initialize DAPE
    _Q_: Disconnect     _sR_: Session Repl
                      _sU_: Info Update"
      ("n" dape-next)
      ("i" dape-step-in)
      ("o" dape-step-out)
      ("." dape-next)
      ("/" dape-step-in)
      ("," dape-step-out)
      ("c" dape-continue)
      ("r" dape-restart)
      ("si" dape-info)
      ("st" dape-select-thread)
      ("sf" dape-select-stack)
      ("su" dape-stack-select-up)
      ("sU" dape-info-update)
      ("sd" dape-stack-select-down)
      ("sR" dape-repl)
      ("bb" dape-breakpoint-toggle)
      ("ba" dape--breakpoint-place)
      ("bd" dape-breakpoint-remove-at-point)
      ("bc" dape-breakpoint-expression)
      ("bl" dape-breakpoint-log)
      ("dd" dape)
      ("dw" dape-watch-dwim)
      ("ee" dape-evaluate-expression)
      ("dx" mrf/dape-end-debug-session)
      ("dX" mrf/dape-delete-all-debug-sessions)
      ("dp" dape-prepare)
      ("x" nil "exit Hydra" :color yellow)
      ("q" mrf/dape-end-debug-session "quit" :color blue)
      ("Q" mrf/dape-delete-all-debug-sessions :color red)))
  
#+end_src

*** Debug Adapter Protocol (<<<DAP>>>)

DAP-Mode is an Emacs client/library for Debug Adapter Protocol is a wire protocol for communication between client and Debug Server. It's similar to the LSP but provides integration with debug server.

The idea behind the Debug Adapter Protocol (DAP) is to abstract the way how the debugging support of development tools communicates with debuggers or runtimes into a protocol. Since it is unrealistic to assume that existing debuggers or runtimes adopt this protocol any time soon, we rather assume that an intermediary component - a so called Debug Adapter - adapts an existing debugger or runtime to the Debug Adapter Protocol.

The Debug Adapter Protocol makes it possible to implement a generic debugger for a development tool that can communicate with different debuggers via Debug Adapters. And Debug Adapters can be re-used across multiple development tools which significantly reduces the effort to support a new debugger in different tools.

#+begin_src emacs-lisp
  ;;; --------------------------------------------------------------------------
  ;;; Debug Adapter Protocol
  (use-package dap-mode
    :when (equal debug-adapter 'debug-adapter-dap-mode)
    :after hydra
    ;; Uncomment the config below if you want all UI panes to be hidden by default!
    ;; :custom
    ;; (lsp-enable-dap-auto-configure nil)
    :commands dap-debug
    :custom
    (dap-auto-configure-features '(sessions locals breakpoints expressions repl controls tooltip))
    :config
    (require 'dap-lldb)
    (require 'dap-gdb-lldb)
    (define-dap-hydra)
    (bind-keys :map prog-mode-map
      ("C-c ." . dap-hydra/body))
    (dap-ui-controls-mode)
    (dap-ui-mode 1))

#+end_src

**** DAP Package for Python :Python:

#+begin_src emacs-lisp
  ;;; --------------------------------------------------------------------------
  ;;; DAP for Python

  (use-package dap-python
    :ensure (:package "dap-python" :type git :host github :repo "emacs-lsp/dap-mode")
    :when (equal debug-adapter 'debug-adapter-dap-mode)
    :after dap-mode
    :config
    (setq dap-python-executable "python3") ;; Otherwise it looks for 'python' else error.
    (setq dap-python-debugger 'debugpy))
  
#+end_src

**** DAP Setup for Rust and Go :Rust:Go:

Something that is needed for Rust and Go debugging.

#+begin_src emacs-lisp

  (use-package dap-lldb
    :when (equal debug-adapter 'debug-adapter-dap-mode)
    :defer t
    :after dap-mode
    :ensure (:package "dap-lldb" :source nil :protocol https :inherit t :depth 1 :type git :host github :repo "emacs-lsp/dap-mode")
    :custom
    (dap-lldb-debug-program "~/Developer/command-line-unix/llvm/lldb-build/bin/lldb-dap")
    :config
    (dap-register-debug-template
      "Rust::LLDB Run Configuration"
      (list :type "lldb"
        :request "launch"
        :name "LLDB::Run"
        :gdbpath "rust-lldb"
        :target nil
        :cwd nil)))

  (use-package dap-gdb-lldb
    :when (equal debug-adapter 'debug-adapter-dap-mode)
    :ensure (:package "dap-gdb-lldb" :source nil :protocol https :inherit t :depth 1 :type git :host github :repo "emacs-lsp/dap-mode")
    :defer t
    :after dap-lldb
    :config
    (dap-gdb-lldb-setup))

  (use-package dap-cpptools
    :when (equal debug-adapter 'debug-adapter-dap-mode)
    :defer t
    :after dap-mode
    :ensure (:package "dap-cpptools" :source nil :protocol https :inherit t :depth 1 :type git :host github :repo "emacs-lsp/dap-mode"))
    ;; :config
    ;; (dap-cpptools-setup))

#+end_src

**** DAP Template for NodeJS
#+begin_src emacs-lisp :tangle no
  ;;; --------------------------------------------------------------------------
  ;;; DAP for NodeJS

  (defun mrf/setup-dap-node ()
    "Require dap-node feature and run dap-node-setup if VSCode module isn't already installed"
    (require 'dap-node)
    (unless (file-exists-p dap-node-debug-path) (dap-node-setup)))

  (use-package dap-node
    :when (equal debug-adapter 'debug-adapter-dap-mode)
    :disabled
    :hook ((typescript-mode . mrf/setup-dap-node)
          (js2-mode . mrf/setup-dap-node))
    ;;:ensure (:host github :repo "emacs-lsp/dap-mode" :files (:defaults "icons" "dap-mode-pkg.el"))
    :after dap-mode
    :config
    (require 'dap-firefox)
    (dap-register-debug-template
      "Launch index.ts"
      (list :type "node"
        :request "launch"
        :program "${workspaceFolder}/index.ts"
        :dap-compilation "npx tsc index.ts --outdir dist --sourceMap true"
        :outFiles (list "${workspaceFolder}/dist/**/*.js")
        :name "Launch index.ts")))

#+end_src

**** DAP Templates For Various Languages :Python:Rust:

#+begin_src emacs-lisp

  (with-eval-after-load 'dap-lldb
    (dap-register-debug-template
      "Rust::LLDB Run Configuration"
      (list :type "lldb"
        :request "launch"
        :name "LLDB::Run"
        :gdbpath "rust-lldb"
        :target nil
        :cwd nil)))

  (with-eval-after-load 'dap-python
    (dap-register-debug-template "Python :: Run file from project directory"
      (list :type "python"
        :args ""
        :cwd nil
        :module nil
        :program nil
        :request "launch"))
    (dap-register-debug-template "Python :: Run file (buffer)"
      (list :type "python"
        :args ""
        :cwd nil
        :module nil
        :program nil
        :request "launch"
        :name "Python :: Run file (buffer)")))
  
#+end_src

**** DAP Hydra

Below are all the necessary functions and definitions for Hydra use under DAP.

***** DAP Hydra Debug Functions :Python:
#+begin_src emacs-lisp
  ;;; --------------------------------------------------------------------------

  (defun mrf/dap-end-debug-session ()
    "End the debug session and delete project Python buffers."
    (interactive)
    (kill-matching-buffers "\*Python :: Run file [from|\(buffer]*" nil :NO-ASK)
    (kill-matching-buffers "\*Python: Current File*" nil :NO-ASK)
    (kill-matching-buffers "\*dap-ui-*" nil :NO-ASK)
    (dap-disconnect (dap--cur-session)))

  (defun mrf/dap-delete-all-debug-sessions ()
    "End the debug session and delete project Python buffers and all breakpoints."
    (interactive)
    (dap-breakpoint-delete-all)
    (mrf/dap-end-debug-session))

  (defun mrf/dap-begin-debug-session ()
    "Begin a debug session with several dap windows enabled."
    (interactive)
    (dap-ui-show-many-windows)
    (dap-debug))

#+end_src

