init.el

(defun mrf/dape-end-debug-session ()
  "End the debug session."
  (interactive)
  (dape-quit))

(defun mrf/dape-delete-all-debug-sessions ()
  "End the debug session and delete all breakpoints."
  (interactive)
  (dape-breakpoint-remove-all)
  (mrf/dape-end-debug-session))

;;; --------------------------------------------------------------------------

(defun define-dape-hydra ()
  (defhydra dape-hydra (:color pink :hint nil :foreign-keys run)
    "
  ^Stepping^          ^Switch^                 ^Breakpoints^          ^Debug^                     ^Eval
  ^^^^^^^^----------------------------------------------------------------------------------------------------------------
  _._: Next           _st_: Thread             _bb_: Toggle           _dd_: Debug                 _ee_: Eval Expression
  _/_: Step in        _si_: Info               _bd_: Delete           _dw_: Watch dwim
  _,_: Step out       _sf_: Stack Frame        _ba_: Add              _dx_: end session
  _c_: Continue       _su_: Up stack frame     _bc_: Set condition    _dX_: end all sessions
  _r_: Restart frame  _sd_: Down stack frame   _bl_: Set log message  _dp_: Initialize DAPE
  _Q_: Disconnect     _sR_: Session Repl
                    _sU_: Info Update"
    ("n" dape-next)
    ("i" dape-step-in)
    ("o" dape-step-out)
    ("." dape-next)
    ("/" dape-step-in)
    ("," dape-step-out)
    ("c" dape-continue)
    ("r" dape-restart)
    ("si" dape-info)
    ("st" dape-select-thread)
    ("sf" dape-select-stack)
    ("su" dape-stack-select-up)
    ("sU" dape-info-update)
    ("sd" dape-stack-select-down)
    ("sR" dape-repl)
    ("bb" dape-breakpoint-toggle)
    ("ba" dape--breakpoint-place)
    ("bd" dape-breakpoint-remove-at-point)
    ("bc" dape-breakpoint-expression)
    ("bl" dape-breakpoint-log)
    ("dd" dape)
    ("dw" dape-watch-dwim)
    ("ee" dape-evaluate-expression)
    ("dx" mrf/dape-end-debug-session)
    ("dX" mrf/dape-delete-all-debug-sessions)
    ("dp" dape-prepare)
    ("x" nil "exit Hydra" :color yellow)
    ("q" mrf/dape-end-debug-session "quit" :color blue)
    ("Q" mrf/dape-delete-all-debug-sessions :color red)))

;;; --------------------------------------------------------------------------
;;; Debug Adapter Protocol
(use-package dap-mode
  :when (equal debug-adapter 'debug-adapter-dap-mode)
  :after hydra
  ;; Uncomment the config below if you want all UI panes to be hidden by default!
  ;; :custom
  ;; (lsp-enable-dap-auto-configure nil)
  :commands dap-debug
  :custom
  (dap-auto-configure-features '(sessions locals breakpoints expressions repl controls tooltip))
  :config
  (require 'dap-lldb)
  (require 'dap-gdb-lldb)
  (define-dap-hydra)
  (bind-keys :map prog-mode-map
    ("C-c ." . dap-hydra/body))
  (dap-ui-controls-mode)
  (dap-ui-mode 1))

;;; --------------------------------------------------------------------------
;;; DAP for Python

(use-package dap-python
  :ensure (:package "dap-python" :type git :host github :repo "emacs-lsp/dap-mode")
  :when (equal debug-adapter 'debug-adapter-dap-mode)
  :after dap-mode
  :config
  (setq dap-python-executable "python3") ;; Otherwise it looks for 'python' else error.
  (setq dap-python-debugger 'debugpy))

(use-package dap-lldb
  :when (equal debug-adapter 'debug-adapter-dap-mode)
  :defer t
  :after dap-mode
  :ensure (:package "dap-lldb" :source nil :protocol https :inherit t :depth 1 :type git :host github :repo "emacs-lsp/dap-mode")
  :custom
  (dap-lldb-debug-program "~/Developer/command-line-unix/llvm/lldb-build/bin/lldb-dap")
  :config
  (dap-register-debug-template
    "Rust::LLDB Run Configuration"
    (list :type "lldb"
      :request "launch"
      :name "LLDB::Run"
      :gdbpath "rust-lldb"
      :target nil
      :cwd nil)))

(use-package dap-gdb-lldb
  :when (equal debug-adapter 'debug-adapter-dap-mode)
  :ensure (:package "dap-gdb-lldb" :source nil :protocol https :inherit t :depth 1 :type git :host github :repo "emacs-lsp/dap-mode")
  :defer t
  :after dap-lldb
  :config
  (dap-gdb-lldb-setup))

(use-package dap-cpptools
  :when (equal debug-adapter 'debug-adapter-dap-mode)
  :defer t
  :after dap-mode
  :ensure (:package "dap-cpptools" :source nil :protocol https :inherit t :depth 1 :type git :host github :repo "emacs-lsp/dap-mode"))
  ;; :config
  ;; (dap-cpptools-setup))

(with-eval-after-load 'dap-lldb
  (dap-register-debug-template
    "Rust::LLDB Run Configuration"
    (list :type "lldb"
      :request "launch"
      :name "LLDB::Run"
      :gdbpath "rust-lldb"
      :target nil
      :cwd nil)))

(with-eval-after-load 'dap-python
  (dap-register-debug-template "Python :: Run file from project directory"
    (list :type "python"
      :args ""
      :cwd nil
      :module nil
      :program nil
      :request "launch"))
  (dap-register-debug-template "Python :: Run file (buffer)"
    (list :type "python"
      :args ""
      :cwd nil
      :module nil
      :program nil
      :request "launch"
      :name "Python :: Run file (buffer)")))

;;; --------------------------------------------------------------------------

(defun mrf/dap-end-debug-session ()
  "End the debug session and delete project Python buffers."
  (interactive)
  (kill-matching-buffers "\*Python :: Run file [from|\(buffer]*" nil :NO-ASK)
  (kill-matching-buffers "\*Python: Current File*" nil :NO-ASK)
  (kill-matching-buffers "\*dap-ui-*" nil :NO-ASK)
  (dap-disconnect (dap--cur-session)))

(defun mrf/dap-delete-all-debug-sessions ()
  "End the debug session and delete project Python buffers and all breakpoints."
  (interactive)
  (dap-breakpoint-delete-all)
  (mrf/dap-end-debug-session))

(defun mrf/dap-begin-debug-session ()
  "Begin a debug session with several dap windows enabled."
  (interactive)
  (dap-ui-show-many-windows)
  (dap-debug))

;;; --------------------------------------------------------------------------

(defun define-dap-hydra ()
