emacs-config.org
***** DAP Hydra Definition Function
#+begin_src emacs-lisp
  ;;; --------------------------------------------------------------------------

  (defun define-dap-hydra ()
    (defhydra dap-hydra (:color pink :hint nil :foreign-keys run)
      "
    ^Stepping^            ^Switch^                 ^Breakpoints^          ^Debug^                     ^Eval
    ^^^^^^^^----------------------------------------------------------------------------------------------------------------
    _._: Next            _ss_: Session            _bb_: Toggle           _dd_: Debug                 _ee_: Eval
    _/_: Step in         _st_: Thread             _bd_: Delete           _dr_: Debug recent          _er_: Eval region
    _,_: Step out        _sf_: Stack frame        _ba_: Add              _dl_: Debug last            _es_: Eval thing at point
    _c_: Continue        _su_: Up stack frame     _bc_: Set condition    _de_: Edit debug template   _ea_: Add expression.
    _r_: Restart frame   _sd_: Down stack frame   _bh_: Set hit count    _ds_: Debug restart
    _Q_: Disconnect      _sl_: List locals        _bl_: Set log message  _dx_: end session
                         _sb_: List breakpoints                          _dX_: end all sessions
                         _sS_: List sessions
                         _sR_: Session Repl
  "
      ("n" dap-next)
      ("i" dap-step-in)
      ("o" dap-step-out)
      ("." dap-next)
      ("/" dap-step-in)
      ("," dap-step-out)
      ("c" dap-continue)
      ("r" dap-restart-frame)
      ("ss" dap-switch-session)
      ("st" dap-switch-thread)
      ("sf" dap-switch-stack-frame)
      ("su" dap-up-stack-frame)
      ("sd" dap-down-stack-frame)
      ("sl" dap-ui-locals)
      ("sb" dap-ui-breakpoints)
      ("sR" dap-ui-repl)
      ("sS" dap-ui-sessions)
      ("bb" dap-breakpoint-toggle)
      ("ba" dap-breakpoint-add)
      ("bd" dap-breakpoint-delete)
      ("bc" dap-breakpoint-condition)
      ("bh" dap-breakpoint-hit-condition)
      ("bl" dap-breakpoint-log-message)
      ("dd" dap-debug)
      ("dr" dap-debug-recent)
      ("ds" dap-debug-restart)
      ("dl" dap-debug-last)
      ("de" dap-debug-edit-template)
      ("ee" dap-eval)
      ("ea" dap-ui-expressions-add)
      ("er" dap-eval-region)
      ("es" dap-eval-thing-at-point)
      ("dx" mrf/dap-end-debug-session)
      ("dX" mrf/dap-delete-all-debug-sessions)
      ("x" nil "exit Hydra" :color yellow)
      ("q" mrf/dap-end-debug-session "quit" :color blue)
      ("Q" mrf/dap-delete-all-debug-sessions :color red)))

#+end_src

z


* Company Mode

[[http://company-mode.github.io/][Company Mode]] provides a nicer in-buffer completion interface than =completion-at-point= which is more reminiscent of what you would expect from an IDE.  We add a simple configuration to make the keybindings a little more useful (=TAB= now completes the selection and initiates completion at the current location if needed).

We also use [[https://github.com/sebastiencs/company-box][company-box]] to further enhance the look of the completions with icons and better overall presentation.

#+begin_src emacs-lisp
  ;;; --------------------------------------------------------------------------

  ;; Don't use lsp-bridge with company as lsp-bridge already provides the same
  ;; features. They actually collide.
  
  (use-package company
    :unless (equal custom-ide 'custom-ide-lsp-bridge)
    :custom
    (company-minimum-prefix-length 2)
    (company-idle-delay 0.2)
    :config
    (global-company-mode +1))

#+end_src


#+begin_src emacs-lisp :tangle no
  ;;; --------------------------------------------------------------------------

  ;; Don't use lsp-bridge with company as lsp-bridge already provides the same
  ;; features. They actually collide.

  (use-package company
    :unless (equal custom-ide 'custom-ide-lsp-bridge)
    :bind (:map company-active-map
            ("C-n". company-select-next)
            ("C-p". company-select-previous)
            ("M-<". company-select-first)
            ("M->". company-select-last)
            ("<tab>" . company-complete-selection))
    :custom
    (company-minimum-prefix-length 2)
    (company-idle-delay 0.5)
    :config
    (global-company-mode +1))

  ;; IMPORTANT:
  ;; Don't use company at all if lsp-bridge is active.
  ;; lsp-bridge already provides similar functionality.

  ;; :config
  ;; (add-to-list 'company-backends 'company-yasnippet))

#+end_src

** Company Packages :Python:
#+begin_src emacs-lisp
  ;;; --------------------------------------------------------------------------

  (use-package company-box
    :after company
    :diminish cb
    :hook (company-mode . company-box-mode))

  (use-package company-jedi
    :when  (equal custom-ide 'custom-ide-elpy)
    :after python company
    :config
    (jedi:setup)
    (defun my/company-jedi-python-mode-hook ()
      (add-to-list 'company-backends 'company-jedi))
    (add-hook 'python-mode-hook 'my/company-jedi-python-mode-hook))

  (use-package company-anaconda
    :when (equal custom-ide 'custom-ide-anaconda)
    :after anaconda company
    :hook (python-mode . anaconda-mode)
    :config
    (eval-after-load "company"
      '(add-to-list 'company-backends 'company-anaconda)))

#+end_src



* Projectile

[[https://projectile.mx/][Projectile]] is a project management library for Emacs which makes it a lot easier to navigate around code projects for various languages.  Many packages integrate with Projectile so it's a good idea to have it installed even if you don't use its commands directly.

#+begin_src emacs-lisp
  ;;; --------------------------------------------------------------------------

  (use-package projectile
    :when (equal custom-project-handler 'custom-project-projectile)
    :diminish Proj
    :config (projectile-mode)
    :bind-keymap
    ("C-c p" . projectile-command-map)
    :init
    ;; NOTE: Set this to the folder where you keep your Git repos!
    (when (file-directory-p "~/Developer")
      (setq projectile-project-search-path '("~/Developer")))
    (setq projectile-switch-project-action #'projectile-dired))

  (when (equal completion-handler 'comphand-ivy-counsel)
    (use-package counsel-projectile
      :when (equal custom-project-handler 'custom-project-projectile)
      :after projectile
      :config
      (setq projectile-completion-system 'ivy)
      (counsel-projectile-mode)))

#+end_src


* Project.el
This is the default built-in project system. For those not needing the full-featured ~projectile~, this package is generally enough.

#+begin_src emacs-lisp

  (defun project-find-go-module (dir)
    (when-let ((root (locate-dominating-file dir "go.mod")))
      (cons 'go-module root)))

  (use-package project
    :when (equal custom-project-handler 'custom-project-project)
    :ensure nil
    :defer t
    :config
    (cl-defmethod project-root ((project (head go-module)))
      (cdr project))
    (add-hook 'project-find-functions #'project-find-go-module))

#+end_src


* Terminals
** term-mode

=term-mode= is a built-in terminal emulator in Emacs.  Because it is written in Emacs Lisp, you can start using it immediately with very little configuration.  If you are on Linux or macOS, =term-mode= is a great choice to get started because it supports fairly complex terminal applications (=htop=, =vim=, etc) and works pretty reliably.  However, because it is written in Emacs Lisp, it can be slower than other options like =vterm=.  The speed will only be an issue if you regularly run console apps with a lot of output.

One important thing to understand is =line-mode= versus =char-mode=.  =line-mode= enables you to use normal Emacs keybindings while moving around in the terminal buffer while =char-mode= sends most of your keypresses to the underlying terminal.  While using =term-mode=, you will want to be in =char-mode= for any terminal applications that have their own keybindings.  If you're just in your usual shell, =line-mode= is sufficient and feels more integrated with Emacs.

With =evil-collection= installed, you will automatically switch to =char-mode= when you enter Evil's insert mode (press =i=).  You will automatically be switched back to =line-mode= when you enter Evil's normal mode (press =ESC=).

Run a terminal with =M-x term!=

*Useful key bindings:*

- =C-c C-p= / =C-c C-n= - go back and forward in the buffer's prompts (also =[[= and =]]= with evil-mode)
- =C-c C-k= - Enter char-mode
- =C-c C-j= - Return to line-mode
- If you have =evil-collection= installed, =term-mode= will enter char mode when you use Evil's Insert mode

#+begin_src emacs-lisp
  ;;; --------------------------------------------------------------------------

  (use-package term+
    ;;:ensure (:repo "tarao/term-plus-el" :fetcher github)
    :commands term
    :config
    (setq explicit-shell-file-name "bash") ;; Change this to zsh, etc
    ;;(setq explicit-zsh-args '())          ;; Use 'explicit-<shell>-args for shell-specific args

    ;; Match the default Bash shell prompt.  Update this if you have a custom prompt
    (setq term-prompt-regexp "^[^#$%>\n]*[#$%>] *"))

#+end_src

** Better term-mode colors

The =eterm-256color= package enhances the output of =term-mode= to enable handling of a wider range of color codes so that many popular terminal applications look as you would expect them to.  Keep in mind that this package requires =ncurses= to be installed on your machine so that it has access to the =tic= program.  Most Linux distributions come with this program installed already so you may not have to do anything extra to use it.

#+begin_src emacs-lisp
  ;;; --------------------------------------------------------------------------

  (use-package eterm-256color
    :hook (term-mode . eterm-256color-mode))
  
#+end_src

