init.el
  (defhydra dap-hydra (:color pink :hint nil :foreign-keys run)
    "
  ^Stepping^            ^Switch^                 ^Breakpoints^          ^Debug^                     ^Eval
  ^^^^^^^^----------------------------------------------------------------------------------------------------------------
  _._: Next            _ss_: Session            _bb_: Toggle           _dd_: Debug                 _ee_: Eval
  _/_: Step in         _st_: Thread             _bd_: Delete           _dr_: Debug recent          _er_: Eval region
  _,_: Step out        _sf_: Stack frame        _ba_: Add              _dl_: Debug last            _es_: Eval thing at point
  _c_: Continue        _su_: Up stack frame     _bc_: Set condition    _de_: Edit debug template   _ea_: Add expression.
  _r_: Restart frame   _sd_: Down stack frame   _bh_: Set hit count    _ds_: Debug restart
  _Q_: Disconnect      _sl_: List locals        _bl_: Set log message  _dx_: end session
                       _sb_: List breakpoints                          _dX_: end all sessions
                       _sS_: List sessions
                       _sR_: Session Repl
"
    ("n" dap-next)
    ("i" dap-step-in)
    ("o" dap-step-out)
    ("." dap-next)
    ("/" dap-step-in)
    ("," dap-step-out)
    ("c" dap-continue)
    ("r" dap-restart-frame)
    ("ss" dap-switch-session)
    ("st" dap-switch-thread)
    ("sf" dap-switch-stack-frame)
    ("su" dap-up-stack-frame)
    ("sd" dap-down-stack-frame)
    ("sl" dap-ui-locals)
    ("sb" dap-ui-breakpoints)
    ("sR" dap-ui-repl)
    ("sS" dap-ui-sessions)
    ("bb" dap-breakpoint-toggle)
    ("ba" dap-breakpoint-add)
    ("bd" dap-breakpoint-delete)
    ("bc" dap-breakpoint-condition)
    ("bh" dap-breakpoint-hit-condition)
    ("bl" dap-breakpoint-log-message)
    ("dd" dap-debug)
    ("dr" dap-debug-recent)
    ("ds" dap-debug-restart)
    ("dl" dap-debug-last)
    ("de" dap-debug-edit-template)
    ("ee" dap-eval)
    ("ea" dap-ui-expressions-add)
    ("er" dap-eval-region)
    ("es" dap-eval-thing-at-point)
    ("dx" mrf/dap-end-debug-session)
    ("dX" mrf/dap-delete-all-debug-sessions)
    ("x" nil "exit Hydra" :color yellow)
    ("q" mrf/dap-end-debug-session "quit" :color blue)
    ("Q" mrf/dap-delete-all-debug-sessions :color red)))

;;; --------------------------------------------------------------------------

;; Don't use lsp-bridge with company as lsp-bridge already provides the same
;; features. They actually collide.

(use-package company
  :unless (equal custom-ide 'custom-ide-lsp-bridge)
  :custom
  (company-minimum-prefix-length 2)
  (company-idle-delay 0.2)
  :config
  (global-company-mode +1))

;;; --------------------------------------------------------------------------

(use-package company-box
  :after company
  :diminish cb
  :hook (company-mode . company-box-mode))

(use-package company-jedi
  :when  (equal custom-ide 'custom-ide-elpy)
  :after python company
  :config
  (jedi:setup)
  (defun my/company-jedi-python-mode-hook ()
    (add-to-list 'company-backends 'company-jedi))
  (add-hook 'python-mode-hook 'my/company-jedi-python-mode-hook))

(use-package company-anaconda
  :when (equal custom-ide 'custom-ide-anaconda)
  :after anaconda company
  :hook (python-mode . anaconda-mode)
  :config
  (eval-after-load "company"
    '(add-to-list 'company-backends 'company-anaconda)))

;;; --------------------------------------------------------------------------

(use-package projectile
  :when (equal custom-project-handler 'custom-project-projectile)
  :diminish Proj
  :config (projectile-mode)
  :bind-keymap
  ("C-c p" . projectile-command-map)
  :init
  ;; NOTE: Set this to the folder where you keep your Git repos!
  (when (file-directory-p "~/Developer")
    (setq projectile-project-search-path '("~/Developer")))
  (setq projectile-switch-project-action #'projectile-dired))

(when (equal completion-handler 'comphand-ivy-counsel)
  (use-package counsel-projectile
    :when (equal custom-project-handler 'custom-project-projectile)
    :after projectile
    :config
    (setq projectile-completion-system 'ivy)
    (counsel-projectile-mode)))

(defun project-find-go-module (dir)
  (when-let ((root (locate-dominating-file dir "go.mod")))
    (cons 'go-module root)))

(use-package project
  :when (equal custom-project-handler 'custom-project-project)
  :ensure nil
  :defer t
  :config
  (cl-defmethod project-root ((project (head go-module)))
    (cdr project))
  (add-hook 'project-find-functions #'project-find-go-module))

;;; --------------------------------------------------------------------------

(use-package term+
  ;;:ensure (:repo "tarao/term-plus-el" :fetcher github)
  :commands term
  :config
  (setq explicit-shell-file-name "bash") ;; Change this to zsh, etc
  ;;(setq explicit-zsh-args '())          ;; Use 'explicit-<shell>-args for shell-specific args

  ;; Match the default Bash shell prompt.  Update this if you have a custom prompt
  (setq term-prompt-regexp "^[^#$%>\n]*[#$%>] *"))

;;; --------------------------------------------------------------------------

(use-package eterm-256color
  :hook (term-mode . eterm-256color-mode))

;;; --------------------------------------------------------------------------
