init.el

(use-package vterm
  ;;:ensure (:fetcher github :repo "akermu/emacs-libvterm")
  :commands vterm
  :config
  (setq vterm-environment ("PS1=\\u@\\h:\\w \n$"))
  (setq term-prompt-regexp "^[^#$%>\n]*[#$%>] *")  ;; Set this to match your custom shell prompt
  (setq vterm-shell "zsh")                        ;; Set this to customize the shell to launch
  (setq vterm-max-scrollback 10000))

;;; --------------------------------------------------------------------------

(defun mrf/configure-eshell ()
  ;; Save command history when commands are entered
  (add-hook 'eshell-pre-command-hook 'eshell-save-some-history)
  ;; Truncate buffer for performance
  (add-to-list 'eshell-output-filter-functions 'eshell-truncate-buffer)
  (setq eshell-history-size   10000
    eshell-buffer-maximum-lines 10000
    eshell-hist-ignoredups t
    eshell-scroll-to-bottom-on-input t))

(use-package eshell-git-prompt
  :after eshell)

(use-package eshell
  :ensure
  :defer t
  :hook (eshell-first-time-mode . mrf/configure-eshell)
  :config
  (with-eval-after-load 'esh-opt
    (setq eshell-destroy-buffer-when-process-dies t)
    (setq eshell-visual-commands '("htop" "zsh" "vim")))
  (eshell-git-prompt-use-theme 'powerline))

;;; --------------------------------------------------------------------------

;; Prefer g-prefixed coreutils version of standard utilities when available
(let ((gls (executable-find "gls")))
  (when gls (setq insert-directory-program gls)))

(use-package all-the-icons-dired
  :after dired
  :hook (dired-mode . all-the-icons-dired-mode))

(use-package dired-open
  :commands (dired dired-jump)
  :config
  ;; Doesn't work as expected!
  ;;(add-to-list 'dired-open-functions #'dired-open-xdg t)
  (setq dired-open-extensions '(("png" . "feh")
                               ("mkv" . "mpv"))))

(use-package dired-hide-dotfiles
  :after dired-mode
  :hook (dired-mode . dired-hide-dotfiles-mode))

;;; --------------------------------------------------------------------------
;; Single Window dired - don't continually open new buffers

(defun mrf/dired-single-keymap-init ()
  "Bunch of stuff to run for dired, either immediately or when it's
   loaded."
  (define-key dired-mode-map
    [remap dired-find-file] 'dired-single-buffer)
  (define-key dired-mode-map
    [remap dired-mouse-find-file-other-window] 'dired-single-buffer-mouse)
  (define-key dired-mode-map
    [remap dired-up-directory] 'dired-single-up-directory))

(use-package dired-single
  :after dired
  :config
  (mrf/dired-single-keymap-init))

;;; --------------------------------------------------------------------------
;; helpful package

(use-package helpful
  :commands (helpful-callable helpful-variable helpful-command helpful-key)
  :custom
  (when (equal completion-handler 'comphand-ivy-counsel)
    (counsel-describe-function-function #'helpful-callable)
    (counsel-describe-variable-function #'helpful-variable))
  :config
  (when (equal completion-handler 'comphand-ivy-counsel)
    (bind-keys
      ([remap describe-function] . counsel-describe-function)
      ([remap describe-variable] . counsel-describe-variable)))
  (bind-keys
    ([remap describe-command] . helpful-command)
    ([remap describe-key] . helpful-key)))

;;; --------------------------------------------------------------------------

(use-package solaire-mode
  :after treemacs
  :ensure (:package "solaire-mode" :source "MELPA"
         :repo "hlissner/emacs-solaire-mode" :fetcher github)
  :hook (elpaca-after-init . solaire-global-mode)
  :config
  (push '(treemacs-window-background-face . solaire-default-face) solaire-mode-remap-alist)
  (push '(treemacs-hl-line-face . solaire-hl-line-face) solaire-mode-remap-alist))

;;; --------------------------------------------------------------------------
;; Golen Ratio
