emacs-config.org
** Golden Ratio
#+begin_src emacs-lisp
  ;;; --------------------------------------------------------------------------
  ;; Golen Ratio

  (use-package golden-ratio
    :when enable-golden-ratio
    :custom
    (golden-ratio-auto-scale t)
    (golden-ratio-adjust-factor .4)
    (golden-ratio-wide-adjust-factor .4)
    (golden-ratio-max-width 100)
    (golden-ratio-exclude-modes '(
                                 prog-mode
                                 dashboard-mode
                                 ;;inferior-emacs-lisp-mode
                                 ;;inferior-python-mode
                                 comint-mode
                                 ;;lisp-interaction-mode
                                 treemacs-mode
                                 undo-tree-visualizer-mode
                                 vundo-mode
                                 ))
    (golden-ratio-exclude-buffer-regexp '("dap*"
                                         "*dape*"
                                         "*python*"))
    :config
    (golden-ratio-mode 1))

#+end_src
** Swap Buffers

This file is for lazy people wanting to swap buffers without typing C-x b on each window.

#+begin_src emacs-lisp
  ;;; --------------------------------------------------------------------------
  
  (use-package buffer-move
    :bind (("C-S-<up>"     . buf-move-up)
          ("C-S-<down>"  . buf-move-down)
          ("C-S-<left>"  . buf-move-left)
          ("C-S-<right>" . buf-move-right)))

#+end_src

** Neotree
A tree plugin like NerdTree for Vim

#+begin_src emacs-lisp
  ;;; --------------------------------------------------------------------------

  (use-package neotree
    :when enable-neotree
    :config
    (global-set-key [f8] 'neotree-toggle)
    (setq neo-theme (if (display-graphic-p) 'icons 'arrow)))

#+end_src

** Useful functions and Keybindings
Here are some helpful functions.

#+begin_src emacs-lisp :tangle no
  ;;; --------------------------------------------------------------------------
  ;; Functions to insert the buffer file name at the current cursor position
  ;;
  (defun mrf/insert-buffer-full-name-at-point ()
    (interactive)
    (insert buffer-file-name))

  (defun mrf/insert-buffer-name-at-point ()
    (interactive)
    (insert (file-name-nondirectory (buffer-file-name))))

#+end_src

** Centaur Tabs
#+begin_src emacs-lisp
  ;;; --------------------------------------------------------------------------
  ;; Enable tabs for each buffer

  (use-package centaur-tabs
    :when enable-centaur-tabs
    :custom
    ;; Set the style to rounded with icons (setq centaur-tabs-style "bar")
    (centaur-tabs-style "bar")
    (centaur-tabs-set-icons t)
    (centaur-tabs-set-modified-marker t)
    :bind (("C-c <" . centaur-tabs-backward)
          ("C-c >" . centaur-tabs-forward))
    :config ;; Enable centaur-tabs
    (centaur-tabs-mode t))

#+end_src

** Diff HL
=diff-hl-mode= highlights uncommitted changes on the left side of the window (area also known as the "gutter"), allows you to jump between and revert them selectively.

#+begin_src emacs-lisp
  ;;; --------------------------------------------------------------------------

  (use-package diff-hl
    :config
    (global-diff-hl-mode))

#+end_src

** Pulsar
#+begin_src emacs-lisp
  ;;; --------------------------------------------------------------------------

  (use-package pulsar
    :config
    (pulsar-global-mode)
    :custom
    (pulsar-pulse t)
    (pulsar-delay 0.10)
    (pulsar-iterations 10)
    (pulsar-face 'pulsar-magenta)
    (pulsar-highlight-face 'pulsar-yellow))

#+end_src
** Rainbow-mode

This minor mode sets background color to strings that match color names, e.g. #0000FF is displayed in white with a blue background.

#+begin_src emacs-lisp

  (use-package rainbow-mode
    :hook (prog-mode . (lambda () (rainbow-mode t))))

#+end_src

** Lisp Hightlighter

highlight-defined is an Emacs minor mode that highlights defined Emacs Lisp symbols in source code.

#+begin_src emacs-lisp

  (use-package highlight-defined
    :hook (emacs-lisp-mode . highlight-defined-mode))

#+end_src

** Popper

Popper is a minor-mode to tame the flood of ephemeral windows Emacs produces, while still keeping them within arm’s reach.

Designate any buffer to “popup” status, and it will stay out of your way. Disimss or summon it easily with one key. Cycle through all your “popups” or just the ones relevant to your current buffer. Group popups automatically so you’re presented with the most relevant ones. Useful for many things, including toggling display of REPLs, documentation, compilation or shell output: any buffer you need instant access to but want kept out of your way!

#+begin_src emacs-lisp :tangle no
  ;;; --------------------------------------------------------------------------

  (use-package popper
    :bind (("C-`"   . popper-toggle)
          ("M-`"   . popper-cycle)
          ("C-M-`" . popper-toggle-type))
    :init
    (setq popper-reference-buffers
      '("\\*Messages\\*"
         "\\*scratch\\*"
         "\\*ielm\\*"
         "Output\\*$"
         "\\*Async Shell Command\\*"
         "^\\*eshell.*\\*$" eshell-mode ;eshell as a popup
         "^\\*shell.*\\*$"  shell-mode  ;shell as a popup
         "^\\*term.*\\*$"   term-mode   ;term as a popup
         "^\\*vterm.*\\*$"  vterm-mode  ;vterm as a popup
         help-mode
         compilation-mode))
    :config
    (popper-mode +1)
    (popper-echo-mode +1))

#+end_src

** Markdown Mode

markdown-mode is a major mode for editing Markdown-formatted text. The latest stable version is markdown-mode 2.5, released on Feb 12, 2022. See the release notes for details. markdown-mode is free software, licensed under the GNU GPL, version 3 or later.

#+begin_src emacs-lisp :tangle no

  (use-package markdown-mode
    :ensure t
    :mode ("README\\.md\\'" . gfm-mode)
    :init (setq markdown-command "multimarkdown"))

#+end_src

** GRIP Mode

Instant Github-flavored Markdown/Org preview using Grip (GitHub Readme Instant Preview).

#+begin_src emacs-lisp :tangle no

  ;; Use keybindings
  (use-package grip-mode
    :ensure t
    :bind (:map markdown-mode-command-map
           ("g" . grip-mode)))

  ;; Or using hooks
  (use-package grip-mode
    :ensure t
    :hook ((markdown-mode org-mode) . grip-mode))
  
#+end_src

** Mitch's Minor Mode

Mitch's minor mode (or <<<mmm>>>) just defines frequently used hot-keys. It works well when =which-key= is active.

*** Mitch's Minor Mode Functions
#+begin_src emacs-lisp
  
  (defun mrf/set-fill-column-interactively (num)
    "Asks for the fill column."
    (interactive "nfill-column: ")
    (set-fill-column num))

  (defun mrf/set-org-fill-column-interactively (num)
    "Asks for the fill column for Org mode."
    (interactive "norg-fill-column: ")
    (setq custom-org-fill-column num)
    (mrf/org-mode-visual-fill)
    (redraw-display))

#+end_src

*** Mitch's Minor-Mode Standard Keymaps

This is a set of keymaps that do the same things as the popup menu. Both are here for convenience. *Note* that the ~mmm-menu~ is called with either a ="C-c RET RET"= or simply a ="C-c C-<return>"=.

#+begin_src emacs-lisp
  ;;; --------------------------------------------------------------------------
  (defun mrf/define-mmm-minor-mode-map ()
    (defvar mmm-keys-minor-mode-map
      (let ((map (make-sparse-keymap)))
        (bind-keys :map map
  	("M-RET $" . jinx-correct)
          ("M-RET p" . pulsar-pulse-line)
          ("M-RET d" . dashboard-open)
          ("M-RET S e" . eshell)
          ("M-RET f" . mrf/set-fill-column-interactively)
          ("M-RET r" . repeat-mode)
          ("M-RET S i" . ielm)
          ("M-RET S v" . vterm-other-window)
          ("M-RET t" . treemacs)
          ("M-RET |" . global-display-fill-column-indicator-mode)
          ("M-RET T +" . next-theme)
          ("M-RET T -" . previous-theme)
          ("M-RET T ?" . which-theme)
          ("M-RET ?" . eldoc-box-help-at-point))
        map)
      "mmm-keys-minor-mode keymap.")

    (define-minor-mode mmm-keys-minor-mode
      "A minor mode so that my key settings override annoying major modes."
      :init-value t
      :lighter " mmm-keys"))

  (mrf/define-mmm-minor-mode-map)
  (mmm-keys-minor-mode 1)

#+end_src

*** MmM Context-Aware Keys and Descriptions

For those menus that would normally show up as either =prefix= or =lambda=, given them a better description via the which-key replacement function. This is run via the ~which-key-inhibit-display-hook~ hook which is run just before the which-key popup is
shown. Plus, some keys are mode specific and will only appear when that major mode is active.

#+begin_src emacs-lisp :results output silent

  (defun mrf/mmm-handle-context-keys ()
    "Enable or Disable keys based upon featurep context."
    (let ((map mmm-keys-minor-mode-map))
      (unbind-key "M-RET o f" map)
      (unbind-key "M-RET o l" map)
      (unbind-key "M-RET P ?" map)
      (unbind-key "M-RET M-RET" map)
      (cond
        ((equal major-mode 'org-mode)
        (bind-keys :map map
          ("M-RET M-RET" . org-insert-heading)
          ("M-RET o f" . mrf/set-org-fill-column-interactively)
          ("M-RET o l" . org-toggle-link-display)))
        ((equal major-mode 'python-mode)
        (bind-keys :map map
          ("M-RET P" . 'pydoc-at-point))))))

  (defun mrf/mmm-update-menu ()
    (interactive)
    (mrf/mmm-handle-context-keys)
    (which-key-add-key-based-replacements "M-RET S" "shells")
    (which-key-add-key-based-replacements "M-RET T" "theme-keys")
    (which-key-add-key-based-replacements "M-RET P" "python-menu")
    (which-key-add-key-based-replacements "M-RET o" "org-menu")
    (which-key-add-key-based-replacements "M-RET t" "treemacs-toggle")
    (which-key-add-key-based-replacements "M-RET f" "set-fill-column")
    (which-key-add-key-based-replacements "M-RET" "Mitch's Menu"))

  (add-hook 'which-key-inhibit-display-hook 'mrf/mmm-update-menu)

#+end_src

