init.el

(use-package golden-ratio
  :when enable-golden-ratio
  :custom
  (golden-ratio-auto-scale t)
  (golden-ratio-adjust-factor .4)
  (golden-ratio-wide-adjust-factor .4)
  (golden-ratio-max-width 100)
  (golden-ratio-exclude-modes '(
                               prog-mode
                               dashboard-mode
                               ;;inferior-emacs-lisp-mode
                               ;;inferior-python-mode
                               comint-mode
                               ;;lisp-interaction-mode
                               treemacs-mode
                               undo-tree-visualizer-mode
                               vundo-mode
                               ))
  (golden-ratio-exclude-buffer-regexp '("dap*"
                                       "*dape*"
                                       "*python*"))
  :config
  (golden-ratio-mode 1))

;;; --------------------------------------------------------------------------

(use-package buffer-move
  :bind (("C-S-<up>"     . buf-move-up)
        ("C-S-<down>"  . buf-move-down)
        ("C-S-<left>"  . buf-move-left)
        ("C-S-<right>" . buf-move-right)))

;;; --------------------------------------------------------------------------

(use-package neotree
  :when enable-neotree
  :config
  (global-set-key [f8] 'neotree-toggle)
  (setq neo-theme (if (display-graphic-p) 'icons 'arrow)))

;;; --------------------------------------------------------------------------
;; Enable tabs for each buffer

(use-package centaur-tabs
  :when enable-centaur-tabs
  :custom
  ;; Set the style to rounded with icons (setq centaur-tabs-style "bar")
  (centaur-tabs-style "bar")
  (centaur-tabs-set-icons t)
  (centaur-tabs-set-modified-marker t)
  :bind (("C-c <" . centaur-tabs-backward)
        ("C-c >" . centaur-tabs-forward))
  :config ;; Enable centaur-tabs
  (centaur-tabs-mode t))

;;; --------------------------------------------------------------------------

(use-package diff-hl
  :config
  (global-diff-hl-mode))

;;; --------------------------------------------------------------------------

(use-package pulsar
  :config
  (pulsar-global-mode)
  :custom
  (pulsar-pulse t)
  (pulsar-delay 0.10)
  (pulsar-iterations 10)
  (pulsar-face 'pulsar-magenta)
  (pulsar-highlight-face 'pulsar-yellow))

(use-package rainbow-mode
  :hook (prog-mode . (lambda () (rainbow-mode t))))

(use-package highlight-defined
  :hook (emacs-lisp-mode . highlight-defined-mode))

(defun mrf/set-fill-column-interactively (num)
  "Asks for the fill column."
  (interactive "nfill-column: ")
  (set-fill-column num))

(defun mrf/set-org-fill-column-interactively (num)
  "Asks for the fill column for Org mode."
  (interactive "norg-fill-column: ")
  (setq custom-org-fill-column num)
  (mrf/org-mode-visual-fill)
  (redraw-display))

;;; --------------------------------------------------------------------------
(defun mrf/define-mmm-minor-mode-map ()
  (defvar mmm-keys-minor-mode-map
    (let ((map (make-sparse-keymap)))
      (bind-keys :map map
        ("M-RET p" . pulsar-pulse-line)
        ("M-RET d" . dashboard-open)
        ("M-RET S e" . eshell)
        ("M-RET f" . mrf/set-fill-column-interactively)
        ("M-RET r" . repeat-mode)
        ("M-RET S i" . ielm)
        ("M-RET S v" . vterm-other-window)
        ("M-RET t" . treemacs)
        ("M-RET |" . global-display-fill-column-indicator-mode)
        ("M-RET T +" . next-theme)
        ("M-RET T -" . previous-theme)
        ("M-RET T ?" . which-theme)
        ("M-RET ?" . eldoc-box-help-at-point))
      map)
    "mmm-keys-minor-mode keymap.")

  (define-minor-mode mmm-keys-minor-mode
    "A minor mode so that my key settings override annoying major modes."
    :init-value t
    :lighter " mmm-keys"))

(mrf/define-mmm-minor-mode-map)
(mmm-keys-minor-mode 1)

(defun mrf/mmm-handle-context-keys ()
  "Enable or Disable keys based upon featurep context."
  (let ((map mmm-keys-minor-mode-map))
    (unbind-key "M-RET o f" map)
    (unbind-key "M-RET o l" map)
    (unbind-key "M-RET P ?" map)
    (unbind-key "M-RET M-RET" map)
    (cond
      ((equal major-mode 'org-mode)
      (bind-keys :map map
        ("M-RET M-RET" . org-insert-heading)
        ("M-RET o f" . mrf/set-org-fill-column-interactively)
        ("M-RET o l" . org-toggle-link-display)))
      ((equal major-mode 'python-mode)
      (bind-keys :map map
        ("M-RET P" . 'pydoc-at-point))))))

(defun mrf/mmm-update-menu ()
  (interactive)
  (mrf/mmm-handle-context-keys)
  (which-key-add-key-based-replacements "M-RET S" "shells")
  (which-key-add-key-based-replacements "M-RET T" "theme-keys")
  (which-key-add-key-based-replacements "M-RET P" "python-menu")
  (which-key-add-key-based-replacements "M-RET o" "org-menu")
  (which-key-add-key-based-replacements "M-RET t" "treemacs-toggle")
  (which-key-add-key-based-replacements "M-RET f" "set-fill-column")
  (which-key-add-key-based-replacements "M-RET" "Mitch's Menu"))

(add-hook 'which-key-inhibit-display-hook 'mrf/mmm-update-menu)

;;; --------------------------------------------------------------------------

(add-hook 'elpaca-after-init-hook
  (lambda ()
