emacs-config.org
** Initial *scratch* buffer message

#+begin_src emacs-lisp
  ;;; --------------------------------------------------------------------------

  (add-hook 'elpaca-after-init-hook
    (lambda ()
      (switch-to-buffer "*scratch*") (end-of-buffer)))

  (add-hook 'lisp-interaction-mode-hook
    (lambda ()
      (setq-default initial-scratch-message
        (format
        ";; Hello, World and Happy hacking %s!\n%s\n\n" user-login-name
        ";; Press M-RET (Meta-RET) to open Mitch's Context Aware Menu"))))

  (if dashboard-landing-screen
    ;; (add-hook 'inferior-emacs-lisp-mode 'dashboard-open) ;; IELM open?
    (add-hook 'lisp-interaction-mode-hook 'dashboard-open))

#+end_src


** Exiting and Cleanup

#+begin_src emacs-lisp

  (defun mrf/cleanup-when-exiting ()
    (let ((backdir (format "%s/config-backup" working-files-directory)))
      (make-directory backdir t)
      ;; Backup init.el
      (copy-file
        (expand-file-name "init.el" emacs-config-directory)
        (expand-file-name "init.el" backdir) t)))
      ;; (copy-file
      ;;   (expand-file-name "emacs-config.org" emacs-config-directory)
      ;;   (expand-file-name "emacs-config.org" backdir) t)))

  (add-hook 'kill-emacs-hook #'mrf/cleanup-when-exiting)

#+end_src


* Lastly

** Ignore Line Number Mode
The following is a list of major mode-hooks variables that are set so that they don't follow the normal global line number mode. If there is any mode that doesn't appear here, more than likely it will have line numbers added. Just add the hook name here to make it so that major mode not have line numbers. This doesn't effect minor modes.

#+begin_src emacs-lisp :tangle no
  ;;; --------------------------------------------------------------------------
  ;; Ignore Line Numbers for the following modes:

  ;; Line #'s appear everywhere
  ;; ... except for when in these modes
  (dolist (mode '(dashboard-mode-hook
                   helpful-mode-hook
                   eshell-mode-hook
                   eww-mode-hook
                   help-mode-hook
                   org-mode-hook
                   shell-mode-hook
                   term-mode-hook
                   treemacs-mode-hook
                   vterm-mode-hook))
    (add-hook mode (lambda () (display-line-numbers-mode 0))))

  (setq warning-suppress-types '((package reinitialization)
                                  (package-initialize)
                                  (package)
                                  (use-package)
                                  (python-mode)))
#+end_src

** Lispy Footer
The standard =lisp= footer that should appear at the end of every =lisp= source file.

#+begin_src emacs-lisp
  ;;; --------------------------------------------------------------------------

  ;;; init.el ends here.

#+end_src

# Local Variables:
# jinx-local-words: "Elpaca Flycheck Treesit el init"
# End:
