init.el
    (switch-to-buffer "*scratch*") (end-of-buffer)))

(add-hook 'lisp-interaction-mode-hook
  (lambda ()
    (setq-default initial-scratch-message
      (format
      ";; Hello, World and Happy hacking %s!\n%s\n\n" user-login-name
      ";; Press M-RET (Meta-RET) to open Mitch's Context Aware Menu"))))

(if dashboard-landing-screen
  ;; (add-hook 'inferior-emacs-lisp-mode 'dashboard-open) ;; IELM open?
  (add-hook 'lisp-interaction-mode-hook 'dashboard-open))

(defun mrf/cleanup-when-exiting ()
  (let ((backdir (format "%s/config-backup" working-files-directory)))
    (make-directory backdir t)
    ;; Backup init.el
    (copy-file
      (expand-file-name "init.el" emacs-config-directory)
      (expand-file-name "init-backup.el" backdir) t)
    (copy-file
      (expand-file-name "emacs-config.org" emacs-config-directory)
      (expand-file-name "emacs-config-backup.org" backdir) t)))

(add-hook 'kill-emacs-hook #'mrf/cleanup-when-exiting)

;;; --------------------------------------------------------------------------

;;; init.el ends here.
